{ "Name": "Ali Yawar Jafari", "Floor": "", "Age": "82", "Nationality": "", "Pic-url": "https://media.guim.co.uk/b8d5aff3ac0d9b845b02de95bf6356f88f149adc/0_471_2478_2477/140.jpg", "Short-biog": "A former jeweller from Afghanistan, Ali Yawar Jafari was devoted to his eight grandchildren", "Long-biog": "Ali Yawar Jafari used to say that life was short. \r\n\r\n\r\n“He always told us to enjoy life because it was short,” recalls his son, Hamid Ali Jafari. “He told us to travel the world and see everything.\r\n\r\n\r\n“He was a loving man. He used to love all the people around him: it didn’t matter if they weren’t family. He always told us to respect everyone. To do the right thing.”\r\n\r\n\r\nJafari began his working life as a jeweller in Afghanistan. He worked with precious stones and made rings and necklaces. “It was the family tradition,” says Hamid.\r\n\r\n\r\nWhen Jafari came to the UK in 1999 he was 61 and he struggled to learn English. He would spend his days instead in his friend's Afghan shop in Portobello market, talking about the old days and charming customers with his offers of tea in gentle, broken English. After lunch, his friend would take him home.\r\n \r\nHis eight grandchildren were the other focus of his life. “He spent hours playing cars with my three-year-old son,” says Hamid. “He would make all the noises of the different vehicles, all the emergency ones, and trains. He’d do it for as long as my son wanted – and that could be hours.”\r\n \r\nAn early riser, Jafari happily looked after his grandson if he woke before the boy’s parents.  “He would give him breakfast and talk to him until we woke up,” his son says.\r\n\r\n\r\n“My son is still asking after his grandfather. At the beginning, we told him his grandfather was away but now we’ve told him the truth. Now when he sees photos of his grandfather, he says: ‘Fire, fire. Bad fire.’ It breaks my heart.”", "Credit": "Amelia Hill" }, { "Name": "Marjorie Vital", "Floor": "16", "Age": "68", "Nationality": "", "Pic-url": "https://media.guim.co.uk/2d45f4c48fb4093c36539d0b52060cc109fa6d6b/583_130_873_873/140.jpg", "Short-biog": "Mother, grandmother, textile worker and long-term Grenfell resident, Marjorie Vital was devoted to her children", "Long-biog": "Mother, grandmother, textile worker and long-term Grenfell resident, Marjorie Vital was devoted to her children (? how many?) and \r\n\r\n\r\nOriginally from Dominica, she came to Britain as a girl and lived for more than 20 years in Grenfell tower in her 16th floor flat. Her son Ernie, who was staying with her on the night of the fire, also died. \r\n\r\n\r\nIn a statement, her family said: \"Marjorie was sixty-eight years old and she had worked in the textile industry for many years. She was a beautiful, joyful, independent, intelligent, kind hearted, sensitive individual who dedicated her life to her children. She carried herself with dignity and extended her warmth to family and friends.\r\n\"Through her creativity and joy of life she was an inspiration to many of us. She has been prematurely and dramatically taken from this world and will be sadly missed by family and friends, both here in the UK and abroad.\"\r\nThey did not respond to a request for further information on the family.", "Credit": "" }, { "Name": "Rania Ibrahim", "Floor": "23", "Age": "30", "Nationality": "", "Pic-url": "https://media.guim.co.uk/64742d27c097da2c25a352861f3f7360e7a74487/596_263_360_360/140.jpg", "Short-biog": "Originally from Egypt, Rania Ibrahim settled in the UK in 2009 after meeting her husband, Hassan. She posted footage of the fire online", "Long-biog": "Originally from Aswan in southern Egypt, Rania Ibrahim was the youngest of five girls. She settled in the UK in 2009 after meeting her husband, Hassan, and they had two daughters.\r\n\r\n\r\n“Rania did everything so fast, it’s as though she knew she was leaving life early,” says her sister Rasha Ibrahim. “She loved making food and sharing it with her neighbours. She loved life.”\r\n\r\n\r\nA former law student with a fondness for swimming and horse riding, the 30-year-old was a respected member of the local Muslim community who was committed to her faith. “She was the perfect example of a Muslim woman living in a non-Muslim country,” her sister says. “She was elegant, and cared for herself – and for other people.” \r\n\r\n\r\nIbrahim is most remembered by her family for her boundless positivity and sense of humour. “We loved to eat together, but it was always combined with a laugh,” her sister recalls. “We used to do crazy things together. I remember she was making pizza when I was with her once, and I got some flour and threw it on her. She was angry at first, but then she threw it at me – and then we ended up throwing it on everybody, including her kids. Our mother screamed at us!”\r\n\r\n\r\nIbrahim enjoyed documenting her life in London on social media, livestreaming family outings and funny moments. “She loved taking videos – lots of them,” her sister says. In the final video she posted, Ibrahim captured the view from her apartment window as she prayed. \r\n\r\n\r\nHer sister watched the fire that caused her sibling’s death via a live stream in Cairo. “She called me, and she was calm. She insisted she was OK,” she says. “But then I saw the live stream on TV, and I knew she wouldn’t make it.”\r\n\r\n\r\nRasha Ibrahim says her sister had a dream about the tower a month before the fire: “She dreamt that her parents were on different levels of the building. She heard them asking her to go to a higher floor. She believed this meant she will be in a higher place in heaven. Then she laughed.”", "Credit": "Ruth Michaelson and Adham Youssef" }, { "Name": "Mohamednur “Mo” Tuccu", "Floor": "", "Age": "44", "Nationality": "", "Pic-url": "https://media.guim.co.uk/5f508ec3370865139aececd3692b085a7e768f98/317_0_2036_2036/140.jpg", "Short-biog": "Originally from Eritrea and popular at his workplace, Mo's body was found outside the tower while his wife and daughter died inside", "Long-biog": "", "Credit": "", "NB": "Times says “Amaya lived with her mother, Amal Ahmedin, 35, and father, Mo Tuccu, 44, on the 19th floor.” - not clear this is correct", "JW": "“Mo was loved very much and will be greatly missed. I only knew Mo for two short years at Red but he had a way of making you feel like an old friend - welcome and at ease. I always enjoyed talking to him about his young daughter, who he said was growing up fast and becoming a cheeky “chatterbox” who he loved very much. I also enjoyed hearing about his various side projects on the go. Mo was a man of many talents, from serving up the finest Eritrean style coffee to being a crafty DIY-er. Word has it he was the fastest house-painter in all of London!", "https": "//twitter.com/redprnews/status/878520132674441216" }, { "Name": "Amna Mahmud Idris", "Floor": "19", "Age": "27", "Nationality": "Eritrea", "Pic-url": "", "Short-biog": "", "Long-biog": "", "Credit": "Guardian staff" }, { "Name": "Berkti Haftom", "Floor": "18", "Age": "29", "Nationality": "", "Pic-url": "https://media.guim.co.uk/609a87d61b19d1ea62cd7c1d1a0437c842037668/1239_6_1094_1094/140.jpg", "Short-biog": "Remembered for a vivid, upbeat approach to life and dedicated parenting of her 12-year-old son, Biruk, who also died", "Long-biog": "Berkti Haftom is remembered by those who knew her for her vivid, upbeat approach to life and dedicated parenting of her 12-year-old son, Biruk. Born and brought up in Eritrea, she lived in Italy before settling in London, but over the past decade had put down deep roots in North Kensington.\r\nStill a teenager when she became a mother, as a single parent she took a strong interest in her son’s education and was well regarded by his teachers. Paul Enright, who taught Biruk in primary school, says she closely tracked his academic progress and arranged after-school tutoring. Colleagues at the cafe in Holland Park where she worked part-time, serving food, drinks and ice-creams, remember her talking about her son all the time.\r\nAdegboyega Phillips, her manager there until she left for another job in 2016, says his concerns about gaps in her English when he interviewed her evaporated when she worked a trial shift. “She made it work for herself basically,” he says, her warmth and liveliness more than making up for any lapses in grammar. “She was the life and soul, she used to crack us up a lot.”  \r\nAs well as a sister in London, she had a group of close female friends, and Biruk’s father was still in touch. She belonged to an Eritrean Orthodox Christian church. She had a vulnerable side, and Phillips says she used to cry easily when colleagues were especially kind to her.\r\nParticular about her appearance, she worked out at the gym, and was fond of wearing bright colours, high heels and painted nails. In photographs with Biruk, their closeness is clear. They were lovely people, says Enright, combining good humour with a palpable sense of purpose.", "Credit": "Susanna Rustin" }, { "Name": "Hashim Kedir", "Floor": "22", "Age": "44", "Nationality": "", "Pic-url": "https://media.guim.co.uk/fd7cb8df5ec1b7fb81413cb3b3c929b13c57fdcf/423_0_1049_1049/140.jpg", "Short-biog": "A 44-year-old taxi driver and father of three who was a quiet but popular figure on the streets around Grenfell Tower", "Long-biog": "The things Hashim Kedir’s sister will remember most about him are the diversity of his friends, his smile, and his generosity. The 44-year-old taxi driver lived with his wife and three children on the 22nd floor of Grenfell Tower.\r\n\r\n\r\n“I used to be known as ‘Hashim’s sister’ – the sister of the smartest boy in our school,” says Assema Kedir. “It started in year 1 and followed me to university; Hashim’s sister ... I was proud but it was not always fun since most of the teachers expected the same from me!”\r\n\r\n\r\nIn a statement released after his death, Assema said Kedir was the person in the family people turned to if they were struggling and needed help: “You were the one I used to call when I had a problem that I couldn’t solve. You were the one I used to call when I had something good to tell. I don’t know what I am going to do without you.”\r\n\r\n\r\nNeighbours and friends described the taxi driver as a quiet but popular figure on the streets around the west London tower block, who made friends easily with people from all kinds of backgrounds and religions.\r\n\r\n\r\nAssema says: “One can tell the kind of person you were from the diversity of people that are crying over your death.”\r\n\r\n\r\nHashim, whose family originates from Ethiopia, used to play five-a-side football every Friday evening. Sean Mendez, who runs a local group for children from deprived backgrounds and knew the family well, was one of those who played in the Friday night matches.\r\n\r\n\r\n“He was really respectful always, thanking me for looking after the kids. He was really hard working, he was driven to make sure he was looking after people: the family, his friends, his neighbours. He was a lovely guy.”", "Credit": "Matthew Taylor" }, { "Name": "Nura Jamal", "Floor": "22", "Age": "35", "Nationality": "Ethiopia", "Pic-url": "https://media.guim.co.uk/6e7134ed710ff10679798fb426695e055135d982/448_0_1016_1016/140.jpg", "Short-biog": "\"She could befriend anyone, no matter who they were\"", "Long-biog": "Nura Jamal was a ball of positive energy. Friends of the 35-year-old, who lived with her husband and three children on the 22nd floor of Grenfell Tower, say her joy was contagious and that simply being around her “could lighten up anyone’s day in a matter of seconds”.\r\n\r\n\r\nJamal was devoted to her three children, Firdaws, Yahya and Yaqub, and was often seen ferrying them to and from school as well as to various sports groups and clubs. Her sister-in-law Assema Kedir says: “She could befriend absolutely anyone, no matter who they were or what they believed in.”\r\n\r\n\r\nSean Mendez, who runs Solidarity Sports, a charity that runs a children’s activity group that Jamal’s children attended, agrees: “She used to drop the kids off and pick them up and she was lovely – always ready with a smile and asking how you were. She was always smiling.”\r\n\r\n\r\nDonato Nardizzi, who taught Jamal’s sons taekwondo, says she always wanted to know how they were getting on: “She didn’t just drop them off and say hi; she watched and wanted to know how they were doing, what they needed to work on. She was totally engaged in them as people and was a tremendous support and source of love for them.”\r\n\r\n\r\nBut for Kedir it was her sister-in-law’s faith that stood out above all else. “One thing that made you so special was your constant devotion to your religion and your trust in Allah,” she said in a statement after her death. “We were all taken aback by the way you used to think of Allah in every matter in this world. Islam was your passion and you wisely managed to communicate your wisdom to your children in a way that no other parent could.”", "Credit": "Matthew Taylor" }, { "Name": "Mary Mendy", "Floor": "20", "Age": "54", "Nationality": "", "Pic-url": "https://media.guim.co.uk/9e88b3cda7b4c831748e3cddc24597de097a5570/357_165_168_168/140.jpg", "Short-biog": "Born in Gambia, Mary moved to Britain as a young woman. She was a care worker and lived with her daughter, the artist, Khadija Saye", "Long-biog": "", "Credit": "" }, { "Name": "Joseph Daniels", "Floor": "16", "Age": "69", "Nationality": "India", "Pic-url": "", "Short-biog": "\"He had a passion for weightlifting and was well known in local gyms\"", "Long-biog": "Joseph “Joe” Daniels was from Shimla in India, where his father was the headmaster of the prestigious Bishop Cotton school. In the early 1980s, in his mid-30s, he met Lucy Smyth, an 18-year-old teacher from North Kensington who was working at his father’s school. They were married and moved to London where their son, Sam, was born. \r\n\r\n\r\nInitially they lived in Smyth’s father’s basement apartment, but when a council flat in nearby Grenfell Tower became available they moved in there, on the 16th floor. \r\n\r\n\r\nDaniels had at one point been in the Indian air force, and in London worked a variety of security jobs. He also had had a passion for bodybuilding and weightlifting and was well known in the gyms of the area. \r\n\r\n\r\nWhen Sam was about 17, his parents, who had been very active in the tenants’ association of Grenfell Tower, separated. Lucy, who qualified as a barrister and works as a solicitor advocate, went to live a few streets away and Sam continued to live with his father. \r\n\r\n\r\nAbout six years ago Daniels began to suffer from dementia and his son became his full-time carer. When on 14 June smoke began to seep into their flat, Sam desperately tried to persuade his father to leave, but a confused Joe would not move. Sam, beginning to feel the effects of smoke, had to go. \r\n\r\n\r\nOn his way down he met firefighters and told them he had been forced to leave his father behind. They were unable to find Daniels, and Sam believes this is because, in the redecoration of the building a couple of years before the fire, the floors were renumbered, but the council did not paint the new numbers in the internal staircase.  \r\n\r\n\r\nDaniels was eventually identified by his DNA. He was 69.", "Credit": "Aida Edemariam" }, { "Name": "Gloria Trevisan", "Floor": "23", "Age": "26", "Nationality": "", "Pic-url": "https://media.guim.co.uk/5a7178cd63adb551186579ff572504ce0ef1167e/0_166_473_473/140.jpg", "Short-biog": "A talented young architect from Italy, Gloria moved to London in 2017 with her boyfriend, Marco Gottardi, who also died in the fire", "Long-biog": "A flair for drawing and a love of conservation meant Gloria Trevisan did not have to search for long to find work as an architect. But she was modest about her work, friends and relatives recall. \r\n\r\n\r\nA shy person, when she first met the parents of her boyfriend, Marco Gottardi, she hid behind their huge kitchen fridge, embarrassed because she had been brought back to the house overnight.\r\n\r\n\r\n“She tiptoed into our lives … but as we got to know her, she was a ray of light,” says Marco’s mother, Daniela. “She was very beautiful and caring. I knew exactly why my son wanted to be with her. They had a great love between them, she always had her arms wrapped around him.” \r\n\r\n\r\nThe 26-year-old from Camposampiero in northern Italy had moved to London with Gottardi in March 2017. The couple spent their first couple of weeks in the city doing an English-language course before setting out to find work. \r\n\r\n\r\nTrevisan was quickly snapped up by Peregrine Bryant Architecture. At the time of the Grenfell Tower fire, she had been with the studio in south-west London for less than two weeks, assigned to work on a refurbishment of the Grade I-listed Soane Stables buildings at the Royal Chelsea hospital.\r\n\r\n\r\n“She was very impressive and very quickly understood the building. She did one drawing, which was first class,” says the company’s senior partner, Peregrine Bryant.\r\n\r\n\r\nTrevisan worked on a team led by a fellow Italian architect, Laura Morgante.\r\n\r\n\r\n“She had the kind of knowledge about conservation that is usually very difficult to find in the UK,” says Morgante. “Her work was outstanding, and we were very happy for her to be working with us. She was very happy in London and was getting the kind of hands-on experience that is sometimes hard to come by in Italy.”\r\n\r\n\r\nThe practice set up an annual scholarship in the couple’s honour. Called the Gloria e Marco Award, it will support a graduate from the university they attended, Università Iuav di Venezia, to come to the UK to learn more about conservation.", "Credit": "Angela Giuffrida" }, { "Name": "Marco Gottardi", "Floor": "23", "Age": "27", "Nationality": "", "Pic-url": "https://media.guim.co.uk/5a7178cd63adb551186579ff572504ce0ef1167e/402_97_558_558/140.jpg", "Short-biog": "The 27-year-old architect moved to London from Italy in 2017 along with his girlfriend, Gloria Trevisan, who also perished", "Long-biog": "As a schoolboy, Marco Gottardi was already such an altruist that he once deliberately underperformed in a set of exams so he did not outshine his friends. \r\n\r\n\r\n“He never wanted to be the centre of attention,” says his father, Gianni. People who knew Marco describe him invariably as a gentlemen, selfless, and as a “man from a different era” who valued tradition. “He wished he’d lived during the 1970s,” says his mother, Daniela. “He used to say that those were better times.”\r\n\r\n\r\nGottardi grew up in San Stino di Livenza, a small town in northern Italy. He was passionate about ice-skating from an early age, winning several competitions before discovering football and becoming a loyal Juventus fan. He was an only child but was rarely alone, relishing the company of others. His parents often hosted parties, whether to celebrate his birthday, the end of the school year or his graduation.\r\n\r\n\r\nGottardi studied quantity surveying before settling on architecture. Along with his girlfriend of three years, Gloria Trevisan, the 27-year-old moved to London in March 2017 to move forward with his career and to learn English. The couple planned the move meticulously, and despite arriving without work, they were quickly hired. \r\n\r\n\r\nAfter a tiring search, they were also relieved to find an apartment they adored on the 23rd floor of Grenfell tower, moving in less than two months before the fire. “They did everything all by themselves, and they succeeded,” says Gianni.\r\n\r\n\r\nAs the couple embarked on their new lives, they kept their families updated via a WhatsApp group, sending photos of themselves around the city, among new friends, eating fish and chips and drinking beer – a first for Gottardi. \r\n\r\n\r\nHe was seen as calm, collected and sensitive to the feelings of others, traits he maintained during a call home before he died. “He told us there was smoke but was certain the rescuers would arrive. He was serene; he tried to keep his parents and girlfriend calm,” says Gianni.\r\n\r\n\r\nThe couple had been due to travel home to celebrate Gottardi’s 28th birthday on 26 June. \r\n\r\n\r\nHis parents have established a foundation called Grenfellove Marco and Gloria, which they hope will help other young Italians get a good start in life. “They were two people who had the great strength to start a professional path abroad all by themselves,” says Gianni Gottardi. “By setting this up, we can help others and remember them always.”", "Credit": "​​​​​​​​Angela Giuffrida" }, { "Name": "Omar Belkadi", "Floor": "22", "Age": "32", "Nationality": "", "Pic-url": "https://media.guim.co.uk/fd7cb8df5ec1b7fb81413cb3b3c929b13c57fdcf/388_0_1146_1146/140.jpg", "Short-biog": "Of British-Moroccan descent, the father of three died along with his wife, Farah Hamdan, and two of their daughters, Leena and Malek", "Long-biog": "Omar Belkadi died in the Grenfell Tower fire along with his wife, Farah Hamdan, and two of their daughters, Leena and Malek. One daughter, Tazmin, six, survived.\r\n\r\n\r\nThe family lived on the 20th floor of the tower. Of British-Moroccan descent, Belkadi, who was 32 when he died, was buried in Morocco. Little more is known of him. His family did not wish to speak further about his life.", "Credit": "Haroon Siddique" }, { "Name": "Farah Hamdan", "Floor": "20", "Age": "31", "Nationality": "Morocco", "Pic-url": "https://media.guim.co.uk/2473628a9d80b6165383db839b2a0f0287c77aa8/0_0_500_500/140.jpg", "Short-biog": "\"Quiet, confident and happy to give and take a joke\"", "Long-biog": "Farah Hamdan lived on the 20th floor of Grenfell Tower with her husband, Omar Belkadi, and three daughters, two of whom, Leena and Malek, died in the fire.\r\n\r\n\r\nOf British-Moroccan descent, Hamdan had worked at a nursery in Queen’s Park in north-west London, where she was described as an easygoing colleague: quiet, confident and happy to give and take a joke.\r\n\r\n\r\nLittle more is known about her life. A family member said they were still too grief-stricken to speak about their loss.", "Credit": "Guardian staff" }, { "Name": "Khadija Khalloufi", "Floor": "17", "Age": "", "Nationality": "", "Pic-url": "https://media.guim.co.uk/ef3c585932763127a2dd613097b5251c4bb23707/17_33_389_389/140.jpg", "Short-biog": "Met her husband nearly 30 years ago in west London and became separated from him as they tried to escape the tower", "Long-biog": "Khadjia Khalloufi was a Moroccan national who lived on the 17th floor of Grenfell tower with her husband Sabah Abdullah. They met nearly 30 years ago in west London when Khalloufi was a student in a business studies class that Abdullah, a lecturer, taught.\r\n\r\n\r\nA clearly bereft Abdullah, who survived the fire but lost contact with his wife during a terrifying exit from the building, described Khalloufi as a friendly, upbeat soul, quick to laugh and easy to befriend. \r\n\r\n\r\nKhalloufi, who is also survived by a stepson, was returned to her native Morocco for burial. The family did not wish to say more about her life.", "Credit": "Guardian staff" }, { "Name": "Abdeslam Sebbar", "Floor": "11", "Age": "77", "Nationality": "", "Pic-url": "", "Short-biog": "One of the older victims of the tragedy, Abdeslam Sebbar was aged 77 and lived in a flat on the 11th floor", "Long-biog": "One of the older victims of the tragedy, Abdeslam Sebbar was one of nine people from Morocco or of Moroccan origin to die in Grenfell tower.\r\nAged 77, he lived in a flat on the 11th floor. Little more is known of his life and attempts to contact people who knew him were unsuccessful.", "Credit": "Guardian staff" }, { "Name": "Abdulaziz el Wahabi", "Floor": "21", "Age": "52", "Nationality": "", "Pic-url": "https://media.guim.co.uk/fd7cb8df5ec1b7fb81413cb3b3c929b13c57fdcf/423_0_1049_1049/140.jpg", "Short-biog": "A porter at University College Hospital for more than 20 years and a father of three, Abdulaziz was popular, kind and ‘made the most of everything’", "Long-biog": "Abdulaziz El Wahabi was such a popular colleague at University College hospital, where he had worked for more than two decades, that a memorial bench was dedicated to him this year.\r\nEl Wahabi was 52 when he died along with his wife, Faouzia, and three children, Yasin, 20, Nur Huda, 16, and Mehdi, eight, in the Grenfell Tower fire. He worked as a porter at the hospital for 22 years and travelled to work on the tube each day from Latimer Road. \r\nHaving worked in two garages after leaving school, he found that hospital work suited him. In a statement, a week after the fire, UCLH chief executive Marcel Levi described him as an “extremely dedicated and hugely popular member of staff” and a “larger than life character” who never failed to show “kindness and compassion to patients and colleagues”.\r\nEl Wahabi spent his early childhood in the coastal town of Larache in northern Morocco before being brought to London with his siblings by his mother after his father settled in the Portobello Road area. The family had planned to return to Morocco but instead put down roots in the community in North Kensington, where El Wahabi attended Isaac Newton secondary school in Lancaster Road.\r\nHe had a strong interest in Moroccan culture, and sought his mother’s advice when he wanted to get married, and professional Bedouin musicians played at his wedding to Faouzia in Larache. His sister Hanan Wahabi – who lived several floors below him in Grenfell Tower and escaped the blaze – recalls his tales of colleagues eyeing up the couscous and tagine leftovers he would take with him to work for lunch. \r\nThe family, who visited Morocco the summer before they were killed, attended al-Manaar mosque and heritage centre where their children also took Arabic lessons. Hanan describes her brother as a man who “made the most of everything”.\r\nRemembered by his children’s teachers as a committed parent, he enjoyed taking the family on day trips to Brighton, and was hugely proud when his son Yasin went to Greenwich University.", "Credit": "Susanna Rustin" }, { "Name": "Faouzia El Wahabi", "Floor": "", "Age": "42", "Nationality": "", "Pic-url": "https://media.guim.co.uk/64c2b88bbc732d4f0ddb66b80dcaaef9beb20d1f/5_76_365_365/140.jpg", "Short-biog": "A lively, friendly woman who sometimes appeared more like a sibling than a parent to her two older children, Yasin and Nur Huda", "Long-biog": "A lively, friendly woman who sometimes appeared more like a sibling than a parent to her two older children is how relatives remember Faouzia El Wahabi. \r\n\r\n\r\nAn enthusiastic baker who was always trying out new cake recipes and cooking Moroccan food in her Grenfell Tower flat for relatives and friends, Faouzia, 42, was also a keen knitter. When she died, she was getting ready to teach a knitting and crochet class at the Westway Trust community centre, where she sold her handmade scarves and baby clothes, with the profits going back to the trust. \r\n\r\n\r\nUntil she married and moved to London aged 20 in 1995, Faouzia had lived in Larache, a coastal town in northern Morocco, with her parents and grandmother. She had known her future husband, Abdulaziz El Wahabi, and his family all her life. When the pair were reintroduced by older relatives after Abdulaziz told them of his wish to settle down, they fell in love.\r\n\r\n\r\nIn London, they moved in with her mother-in-law until they were offered a two-bedroom flat in Grenfell Tower when her first child, Yasin, was one. Yasin, his aunt remembers, was a difficult baby who childminders struggled with, and Faouzia’s early attempts at working outside the home in a school kitchen were given up in favour of full-time parenting.  \r\n\r\n\r\nYasin was followed by a daughter, Nur Huda, with whom Faouzia enjoyed following Moroccan dramas and soap operas on TV. Then there was a seven-year gap before Mehdi, the baby of the family, arrived.\r\n\r\n\r\n“You would always see her laughing and joking with her children, whenever you saw her out they would be with her,” says her sister-in-law and former neighbour, Hanan Wahabi. “That’s how she was with them, and every single one of them was a parent to Mehdi – it was a unique situation they had.” \r\n\r\n\r\n“There was a real sweetness to her, but beneath that there was a real desire to ensure her children got on,” says David Sellens, the headteacher at Thomas Jones school where two of the El Wahabis’ children were pupils.", "Credit": "Susanna Rustin" }, { "Name": "Yasin El Wahabi", "Floor": "21", "Age": "20", "Nationality": "", "Pic-url": "https://media.guim.co.uk/e95f42ba0ee8b0feca49147d63639788240b8429/234_93_277_277/140.jpg", "Short-biog": "Born and bred in North Kensington, Yasin was an accountancy student at Greenwich University who trained as a football referee", "Long-biog": "A part-time accountancy student at Greenwich University who did delivery work to earn some extra money, Yasin El Wahabi hoped one day to run his own business, possibly a milkshake bar. \r\n\r\n\r\nBorn at St Mary’s hospital in Paddington and brought up in North Kensington, Yasin, who was 20 when he died in the Grenfell Tower fire, went to Thomas Jones primary, Holland Park secondary and then Richmond College before securing the grades he needed to study for a degree. Academic work was a struggle at times, making his relatives all the prouder of his success in becoming the first member of the family to go to university.\r\n\r\n\r\nDavid Sellens, his primary headteacher, says Yasin was a “very handsome fellow – fit, strong and sporty”. The school was in the process of being turned around when he was a pupil there and Yasin, says Sellens, was part of the cohort that helped make that transformation happen.\r\n\r\n\r\nA supportive figure in the lives of his younger cousins, Yasin was a sociable and popular character who would help neighbours with bags and open doors. He had trained as a football referee and officiated at adult and children’s games. He is remembered for his kindness as well as his humour and youthful grin.\r\n\r\n\r\nIn a statement, when he was formally identified, his family said: “Yasin was a loveable, bubbly and caring young man. He would lend his hand to anyone who asked for help. He was loved by so many and his contagious smile will always be etched on our minds and hearts.”\r\n\r\n\r\nHe lived with his parents, sharing a bedroom with his younger brother, on the 21st floor of Grenfell Tower.", "Credit": "Susanna Rustin" }, { "Name": "Mehdi El Wahabi", "Floor": "21", "Age": "8", "Nationality": "", "Pic-url": "https://media.guim.co.uk/64c2b88bbc732d4f0ddb66b80dcaaef9beb20d1f/413_5_333_333/140.jpg", "Short-biog": "The doted-on youngest child of his parents, Abdulaziz and Faouzia El Wahabi, Mehdi liked to play on the landing outside his family’s flat", "Long-biog": "Just eight when he died and about to finish year 3 at Oxford Gardens primary school, within sight of his home in Grenfell Tower, the headteacher, Sarah Cooper, remembers Mehdi El Wahabi coming in dressed up as a caveman. “He had a wonderful sense of humour but was also very, very gentle. He would involve and reassure everybody,” she says.\r\n\r\n\r\nMehdi was the doted-on youngest child of his parents, Abdulaziz and Faouzia El Wahabi, and in the words of his aunt Hanan Wahabi, “definitely the baby of the family”. \r\n\r\n\r\nShe added: “Because he was the youngest he was cared for a lot, bless him. He wasn’t spoiled in the sense that he would get anything he wanted but they all mothered him.” In photographs he invariably wears a broad smile.\r\n\r\n\r\nThe landing outside his family’s 21st-floor flat was used as a play area by Mehdi, his nine-year-old cousin Sara Chebiouni, who lived several floors down, and the daughter of a neighbour. Inside the flat Mehdi enjoyed playing Minecraft and with Lego. He had small toys including Minions, Furbies and fidget spinners “arranged all over his desk so there was no more space, he was like a collector”, remembers Sara.\r\n\r\n\r\nHe liked ice-cream and curry, and kept a squishy red, white and blue rocket toy on his bed. Had he lived to adulthood, Sara says, he would have liked to be a comedian – though she says he had some work to do on his jokes.", "Credit": "Susanna Rustin" }, { "Name": "Vincent Chiejina", "Floor": "18", "Age": "60", "Nationality": "Nigeria", "Pic-url": "", "Short-biog": "Described as a gentlemen by those who knew him at the west London Catholic church where he attended mass every week", "Long-biog": "", "Credit": "Vincent Chiejina was described as a gentlemen by those who knew him at the west London Catholic church where he was a regular worshipper." }, { "Name": "Ligaya Moore", "Floor": "21", "Age": "78", "Nationality": "", "Pic-url": "https://media.guim.co.uk/3df9085bb1a3006e748c669aacb7f286d9659a0f/172_25_1279_1278/140.jpg", "Short-biog": "From an early age, Ligaya Moore wanted to work abroad. She arrived in London from the Philippines in 1972 and fell in love with the city", "Long-biog": "From an early age, Ligaya Moore wanted to work abroad. As a young woman in her native Manila she would genuflect in church in front of the Black Nazarene, a statue depicting a dark-skinned Jesus Christ, pleading for an opportunity.\r\n\r\n\r\n“It was always her dream,” her younger sister Estelita Griego recalls. “She prayed for it fervently.” She was desperate to escape – from the graveyard shift at a fishing port, and from a boyfriend who wanted to marry and settle down.\r\n\r\n\r\nMoore was 33 when her prayers were answered. A niece working as chambermaid in London invited her to come work for a family, taking care of their three children. She arrived in London in June 1972 and fell in love with the city. She wrote back to her family to say how it made her feel so “posh”.\r\n \r\n“She loved the children and took care of them like her own,” says her older sister, Zenaida Purificacion. “We were always happy, too, when she sent money to our mother. It meant a lot.”\r\n \r\nThe children were grownups when Moore left for another job at a teahouse. This was where she met her husband, James Moore, a retired British soldier. “She said James was always at the teahouse and kept ordering from her and from her alone,” says Purificacion. \r\n\r\n\r\nThey were both in their 50s. “He was tall and very handsome. There was a photo of him carrying her on their wedding day. It was the happiest day of her life,” says Griego.\r\n \r\nAfter her husband died of cancer, Moore lived alone at their flat on the 21st floor of Grenfell Tower. With its view of the city, it was a building she loved and boasted about to friends and family back in the Philippines.\r\n \r\nIn 2012, aged 73, Moore returned to Manila for the first time for a family reunion. “She was so pretty. Even in her age, she loved to put on make-up and wear high heels,” says Purificacion. This was how she lived her remaining years: spending time with loved ones. She doted on her neighbours’ children and on her great-nieces and -nephews back home. She loved to dance and cook. \r\n\r\n\r\nShe was one of the last victims of the fire to be identified, her remains found alongside the steel ribs of her collection of umbrellas. “The coroner said you’d be dead if you breathe the smoke from the fire for 15 minutes,” says her niece, May. “She must have died in her sleep.”\r\n\r\n\r\nHer remains were returned to Manila, to be buried alongside those of her parents.", "Credit": "Carmela Fonbuena" }, { "Name": "Zainab Deen", "Floor": "14", "Age": "32", "Nationality": "", "Pic-url": "https://media.guim.co.uk/bf341a66e7aef33457a08a6b147218d473e03ff9/28_0_897_897/140.jpg", "Short-biog": "A 32-year-old from Sierra Leone whose life was centred on religion and her two-year-old son, Jeremiah, who also died", "Long-biog": "Zainab Deen adored her two-year-old son, Jeremiah, and he adored her, says Lucinder Palmer, who had become something of a mother figure to the young woman in recent years. “He wouldn’t leave her for one minute and she wouldn’t leave him,” says Palmer. “He gave her the stability she’d been searching for. They were very close.” \r\n\r\n\r\nThe 32-year-old was brought to the UK from Sierra Leone by her father when she was a child but was no longer in contact with members of her family in Britain. Her mother is still in Sierra Leone: whenever she had money to spare, Zainab would send it home to her.  \r\n\r\n\r\n“We met at the New Life Ministries church six years ago,” says Palmer. “When she fell pregnant, Zainab asked me if I’d be her mother. She used to call me Mummy and, before she had Jeremiah, would spend all her time at my house,” said Palmer. “I was with her in hospital when she gave birth.”\r\n\r\n\r\n“I last spoke to her a week before the fire. She had a toothache and was very quiet.”\r\n\r\n\r\nZainab enjoyed dressing up and liked perfumes. She had many friends, says Palmer, but often felt unsafe and sad. More than anything, she wanted to settle down; to have a stable life, with a job, a partner and good friends. Religion was central to her and she attended a lot of different churches – searching, Palmer says, for somewhere she could fit in and feel at home. \r\n\r\n\r\n“She was a very nice person,” says Palmer. “She tried to have stable relationships and lead a good life. She would help people from the church, sweeping and cleaning for them. Her flat was always very clean and tidy. She took pride in her home.”", "Credit": "Amelia Hill" }, { "Name": "Fathia Ali Ahmed Alsanousi", "Floor": "", "Age": "73", "Nationality": "Sudan", "Pic-url": "https://media.guim.co.uk/79431b398d7d5aad1a9ce386fa782ca306778343/0_53_716_716/140.jpg", "Short-biog": "A teacher, mother of five and matriarch figure to much of London's Sudanese community, Fathia died with two of her children, Esra and Abufras", "Long-biog": "", "Credit": "Mark Rice-Oxley", "OVERMATTER": "", "twitter": "@markriceoxley69", "profile": "https://www.theguardian.com/profile/mark-rice-oxley" }, { "Name": "Abufras Ibrahim", "Floor": "23", "Age": "39", "Nationality": "Sudan", "Pic-url": "https://media.guim.co.uk/fd7cb8df5ec1b7fb81413cb3b3c929b13c57fdcf/423_0_1049_1049/140.jpg", "Short-biog": "Died when visiting his mother, Fathia Ali Ahmed Alsanousi, and sister, Esra, on the 23rd floor to break the Ramadan fast", "Long-biog": "Abufras Ibrahim was barely a teenager when he was suddenly uprooted from his home in Khartoum in Sudan, moving to London with his mother and sister in the early 1990s.\r\n\r\n\r\nThe family rarely spoke about why they left home, but Ibrahim’s mother, Fathia Alsanousi, was granted asylum, so people presumed it was a political problem. \r\n\r\n\r\nAbufras grew up as much British as Sudanese, a diligent child with more of a head for business than for academia. \r\n\r\n\r\n“He was a lovely boy,” says Wafa Hussein Osman, a family friend. “He was a very hard worker, but very supportive to his mum, always caring about her.” He was visiting his mother and his sister, Esra, in their 23rd-floor flat in Grenfell Tower on the night of the fire to break the Ramadan fast.\r\n\r\n\r\nIbrahim, 39, who lived in west London, was believed to have been running a shop with one of his two elder brothers.", "Credit": "Mark Rice-Oxley" }, { "Name": "Esra Ibrahim", "Floor": "23", "Age": "35", "Nationality": "Sudan", "Pic-url": "https://media.guim.co.uk/6e7134ed710ff10679798fb426695e055135d982/448_0_1016_1016/140.jpg", "Short-biog": "A PR worker who friends say felt more British after moving from Sudan aged 9, Esra lived in Grenfell with her mother, who also died", "Long-biog": "Esra Ibrahim was the youngest of five children born in Sudan to Fathia Alsanousi and her army officer husband, a family that hailed originally from the deserts of western Sudan and ended up in the high rises of western London.\r\n\r\n\r\nShe moved to London with her mother while still a young girl. The family rarely spoke about why they left Sudan. But Alsanousi was granted asylum, so people presumed it was a political problem. \r\n\r\n\r\nBecause she was just nine at the time, Ibrahim grew up feeling more British than Sudanese, friends say, and was a sweet girl who looked after her mother and was still living with her in Grenfell Tower when the atrocity happened last June.\r\n\r\n\r\n“She was like a little British girl,” says the family friend Wafa Hussein Osman, whose daughter was close to Ibrahim. “They don’t have any Sudanese accent. They dress British, but when we go to weddings or other events, Esra always tried to wear the traditional clothes. Her mother designed them. She was interested in the culture.”\r\n\r\n\r\nIbrahim, 35, worked in public relations and occasionally revisited the land of her birth. \r\n\r\n\r\n“She was a very sweet kid, she was really kind,” says Wafa Osman.", "Credit": "Mark Rice-Oxley", "twitter": "@markriceoxley69", "profile": "https://www.theguardian.com/profile/mark-rice-oxley" }, { "Name": "Khadija Saye", "Floor": "20", "Age": "24", "Nationality": "", "Pic-url": "https://media.guim.co.uk/b45612473cfc0fb5cc2ed87f16bbb63872caa1eb/675_390_639_639/140.jpg", "Short-biog": "Talented artist who worked hard to stand on the cusp of recognition while remaining devoted to her mother, Mary Mendy", "Long-biog": "For Khadija Saye, Grenfell Tower was not just a home: it was the studio where she developed her passion for art to the cusp of widespread recognition. Her work was exhibited last year at the Venice Biennale.\r\n\r\n\r\n“Khadija’s story is inspirational, it needs to be told so that other Khadijas in the world hear it,” says Nicola Green, an artist who had been a mentor to the 24-year-old for three years.\r\n\r\n\r\nBorn in London, Saye lived with her Gambian mother in a flat on the 20th floor of Grenfell tower. She had gone to a local school, but at 16 won a full scholarship to the prestigious Rugby school. \r\n\r\n\r\n“She was incredibly grateful for the experience, but she told me it was one of the most difficult things she had done,” says Green. “It was a completely different world to the one she was part of – she was living at the top of Grenfell Tower and the school was full of privileged people … it gave her an understanding that confidence is a mysterious thing – I think maybe it gave her the tenacity and determination to find it in herself.”\r\n\r\n\r\nAfter school, Saye went to the University for the Creative Arts, where she was part of a tight-knit group of four women who lived and created together. One of the group, Lou Johnson, describes her as “one of the most remarkable people I have ever, and probably will ever, meet”.\r\n\r\n\r\nHer best friend, the photographer Charlotte Levy, recalls: “She was just the most incredible person; she went through so much stuff, but she always listened and was always there for you. She was making such powerful work, but still saying she didn’t have a clue. She was such a beautiful person. She lit up a room.”\r\n\r\n\r\nFriends described her close relationship with her mother, Mary Mendy, who also died. “Khadija had the most beautiful, soulful spirit, she was so deeply connected to her mother,” says Green.\r\n\r\n\r\nSaye had also faced financial barriers. “She was using her own money to fund her work,” says Green. “She didn’t know anyone in the art world, she didn’t come from that world, but she was so clear about her own work and her desire to create.”\r\n\r\n\r\nHer work Dwelling: in this space we breathe was exhibited at the Venice Biennale. The series of photographs explores traditional Gambian spiritual practices, and it was this work that led Andrew Nairne, the director of Kettle’s Yard gallery, to meet Saye just before her death.\r\n\r\n\r\n“That she had created such a remarkable, powerful, original series of works was quite extraordinary,” says Nairne. “It’s an absolute tragedy – this was such a confident first body of work, but there was so much more to come. She had a remarkable future ahead of her.”", "Credit": "Alexandra Topping" }, { "Name": "Logan Gomes", "Floor": "21", "Age": "0", "Nationality": "UK", "Pic-url": "", "Short-biog": "Stillborn in hospital the day after the fire – his mother lived on the 21st floor and was seven months pregnant", "Long-biog": "Logan Gomes was stillborn in hospital the day after the Grenfell Tower fire. His mother, Andreia, who was seven months pregnant, lived on the 21st floor with her husband and two children.\r\nPolice officially recorded the infant as a victim of the fire.", "Credit": "Guardian staff" }, { "Name": "Deborah Lamprell", "Floor": "16", "Age": "45", "Nationality": "", "Pic-url": "", "Short-biog": "A popular member of the front of house team at Opera Holland Park, Deborah lived alone in the tower and was close to her mother", "Long-biog": "Deborah Lamprell nearly always arrived early for her job as part of the front of house team at Opera Holland Park. “I’d come past around 4.30pm or 4.45pm, and Debbie was always the first person I saw every day – even though her start time was 5.30pm,” says Michael Volpe, OHP’s general director.\r\n\r\n\r\n“She knew everyone; all the singers knew her, all the orchestra knew her. Everyone loved her because she was so chirpy, and she remembered things. She’d ask after someone’s mum, or their children.”\r\n\r\n\r\nThe 45-year-old lived alone on the 16th floor of Grenfell Tower. She had previously worked at various embassies and at Kensington police station.\r\n\r\n\r\n“Debbie knew nothing about opera when she joined us, but she grew to absolutely love it,” says Volpe. “She must have listened to hundreds of performances in her time here. She used to sit on a particular bench, from which you can see the stage and watch the show.\r\n\r\n\r\n“In her role she met a kaleidoscope of people, but she was exactly the same with everyone. She didn’t adapt herself to fit in with others. A lot of people who come and work for us are at drama college or training to be singers, but others are just local working-class people, and Debbie was one of those.”\r\n\r\n\r\nLamprell was very close to her mother, says Volpe. “She rang her every day, saw her lots and texted her after work. Her father died a few years ago, and Debbie was an only child, so she looked after her mum.”\r\n\r\n\r\nOn the night of the fire, Lamprell reportedly texted her mother at about 11.30pm to say she had got home safely. She was identified by dental records after her remains were found on the 23rd floor. In a statement, her mother, who asked not to be named, said Debbie was a “wonderful, precious daughter, always smiling and helping others”.\r\n\r\n\r\nHer funeral was attended by former school friends, says Volpe. “Debbie was still close to people she grew up with; they’d stayed friends. She was just an incredibly nice person.”", "Credit": "Harriet Sherwood" }, { "Name": "Gary Maunders", "Floor": "23", "Age": "57", "Nationality": "", "Pic-url": "", "Short-biog": "One of the few victims who did not live in Grenfell, the father of four was visiting a friend and died on the 23rd floor", "Long-biog": "Gary Maunders, a painter-decorator from west London, was a father of four who relished the limelight. “He could talk,” Tammy Maunders recalls of her older brother. “He had so many stories to tell.”\r\n\r\n\r\nMaunders, 57, did not leave home until he was in his early 40s, playing a very active role in the early lives of his two nieces, Channel and Kenita Spence, who were brought up in the family home.\r\n\r\n\r\n“He was fun to be around – a real Peter Pan,” says Channel, recalling his fondness for Marvin Gaye and Manchester United. She remembers how he would take her out to the football pitch outside their house and pass on a few tips.\r\n\r\n\r\n“We grew up around him,” Channel says. “He had a heart of gold. He was the life and soul – when he entered a room he was the centre of attention.”\r\n\r\n\r\n“You couldn’t be sad around him. And if you were he’d make you laugh,” Kenita adds.\r\n\r\n\r\nMaunders was one of the few Grenfell victims who did not live in the tower; he was visiting a friend the night of the fire, and died on the 23rd floor. But he was as rooted in the area as anyone and, apart from a few family holidays in Spain and Mexico, spent his entire life in and around the North Kensington area.\r\n\r\n\r\nIn his latter years, he liked to pass on words of wisdom to the younger generation. “He was old school,” says Channel. “He loved to pass on his knowledge.\r\n\r\n\r\n“He was a massive part of our lives. We feel his absence. He is so missed.”", "Credit": "Mark Rice-Oxley" }, { "Name": "Jessica Urbano Ramirez", "Floor": "20", "Age": "12", "Nationality": "", "Pic-url": "https://media.guim.co.uk/5388bf6cef392096ad70a5b2e40709f8a749cd90/231_0_1136_1136/140.jpg", "Short-biog": "Three weeks short of her 13th birthday when she died, Jessica was described her mother as a “kind, happy, clever girl and so strong\"", "Long-biog": "Jessica Ramirez was three weeks short of her 13th birthday when she died in Grenfell Tower. She lived with her mother, who is from Colombia, on the 20th floor, having moved from east London a year before.\r\n\r\n\r\nDescribed by her mother, who worked nights as a cleaner, as a “kind, happy, clever girl and so strong”, she became one of the best-known faces of the disaster after relatives put up missing posters of her around North Kensington in the days after the fire.\r\n\r\n\r\nHer family have requested privacy and did not want to speak further for this project. \r\n\r\n\r\nIn a statement last year, they said: “Our little girl was loving, kind-hearted and caring. She brought joy to everyone who met her and her laugh was contagious. Jessica will leave a lasting legacy in the hearts of her family and friends and the many, many people who didn't know her personally but have come to know her since that night of 14 June.\r\n\r\n\r\n“Her light will shine bright and will light our individual paths as we start to move forward into coming to terms with our loss and heartbreak.”", "Credit": "Guardian staff" }, { "Name": "Hania Hassan", "Floor": "23", "Age": "3", "Nationality": "", "Pic-url": "", "Short-biog": "Hania was often shown smiling and hugging her sister, Fethia, in photos. The girls died with their mother, Rania Ibrahim", "Long-biog": "", "Credit": "Ruth Michaelson and Adham Youssef" }, { "Name": "Fethia Hassan", "Floor": "23", "Age": "5", "Nationality": "", "Pic-url": "", "Short-biog": "A caring and sociable child, five-year-old Fethia died with her mother, Rania Ibrahim and younger sister, Hania Hassan", "Long-biog": "Fethia Hassan lost her life in the Grenfell Tower fire, aged just five. She was the daughter of Rania Ibrahim, whose footage of the burning tower, posted online, alerted many to the deadly blaze. \r\n\r\n\r\nFethia was born in 2012 to Ibrahim and Hassan Hassan, a Sudanese-British national who was in Cairo because of his brother’s ill health at the time of the fire. “She had been sad in the last six months as her father was away,” says Fethia’s aunt Rasha Ibrahim. “Many times, Fethia told Rasha that there were lots of things she wanted to tell her father.” \r\n\r\n\r\nFethia was a soft-spoken but sociable child, and had a close relationship with her younger sister, Hania, three, and her cousin Moaz. \r\n\r\n\r\n“In kindergarten, Fethia was like a mother to her classmates,” her aunt says. “She was a leading character. She would care for her classmates, making sure they ate and stayed calm while away from their families during the day. She liked other children.”\r\n\r\n\r\nPerhaps because of her warm relationships with the other children at Goldborne and Maxilla children’s centre in west London, Fethia wanted to be a teacher when she grew up. \r\n\r\n\r\n“She used to joke with me, and tell me: ‘Auntie, sharing is caring!’ I wouldn’t understand what she’d said, as it was in English,” says Rasha Ibrahim, speaking in Arabic. “I would look to Rania to translate, and then we’d all laugh.” \r\n\r\n\r\nFethia’s family had moved to Grenfell Tower just over a year before the fire, after ricocheting between different forms of social housing including a short stay in a flat at a mosque. She would later be memorialised at the al-Manaar mosque in west London where a funeral for her, her sister and her mother was held last September.", "Credit": "Ruth Michaelson and Adham Youssef" }, { "Name": "Victoria King", "Floor": "20", "Age": "71", "Nationality": "", "Pic-url": "", "Short-biog": "A long-term Grenfell Tower resident who died alongside her daughter, Alexandra Atala", "Long-biog": "Victoria King was one of the last victims of the fire to be identified, a long-term Grenfell Tower resident who lived on the 20th floor with her daughter, Alexandra Atala. \r\n\r\n\r\nLittle more is known about her life. Her family could not be contacted for more information. They issued the following statement after the 71-year-old’s remains were identified in November: \r\n\r\n\r\n\"Some comfort can come from the knowledge that she and Alexandra were devoted to one another and spent so many mutually supportive years together. They died at each other's side and now they can rest together in peace.\r\n\r\n\r\n\"We will remember them always.\"", "Credit": "Guardian staff" }, { "Name": "Alexandra Atala", "Floor": "20", "Age": "40", "Nationality": "", "Pic-url": "", "Short-biog": "One of the last victims to be identified and a long-term Grenfell Tower resident who lived with her mother, Victoria King", "Long-biog": "Alexandra Atala was one of the last victims to be identified, a long-term Grenfell Tower resident who lived on the 20th floor with her mother, Victoria King. \r\n\r\n\r\nLittle more is known about her life. Her family could not be contacted for more information. They issued the following statement after the 40-year-old’s remains were identified in November: \r\n\r\n\r\n\"Some comfort can come from the knowledge that (mother and daughter) were devoted to one another and spent so many mutually-supportive years together. They died at each other's side and now they can rest together in peace.\r\n\r\n\r\n\"We will remember them always.\"", "Credit": "Guardian staff" }, { "Name": "Isaac Paulos", "Floor": "18", "Age": "5", "Nationality": "", "Pic-url": "https://media.guim.co.uk/6a008f1b74d8dca6541c2678869fa52d1ec8b0df/121_0_481_481/140.jpg", "Short-biog": "Isaac’s family came from Ethiopia. The five-year old schoolboy loved swimming, football and playing games with his friends", "Long-biog": "Isaac’s family came from Ethiopia. The five-year old schoolboy lived on the 18th floor with his mother, father and younger brother.\r\n\r\n\r\nThe family has requested privacy since the fire, but said in a statement: “Isaac, our beloved son, was taken from us when he was only five years old.  We will all miss our kind, energetic, generous little boy. He was such a good boy who was loved by his friends and family.\r\n\r\n\r\n“We will miss him forever, but we know God is looking after him now and that he is safe in heaven.”\r\n\r\n\r\nAn obituary read out at his funeral by a family friend described him as a \"smart and generous little boy\" who loved swimming, football and playing games with his friends.\r\n\r\n\r\nA letter sent by a five-year-old playmate said: \"Isaac can still play in heaven with the other children. He is also with the angels.\"", "Credit": "Guardian staff" }, { "Name": "Ernie Vital", "Floor": "16", "Age": "", "Nationality": "", "Pic-url": "https://media.guim.co.uk/29ee045107dc0cedff2dee771bae22922efbeb57/0_214_1523_1522/140.jpg", "Short-biog": "His family described Ernie as a polite, creative man who worked in catering. He had been staying with his mother, Marjorie, who also died", "Long-biog": "Ernie Vital had been staying with his mother on the 16th floor of the tower on the night of the fire. His mother, Marjorie, was of Dominican descent.", "Credit": "" }, { "Name": "Raymond Bernard", "Floor": "23", "Age": "63", "Nationality": "", "Pic-url": "", "Short-biog": "Friends describe the 63-year old, who lived on the top floor of Grenfell Tower, as caring and loving", "Long-biog": "Friends describe the 63-year old, who lived on the top floor of Grenfell Tower with his king charles spaniel, Marley, as caring and loving. \r\n\r\n\r\nHis family declined a request to speak more about his life for this project.\r\n\r\n\r\n\"Gone but not forgotten, you are so dearly loved by us all and will sadly be missed by many. May you rest in eternal peace, with love always,” they said in a statement at the time his death was confirmed.", "Credit": "Guardian staff" }, { "Name": "Nadia Choucair", "Floor": "22", "Age": "33", "Nationality": "Lebanon", "Pic-url": "https://media.guim.co.uk/841e4b2844c35aa1ef6a1d742541d74bda8ffe4e/0_71_470_470/140.jpg", "Short-biog": "", "Long-biog": "", "Credit": "Susanna Rustin" }, { "Name": "Bassem Choucair", "Floor": "22", "Age": "40", "Nationality": "Lebanon", "Pic-url": "https://media.guim.co.uk/fb38b4791f96f20864ccff22698b3079345b14f4/43_162_377_377/140.jpg", "Short-biog": "", "Long-biog": "", "Credit": "Susanna Rustin" }, { "Name": "Fatima Choucair", "Floor": "22", "Age": "11", "Nationality": "UK", "Pic-url": "https://media.guim.co.uk/dc2ddeae9a876ed39fed57d188a3402a0854247b/134_140_222_222/140.jpg", "Short-biog": "", "Long-biog": "", "Credit": "Susanna Rustin" }, { "Name": "", "Floor": "22", "Age": "13", "Nationality": "", "Pic-url": "https://media.guim.co.uk/dc2ddeae9a876ed39fed57d188a3402a0854247b/277_4_260_260/140.jpg", "Short-biog": "Close to completing her second year of secondary school when she died, Mierna is remembered as a talented writer and driven student", "Long-biog": "Close to completing her second year of secondary school when she died aged 13, Mierna Choucair is remembered as a talented writer and driven student who teachers expected to thrive at university and beyond.\r\nDeputy head girl at her primary school, Avondale Park – a position also held by neighbour Firdaws Hashim, who also died in the fire – Mierna was described by her year 6 teacher Emma Kibble as an “exceptional role model who always gave 100% effort”. \r\nThe costumes she designed and made for World Book Day – Maleficent, Dorothy from the Wizard of Oz, and the Kenyan village girl from Eileen Browne’s book Handa’s Surprise – were legendary, and she had thrown herself into the life of her secondary school, Kensington Aldridge Academy, taking part in competitions and appearing on stage.\r\nWell-liked without being ostentatiously popular, Mierna was the eldest of three sisters who lived in a large 22-floor flat in Grenfell tower with their mother and father, immigrants from the Bekaa valley in eastern Lebanon.\r\nShe was highly motivated but with a self-effacing streak. One teacher described her work in literacy classes as being among the strongest she had ever seen. \r\nOn the cusp of adolescence, she had started to wear her dark hair untied and led her mother – who she resembled physically - to consult friends about how to manage a teenage girl.", "Credit": "" }, { "Name": "Denis Murphy", "Floor": "14", "Age": "56", "Nationality": "Ireland", "Pic-url": "https://media.guim.co.uk/ee05ef372ce28bbfe012cb47211ec7687ae2fa32/62_276_1470_1470/140.jpg", "Short-biog": "\"We feel lucky and blessed that he was part of our family\"", "Long-biog": "Murphy was a long-term Grenfell resident who grew up in London after his mother Anne moved to Britain from Limerick in Ireland.\r\n\r\n\r\nA Chelsea supporter, Murphy was remembered in a 56th-minute ovation at Stamford Bridge last September, days before his funeral. His family did not wish to say any more about his life to the Guardian, but issued a statement after his death was confirmed.\r\n\r\n\r\n“To us he was an inspiration and an amazing, selfless, caring person and we feel lucky and blessed that he was part of our family, and his warmth and love will stay with us forever. What really matters to us is what he stood for – family, friends, community, loyalty and love – and our lives will never be the same without him.”", "Credit": "Guardian staff" }