[{"Name":"Sakineh Afrasiabi","Floor":"18","Age":"65","Nationality":"Iranian","Pic-url":"https://media.guim.co.uk/ff0a52ae969f10c298db359b3760ff8bcc7e74e7/33_55_764_763/140.jpg","Short-biog":"\"She helped a lot of refugees, she would shelter them in her flat\"","Long-biog":"Three months after Sakineh Afrasiabi moved to Grenfell Tower in 2016, she told her daughter that she wished she had a pair of binoculars. In a matter of days, Nazanin Aklani fulfilled her mother’s wish.\r\n\r\n\r\n“She had got used to her flat at the 18th floor,” Aklani says. “She used to say: ‘It’s as if I’m on a plane, I can see the whole of London from up here.’”\r\n\r\n\r\nThe 65-year-old lived high up in the tower despite being disabled, walking with the aid of a frame. She was rehoused in Grenfell last year; her requests for an accessible flat did not yield any results.\r\n\r\n\r\nAfrasiabi, who died along with her sister, Fatemeh, on the 23rd floor, apparently while seeking an escape route, had moved to the UK in 1997. She lived on the second floor of a property in Ladbroke Grove for 18 years before being rehoused in Grenfell. \r\n\r\n\r\n“She had a lovely heart,” Aklani says. “Anyone who had any problems would go to her. She helped a lot of refugees, she would shelter them in her flat, she would do things that people don’t do in this day and age. Everyone relied on her.”\r\n\r\n\r\nAfrasiabi came from Abadan in western Iran, close to Iraq. When the Iran-Iraq war broke out in early 1980s, the family fled to Shiraz in the south. She moved to the UK after separating from her husband, raising her five children – two sons and three daughters – alone.\r\n\r\n\r\nShe had requested to be rehoused in 2000 because her flat did not have a lift, but she never succeeded in securing more suitable accommodation. She had an earlier bid for a flat on the ground floor declined because “it was not step free”.\r\n\r\n\r\nAfrasiabi worked briefly for Punch and Judy nursery in Earl’s Court but could not continue because of her deteriorating health. \r\n\r\n\r\nAklani adds: “She spoke English, she had a lot of Iranian friends but also a lot of British and African friends, she had a lot of foreign friends. You’d go to her house and you’d see five to six people there all the time. She had grown to love Grenfell Tower. We had bought her new furniture and even installed a new kitchen. In her latter months, she was happy living there.”","Credit":"Saeed Kamali Dehghan"},{"Name":"Fatemeh Afrasiabi","Floor":"Non-resident","Age":"59","Nationality":"Iranian","Pic-url":"https://media.guim.co.uk/ff0a52ae969f10c298db359b3760ff8bcc7e74e7/1216_104_602_602/140.jpg","Short-biog":"Her dream was to visit Egypt: “She was fascinated by the place\"","Long-biog":"Fatemeh Afrasiabi was one of the few Grenfell Tower victims who did not live in the block. On the night of the fire she was visiting her sister, Sakineh Afrasiabi. The 59-year-old Iranian was a relative newcomer to Britain, arriving as a refugee in 2013.\r\n\r\n\r\nIn the early 1980s, when the Iran-Iraq war broke out, Afrasiabi had to flee her home town of Abadan, living in Shiraz before moving to Isfahan, Iran’s top tourist destination.\r\n\r\n\r\n“She was a very artistic and romantic woman,” says Nazanin Aklani, her niece. “She had the most difficult problems in life but still she was positive, nice and inspirational. She’d look at a flower and talk about it for a long time.”\r\n\r\n\r\nAfrasiabi always wanted to be a carpenter, Aklani says. “She liked painting and tailoring and making dolls. Sometime she’d sew something and would sell it.”\r\n\r\n\r\nShe lived in a small studio flat in Enfield, north London. She had health problems and spent a great deal of time with her sister at Grenfell. On the night of the fire, Afrasiabi and her sister were taken to the 23rd floor by an Afghan family who were trying to help them, but both of them died.\r\n\r\n\r\nShe had five children, who all lived in Iran. “She missed her children a lot and would Facetime there and talk to them all the time,” Aklani says. “She would always say that I’ll see them again.” \r\n\r\n\r\nAklani recalls fondly how Afrasiabi was keen to play a big role in her niece’s wedding. “She got involved a lot,” she says.\r\n\r\n\r\nShe also remembers how her aunt loved sewing but did not have enough money to buy a sewing machine: “When I got married, my mother bought me a sewing machine. I never learned how to work with it so I gave it to my auntie – she’d do a lot of work with it. She’d cut our trousers or sew us a cushion.”\r\n\r\n\r\nAfrasiabi’s dream was to visit Egypt. “She’d say whenever I get my British passport, the first place I’ll go will be Egypt,” says Aklani. “She was fascinated by the place and was hopeful. She’d say ‘I’ll live at least for another 15 years, so I’ll get to see it.’”","Credit":"Saeed Kamali Dehghan"},{"Name":"Yasin El Wahabi","Floor":"21","Age":"20","Nationality":"British","Pic-url":"https://media.guim.co.uk/e95f42ba0ee8b0feca49147d63639788240b8429/234_93_277_277/140.jpg","Short-biog":"The first in his family to go to university, he hoped one day to own a business","Long-biog":"A part-time accountancy student at Greenwich University who did delivery work to earn some extra money, Yasin El Wahabi hoped one day to run his own business, possibly a milkshake bar. \r\n\r\n\r\nBorn at St Mary’s hospital in Paddington and brought up in North Kensington, Yasin, who was 20 when he died in the Grenfell Tower fire, went to Thomas Jones primary, Holland Park secondary and then Richmond College before securing the grades he needed to study for a degree. Academic work was a struggle at times, making his relatives all the prouder of his success in becoming the first member of the family to go to university.\r\n\r\n\r\nDavid Sellens, his primary headteacher, says Yasin was a “very handsome fellow – fit, strong and sporty”. The school was in the process of being turned around when he was a pupil there and Yasin, says Sellens, was part of the cohort that helped make that transformation happen.\r\n\r\n\r\nA supportive figure in the lives of his younger cousins, Yasin was a sociable and popular character who would help neighbours with bags and open doors. He had trained as a football referee and officiated at adult and children’s games. He is remembered for his kindness as well as his humour and youthful grin.\r\n\r\n\r\nIn a statement, when he was formally identified, his family said: “Yasin was a loveable, bubbly and caring young man. He would lend his hand to anyone who asked for help. He was loved by so many and his contagious smile will always be etched on our minds and hearts.”\r\n\r\n\r\nHe lived with his parents, sharing a bedroom with his younger brother, on the 21st floor of Grenfell Tower. Some friends say that on the night of the fire, with residents scrambling to get out of the building, Yasin ran the other way - to get back up the stairs and help rescue his family.","Credit":"Susanna Rustin"},{"Name":"Mehdi El Wahabi","Floor":"21","Age":"Eight","Nationality":"British","Pic-url":"https://media.guim.co.uk/64c2b88bbc732d4f0ddb66b80dcaaef9beb20d1f/413_5_333_333/140.jpg","Short-biog":"\"Had he lived to adulthood he would have liked to be a comedian\"","Long-biog":"Just eight when he died and about to finish year three at Oxford Gardens primary school, within sight of his home in Grenfell Tower, the headteacher, Sarah Cooper, remembers Mehdi El Wahabi coming in dressed up as a caveman. “He had a wonderful sense of humour but was also very, very gentle. He would involve and reassure everybody,” she says.\r\n\r\n\r\nMehdi was the doted-on youngest child of his parents, Abdulaziz and Faouzia El Wahabi, and in the words of his aunt Hanan Wahabi, “definitely the baby of the family”. \r\n\r\n\r\nShe added: “Because he was the youngest he was cared for a lot, bless him. He wasn’t spoiled in the sense that he would get anything he wanted but they all mothered him.” In photographs he invariably wears a broad smile.\r\n\r\n\r\nThe landing outside his family’s 21st-floor flat was used as a play area by Mehdi, his nine-year-old cousin Sara Chebiouni, who lived several floors down, and the daughter of a neighbour. Inside the flat Mehdi enjoyed playing Minecraft and with Lego. He had small toys including Minions, Furbies and fidget spinners “arranged all over his desk so there was no more space, he was like a collector”, remembers Sara.\r\n\r\n\r\nHe liked ice-cream and curry, and kept a squishy red, white and blue rocket toy on his bed. Had he lived to adulthood, Sara says, he would have liked to be a comedian – though she says he had some work to do on his jokes.","Credit":"Susanna Rustin"},{"Name":"Nur Huda El Wahabi","Floor":"21","Age":"15","Nationality":"British","Pic-url":"https://media.guim.co.uk/72be02f5d52ed718df07a54db1537f03cb2c4cb6/264_41_244_244/140.jpg","Short-biog":"\"I can imagine her wanting a family of her own – she was very good with children\"","Long-biog":"In the middle of doing her GCSEs when she died, Nur Huda El Wahabi would have turned 16 two weeks later. At Holland Park school she had worked her way up to a higher stream and was full of ideas and initiative when it came to planning her future. \r\n\r\n\r\nHaving looked into teaching, her ambition was to be an occupational therapist, though she had yet to decide where to go for sixth form.\r\n\r\n\r\nLindsay Johnson, her nursery teacher, remembers a toothy smile, strong body and confident character. Her primary headteacher, David Sellens, says her “lovely, deep voice” made her a popular choice for poetry readings and he recalls her reciting Dover Beach by Matthew Arnold. Like the rest of her family, she had a sunny disposition. She was proud of what Sellens calls “exquisite handwriting”, and liked caring for plants.\r\n\r\n\r\nShe had a habit of rolling up her shirt sleeves and generally wore trousers, teachers say, and could be cheeky but was also charming so was not often in trouble. Outside school she had many friends, used the gym and played an active role in the lives of her younger brother, Mehdi, and her nine-year-old cousin Sara Chebiouni, taking them to the park and the swimming pool.\r\n\r\n\r\n“She would have made a success of whatever she did,” says Johnson. “There was a robustness to her, and I think her family would have continued to be an important part of her life. I can also imagine her wanting a family of her own – she used to help in the nursery and was very good with younger children. You wouldn’t want to mess with Nur Huda but she was also this lovely, gentle, nurturing child.”\r\n\r\n\r\nNur Huda will be immortalised by having a character named after her in Philip Pullman’s next novel, thanks to a successful bid by one of her teachers in a fundraising auction.","Credit":"Susanna Rustin"},{"Name":"Marjorie Vital","Floor":"16","Age":"68","Nationality":"Dominican","Pic-url":"https://media.guim.co.uk/2d45f4c48fb4093c36539d0b52060cc109fa6d6b/583_130_873_873/140.jpg","Short-biog":"“A joyful, kind, sensitive woman who dedicated her life to her children”","Long-biog":"Marjorie Vital was born in Soufrière in Dominica in 1948. She was the fourth of nine children and spent much of her childhood helping raise her siblings after her parents moved to London in the mid-1950s for work.","Credit":"Staff"},{"Name":"Ernie Vital","Floor":"16","Age":"50","Nationality":"British","Pic-url":"https://media.guim.co.uk/29ee045107dc0cedff2dee771bae22922efbeb57/0_214_1523_1522/140.jpg","Short-biog":"“A kind, sensitive man” who was staying with his mother","Long-biog":"Ernie Vital was born in 1967, a few months after his mother, Marjorie, arrived in the UK to stay with her parents, who had moved to London a decade earlier.","Credit":"Guardian staff"},{"Name":"Khadija Saye","Floor":"20","Age":"24","Nationality":"British","Pic-url":"https://media.guim.co.uk/b45612473cfc0fb5cc2ed87f16bbb63872caa1eb/675_390_639_639/140.jpg","Short-biog":"\"Her story needs to be told so that other Khadijas in the world can hear it\"","Long-biog":"For Khadija Saye, Grenfell Tower was not just a home, it was the studio where she developed her passion for art to the cusp of widespread recognition. Her work was exhibited last year at the Venice Biennale.\r\n\r\n\r\n“Khadija’s story is inspirational, it needs to be told so that other Khadijas in the world hear it,” says Nicola Green, an artist who had been a mentor to the 24-year-old for three years.\r\n\r\n\r\nBorn in London, Saye lived with her Gambian mother in a flat on the 20th floor of the tower. She had gone to a local school, but at 16 won a full scholarship to the prestigious Rugby school. \r\n\r\n\r\n“She was incredibly grateful for the experience, but she told me it was one of the most difficult things she had done,” says Green. “It was a completely different world to the one she was part of – she was living at the top of Grenfell Tower and the school was full of privileged people ... it gave her an understanding that confidence is a mysterious thing – I think maybe it gave her the tenacity and determination to find it in herself.”\r\n\r\n\r\nAfter school, Saye went to the University for the Creative Arts, where she was part of a tight-knit group of four women who lived and created together. One of the group, Lou Johnson, describes her as “one of the most remarkable people I have ever, and probably will ever, meet”.\r\n\r\n\r\nHer best friend, the photographer Charlotte Levy, recalls: “She was just the most incredible person; she went through so much stuff, but she always listened and was always there for you. She was making such powerful work, but still saying she didn’t have a clue. She was such a beautiful person. She lit up a room.”\r\n\r\n\r\nHer father, Muhammedu Saye, said in a statement to the opening of the Grenfell Tower inquiry that his daughter had opened up to him about her love of visual arts. Her burning passion was photography, encouraged by her mother. “Khadija said to me one day: ‘Daddy, I’m in love, with images.’ It was these images that Khadija pursued to the end because it gave her great satisfaction.”\r\n\r\n\r\nFriends described her close relationship with her mother, Mary Mendy, who also died. “Khadija had the most beautiful, soulful spirit, she was so deeply connected to her mother,” says Green.\r\n\r\n\r\nSaye had also faced financial barriers. “She was using her own money to fund her work,” says Green. “She didn’t know anyone in the art world, she didn’t come from that world, but she was so clear about her own work and her desire to create.”\r\n\r\n\r\nHer work Dwelling: in this space we breathe was exhibited at the Venice Biennale. The series of photographs explores traditional Gambian spiritual practices, and it was this work that led Andrew Nairne, the director of Kettle’s Yard gallery, to meet Saye just before her death.\r\n\r\n\r\n“That she had created such a remarkable, powerful, original series of works was quite extraordinary,” says Nairne. “It’s an absolute tragedy – this was such a confident first body of work, but there was so much more to come. She had a remarkable future ahead of her.”","Credit":"Alexandra Topping"},{"Name":"Ligaya Moore","Floor":"21","Age":"78","Nationality":"Filipino","Pic-url":"https://media.guim.co.uk/3df9085bb1a3006e748c669aacb7f286d9659a0f/172_25_1279_1278/140.jpg","Short-biog":"\"Even when she was older, she loved to wear makeup and high heels\"","Long-biog":"From an early age, Ligaya Moore wanted to work abroad. As a young woman in her native Manila she would genuflect in church in front of the Black Nazarene, a statue depicting a dark-skinned Jesus Christ, pleading for an opportunity.\r\n\r\n\r\n“It was always her dream,” her younger sister Estelita Griego recalls. “She prayed for it fervently.” She was desperate to escape – from the graveyard shift at a fishing port, and from a boyfriend who wanted to marry and settle down.\r\n\r\n\r\nMoore was 33 when her prayers were answered. A niece working as chambermaid in London invited her to come work for a family, taking care of their three children. She arrived in London in June 1972 and fell in love with the city. She wrote back to her family to say how it made her feel so “posh”.\r\n \r\n“She loved the children and took care of them like her own,” says her older sister, Zenaida Purificacion. “We were always happy, too, when she sent money to our mother. It meant a lot.”\r\n \r\nThe children were grownups when Moore left for another job at a teahouse. This was where she met her husband, James Moore, a retired British soldier. “She said James was always at the teahouse and kept ordering from her and from her alone,” says Purificacion. \r\n\r\n\r\nThey were both in their 50s. “He was tall and very handsome. There was a photo of him carrying her on their wedding day. It was the happiest day of her life,” says Griego.\r\n \r\nAfter her husband died of cancer, Moore lived alone at their flat on the 21st floor of Grenfell Tower. With its view of the city, it was a building she loved and boasted about to friends and family back in the Philippines.\r\n \r\nIn 2012, aged 73, Moore returned to Manila for the first time for a family reunion. “She was so pretty. Even in her age, she loved to put on makeup and wear high heels,” says Purificacion. This was how she lived her remaining years: spending time with loved ones. She doted on her neighbours’ children and on her great-nieces and -nephews back home. She loved to dance - she was an Elvis fan - and she loved to cook. \r\n\r\n\r\nShe was one of the last victims of the fire to be identified, her remains found alongside the steel ribs of her collection of umbrellas. “The coroner said you’d be dead if you breathe the smoke from the fire for 15 minutes,” says her niece, May. “She must have died in her sleep.”\r\n\r\n\r\nHer remains were returned to Manila, to be buried alongside those of her parents.","Credit":"Carmela Fonbuena"},{"Name":"Sheila","Floor":"16","Age":"84","Nationality":"British","Pic-url":"https://media.guim.co.uk/d44981caf88a8fbcf64b64abb611424d04b20bd9/18_228_986_985/140.jpg","Short-biog":"\"We used to talk about politics, world affairs, Shakespeare, poetry, philosophy\"","Long-biog":"Sheila was “a beautiful woman, and she had a beautiful soul. She was love, pure and simple,” according to the poet Gary Allen, known as the Cockney Bard, who was friends with her for two decades.\r\n\r\n\r\nSheila, who dropped her surname, lived on the 16th floor of Grenfell Tower for 34 years.\r\n\r\n\r\n“We used to meet in a cafe in Holland Park and talk about politics, world affairs, Shakespeare, poetry, philosophy,” says Allen. “She was a prolific writer and did a lot of yoga. She loved prime minister’s questions, but it made her annoyed.\r\n\r\n\r\n“She had a sixth sense, she saw things in dreams. She was absolutely not religious, but she was very spiritually minded and learned. She was such a giver. Everyone took from Sheila, but few gave to her.”\r\n\r\n\r\nSheila developed severe arthritis in her 40s, says Allen. “She was almost disabled then. But she took up yoga and swimming, and became interested in meditation.”\r\n\r\n\r\nAt 84, Sheila is thought to be the oldest person who died in the Grenfell Tower fire.\r\n\r\n\r\nA statement released by her family said: “A very active and well-respected member of the local community, Sheila was cycling around London, performing yoga daily and swimming regularly in the Kensington leisure centre until she was 80 years old.”\r\n\r\n\r\nSheila is survived by two sons, six grandchildren and three great-grandchildren.","Credit":"Harriet Sherwood"},{"Name":"Joseph Daniels","Floor":"16","Age":"69","Nationality":"Indian","Pic-url":"https://media.guim.co.uk/d35747f77b8a5effdfcad3b7e1c0effcc5a27560/0_0_552_552/140.jpg","Short-biog":"He had a passion for weightlifting and was well known in local gyms","Long-biog":"Joseph “Joe” Daniels was from Lucknow in northern India, one of two children of SJ Mukand, a former brigadier in the Indian army, and Laleta Vidyavati Mukand. He met Lucy Smyth, a teacher, while visiting his father, who had become headteacher of Bishop Cotton school in Shimla. They got married at the school and moved to London, where their son, Sam, was born in 1982.\r\n\r\n\r\nThe family initially lived in Smyth’s father’s basement apartment, but moved to Grenfell Tower when a council flat became available on the 13th floor – recently renumbered as floor 16 – in 1983.\r\n\r\n\r\nDaniels, who had served in the Indian air force, later worked in security at the Taj Mahal Palace Hotel in Mumbai. He had a number of jobs in security in London, initially for airlines, and was a passionate bodybuilder well known in west London gyms. Daniels had a strong Christian faith and a fine tenor voice, and was an Elvis Presley enthusiast.\r\n\r\n\r\nWhen Sam was about 17, his parents separated. Smyth, who qualified as a barrister and works as a solicitor advocate, moved a few streets away and Sam continued to live with his father. \r\n\r\n\r\nAbout six years ago, Daniels began to show signs of dementia and his son became his full-time carer. When smoke started seeping into their flat on 14 June last year, Sam desperately tried to persuade his father to leave, but Daniels, who was confused, would not move. Sam, beginning to feel the effects of smoke, went to find help.\r\n\r\n\r\nOn the stairs, Sam met firefighters and told them his father was disabled and he had been unable to get him to leave the flat. They could not find Daniels, and Sam believes this is because, in the redecoration of the building a couple of years before the fire, the floors were renumbered, but the council did not paint the new numbers in the internal staircase.\r\n\r\n\r\nDaniels was eventually identified by his DNA.","Credit":"Aida Edemariam"},{"Name":"Isaac Paulos","Floor":"18","Age":"Five","Nationality":"British","Pic-url":"https://media.guim.co.uk/6a008f1b74d8dca6541c2678869fa52d1ec8b0df/121_0_481_481/140.jpg","Short-biog":"\"Isaac can still play in heaven with the other children.\"","Long-biog":"Isaac’s family came from Ethiopia. The five-year old schoolboy lived on the 18th floor with his mother, father and younger brother.\r\n\r\n\r\nThe family has requested privacy since the fire, but said in a statement: “Isaac, our beloved son, was taken from us when he was only five years old.  We will all miss our kind, energetic, generous little boy. He was such a good boy who was loved by his friends and family.\r\n\r\n\r\n“We will miss him forever, but we know God is looking after him now and that he is safe in heaven.”\r\n\r\n\r\nAn obituary read out at his funeral by a family friend described him as a \"smart and generous little boy\" who loved swimming, football and playing games with his friends.\r\n\r\n\r\nA letter sent by a five-year-old playmate said: \"Isaac can still play in heaven with the other children. He is also with the angels.\"","Credit":"Guardian staff"},{"Name":"Abdulaziz El Wahabi","Floor":"21","Age":"52","Nationality":"Moroccan","Pic-url":"https://media.guim.co.uk/e735e38e78fd402173d834717e83fa789e10b712/0_0_500_500/140.jpg","Short-biog":"\"A man who made the most of everything\"","Long-biog":"Abdulaziz El Wahabi was such a popular colleague at University College hospital, where he had worked as a porter for more than two decades, that a memorial bench was dedicated to him this year.\r\n\r\n\r\nEl Wahabi was 52 when he died along with his wife, Faouzia, and three children, Yasin, 20, Nur Huda, 16, and Mehdi, eight, in the Grenfell Tower fire. Originally from Morocco, where he would return on holiday every August with his family, he worked as a porter at the hospital for 22 years and travelled to work on the tube each day from Latimer Road. \r\n\r\n\r\nHaving worked in two garages after leaving school, he found that hospital work suited him. Marcel Levi, the chief executive of University College London hospitals NHS trust, describes “Aziz” as a popular colleague known for being kind to patients. \r\n\r\n\r\nEl Wahabi spent his early childhood in the coastal town of Larache in northern Morocco before being brought to London with his siblings by his mother after his father settled in the Portobello Road area. The family had planned to return to Morocco but instead put down roots in the community in North Kensington, where El Wahabi attended Isaac Newton secondary school in Lancaster Road.\r\n\r\n\r\nHe had a strong interest in Moroccan culture, and sought his mother’s advice when he wanted to get married, and professional Bedouin musicians played at his wedding to Faouzia in Larache. His sister Hanan Wahabi – who lived several floors below him in Grenfell Tower and escaped the blaze – recalls his tales of colleagues eyeing up the couscous and tagine leftovers he would take with him to work for lunch. \r\n\r\n\r\nThe family, who visited Morocco the summer before they were killed, attended al-Manaar mosque and heritage centre where their children also took Arabic lessons. Hanan describes her brother as a man who “made the most of everything”.\r\n\r\n\r\nRemembered by his children’s teachers as a committed parent, he enjoyed taking the family on day trips to Brighton, and was hugely proud when his son Yasin went to Greenwich University.","Credit":"Susanna Rustin"},{"Name":"Faouzia El Wahabi","Floor":"21","Age":"42","Nationality":"Moroccan","Pic-url":"https://media.guim.co.uk/64c2b88bbc732d4f0ddb66b80dcaaef9beb20d1f/5_76_365_365/140.jpg","Short-biog":"\"You would always see her laughing and joking with her children\"","Long-biog":"A lively, friendly woman who sometimes appeared more like a sibling than a parent to her two older children is how relatives remember Faouzia El Wahabi. \r\n\r\n\r\nAn enthusiastic baker who was always trying out new cake recipes and cooking Moroccan food in her Grenfell Tower flat for relatives and friends, Faouzia, 42, was also a keen knitter. When she died, she was getting ready to teach a knitting and crochet class at the Westway Trust community centre, where she sold her handmade scarves and baby clothes, with the profits going back to the trust. \r\n\r\n\r\nUntil she married and moved to London aged 20 in 1995, Faouzia had lived in Larache, a coastal town in northern Morocco, with her parents and grandmother. She had known her future husband, Abdulaziz El Wahabi, and his family all her life. When the pair were reintroduced by older relatives after Abdulaziz told them of his wish to settle down, they fell in love.\r\n\r\n\r\nIn London, they moved in with her mother-in-law until they were offered a two-bedroom flat in Grenfell Tower when her first child, Yasin, was one. Yasin, his aunt remembers, was a difficult baby who childminders struggled with, and Faouzia’s early attempts at working outside the home in a school kitchen were given up in favour of full-time parenting.  \r\n\r\n\r\nYasin was followed by a daughter, Nur Huda, with whom Faouzia enjoyed following Moroccan dramas and soap operas on TV. Then there was a seven-year gap before Mehdi, the baby of the family, arrived.\r\n\r\n\r\n“You would always see her laughing and joking with her children, whenever you saw her out they would be with her,” says her sister-in-law and former neighbour, Hanan Wahabi. “That’s how she was with them, and every single one of them was a parent to Mehdi – it was a unique situation they had.” \r\n\r\n\r\n“There was a real sweetness to her, but beneath that there was a real desire to ensure her children got on,” says David Sellens, the headteacher at Thomas Jones school where two of the El Wahabis’ children were pupils.","Credit":"Susanna Rustin"},{"Name":"Abufras Ibrahim","Floor":"23","Age":"39","Nationality":"Sudanese","Pic-url":"https://media.guim.co.uk/fd7cb8df5ec1b7fb81413cb3b3c929b13c57fdcf/423_0_1049_1049/140.jpg","Short-biog":"\"He was very supportive to his mum, always caring about her\"","Long-biog":"Abufras Ibrahim was barely a teenager when he was suddenly uprooted from his home in Khartoum in Sudan, moving to London with his mother and sister in the early 1990s.\r\n\r\n\r\nThe family rarely spoke about why they left home, but Ibrahim’s mother, Fathia Alsanousi, was granted asylum, so people presumed it was a political problem. \r\n\r\n\r\nAbufras grew up as much British as Sudanese, a diligent child with more of a head for business than for academia. He was one of the few Grenfell victims who did not live in the tower.\r\n\r\n\r\n“He was a lovely boy,” says Wafa Hussein Osman, a family friend. “He was a very hard worker, but very supportive to his mum, always caring about her.” He was visiting his mother and his sister, Esra, in their 23rd-floor flat in Grenfell Tower on the night of the fire to break the Ramadan fast.\r\n\r\n\r\nIbrahim, 39, who lived in west London, was believed to have been running a shop with one of his two elder brothers.","Credit":"Mark Rice-Oxley"},{"Name":"Esra Ibrahim","Floor":"23","Age":"35","Nationality":"Sudanese","Pic-url":"https://media.guim.co.uk/6e7134ed710ff10679798fb426695e055135d982/448_0_1016_1016/140.jpg","Short-biog":"\"She was a very sweet kid, she was really kind\"","Long-biog":"Esra Ibrahim was the youngest of five children born in Sudan to Fathia Alsanousi and her army officer husband, a family that hailed originally from the deserts of western Sudan and ended up in the high rises of western London.\r\n\r\n\r\nShe moved to London with her mother while still a young girl. The family rarely spoke about why they left Sudan. But Alsanousi was granted asylum, so people presumed it was a political problem. \r\n\r\n\r\nBecause she was just nine at the time, Ibrahim grew up feeling more British than Sudanese, friends say, and was a sweet girl who looked after her mother and was still living with her in Grenfell Tower when the atrocity happened last June.\r\n\r\n\r\n“She was like a little British girl,” says the family friend Wafa Hussein Osman, whose daughter was close to Ibrahim. “They don’t have any Sudanese accent. They dress British, but when we go to weddings or other events, Esra always tried to wear the traditional clothes. Her mother designed them. She was interested in the culture.”\r\n\r\n\r\nIbrahim, 35, worked in public relations and occasionally revisited the land of her birth. \r\n\r\n\r\n“She was a very sweet kid, she was really kind,” says Wafa Osman.","Credit":"Mark Rice-Oxley"},{"Name":"Zainab Deen","Floor":"14","Age":"32","Nationality":"Sierra Leonean","Pic-url":"https://media.guim.co.uk/bf341a66e7aef33457a08a6b147218d473e03ff9/28_0_897_897/140.jpg","Short-biog":"\"When she became pregnant, Zainab asked me if I’d be her mother\"","Long-biog":"Zainab Deen was born in Sierra Leone in May 1985 and spent her childhood in the capital, Freetown, passing her school exams despite the war ravaging the country at the time.","Credit":"Amelia Hill"},{"Name":"Jeremiah Deen","Floor":"14","Age":"Two","Nationality":"British","Pic-url":"https://media.guim.co.uk/8ac2280728e786c31c088292e2220ca52d4cb2aa/245_2_299_299/140.jpg","Short-biog":"\"He wouldn’t leave her for one minute and she wouldn’t leave him\"","Long-biog":"Jeremiah Deen was just two when he perished in the Grenfell Tower fire. He was a happy child who loved music, according to Lucinder Palmer, a family friend. Palmer remembers him dancing in church, running up and down the aisles. \r\n\r\n\r\nHe was adored by his mother, Zainab Deen, a Sierra Leonean national brought to the UK by her father when she was a child. \r\n\r\n\r\nPalmer, who was present at Jeremiah’s birth, says he and his mother were inseparable. “He wouldn’t leave her for one minute and she wouldn’t leave him,” she says. “He gave her the stability she’d been searching for. They were very close.”","Credit":"Amelia Hill"},{"Name":"Berkti Haftom","Floor":"18","Age":"29","Nationality":"Eritrean","Pic-url":"https://media.guim.co.uk/609a87d61b19d1ea62cd7c1d1a0437c842037668/1239_6_1094_1094/140.jpg","Short-biog":"\"She was the life and soul, she used to crack us up\"","Long-biog":"Berkti Haftom is remembered by those who knew her for her vivid, upbeat approach to life and dedicated parenting of her 12-year-old son, Biruk. Born and brought up in Eritrea, she lived in Italy before settling in London, but over the past decade had put down deep roots in North Kensington.\r\nStill a teenager when she became a mother, as a single parent she took a strong interest in her son’s education and was well regarded by his teachers. Paul Enright, who taught Biruk in primary school, says she closely tracked his academic progress and arranged after-school tutoring. Colleagues at the cafe in Holland Park where she worked part-time, serving food, drinks and ice-creams, remember her talking about her son all the time.\r\nAdegboyega Phillips, her manager there until she left for another job in 2016, says his concerns about gaps in her English when he interviewed her evaporated when she worked a trial shift. “She made it work for herself basically,” he says, her warmth and liveliness more than making up for any lapses in grammar. “She was the life and soul, she used to crack us up a lot.”  \r\nAs well as a sister in London, she had a group of close female friends. She belonged to an Eritrean Orthodox Christian church. She had a vulnerable side, and Phillips says she used to cry easily when colleagues were especially kind to her.\r\nParticular about her appearance, she worked out at the gym, and was fond of wearing bright colours, high heels and painted nails. In photographs with Biruk, their closeness is clear. They were lovely people, says Enright, combining good humour with a palpable sense of purpose.","Credit":"Susanna Rustin"},{"Name":"Biruk Haftom","Floor":"18","Age":"12","Nationality":"British","Pic-url":"https://media.guim.co.uk/609a87d61b19d1ea62cd7c1d1a0437c842037668/387_326_972_972/140.jpg","Short-biog":"\"He was so savvy, you could almost have an adult conversation with him\"","Long-biog":"“We get two types of student,” says Hamid el-Ouahabi, a learning mentor and sports coach at Oxford Gardens primary school in North Kensington, where Biruk Haftom was a pupil from age three to 11. “When they’ve left the school and they see us in the area they are either really shy, or they’re exactly as they used to be.” \r\nBiruk was the second type, he says, and would shout out his old teacher’s name from across the road, before crossing over to swap news and high fives.\r\nBiruk was an easygoing and well-liked student, says Sophie O’Neill, one of his former teachers, and showed determination in his schoolwork, especially in maths. But football was his passion and he would write the name of the Brazilian star Neymar on all his test papers.\r\nHis mother, Berkti Haftom, was Eritrean, and the pair lived together in a flat on the 18th floor of Grenfell Tower. \r\nMother and son had a close, warm relationship, with Biruk described by those who knew him as a mature boy used to making his way around the neighbourhood on his own when his mother was at work, and as having embraced the move to secondary school. He had almost finished his first year when he was killed aged 12 along with his mother.\r\nHe is remembered for his distinctive chuckle and beaming smile. “He was extremely savvy, you could almost have an adult conversation with him,” says El-Ouahabi, whose son was friends with Biruk. “He could work out your moods from your expressions”. \r\nOxford Gardens staff remember him suited, booted and laughing at the year 6 leavers’ prom. Seeing him out and about in North Kensington, El-Ouahabi says he had often told Biruk that “no matter what, I’d be on his case for the rest of his life”.\r\nIn a statement, Biruk’s family said: “Biruk was a loving, pure-hearted boy, wise beyond his years and known for his politeness, kind heart and his love for his family and friends.\r\n\r\n“Berkti and Biruk left an everlasting legacy full of lovely memories and their contagious laughter and charisma will live in our hearts for ever. We are deeply hurt and heartbroken our angels were taken from us so cruelly, so young. We will not rest until justice is served.”","Credit":"Susanna Rustin"},{"Name":"Logan Gomes","Floor":"21","Age":"0","Nationality":"British","Pic-url":"https://media.guim.co.uk/ec2574e5244d7af6e83a8a785283e9a3a0ac6649/0_0_1280_1280/140.jpg","Short-biog":"“He will always be here in our hearts”","Long-biog":"Logan Gomes was stillborn in hospital the day after the Grenfell Tower fire. His mother, Andreia, who was seven months’ pregnant, lived on the 21st floor with her husband, Marcio, and their two daughters. They had been in the apartment for 10 years.\r\nThe Gomeses managed to get themselves and their children down the fire escape and out of the building, but Andreia was hospitalised and put into an induced coma. They were subsequently told that doctors believed Logan's heart gave out because of a lack of oxygen during the escape.\r\nIn the opening testimony at the Grenfell Tower inquiry, Marcio Gomes delivered a moving, compelling account of how the family had been eagerly awaiting Logan’s arrival, and how bereft they have been.\r\n“He was going to be my little star,” Marcio said. He said his two daughters had told him: “You can go out – don't worry about the baby. We'll look after the baby.\"\r\nHe added: “He might not be here physically, but he will always be here in our hearts.”","Credit":"Guardian staff"},{"Name":"Jessica Urbano Ramirez","Floor":"20","Age":"12","Nationality":"British","Pic-url":"https://media.guim.co.uk/5388bf6cef392096ad70a5b2e40709f8a749cd90/231_0_1136_1136/140.jpg","Short-biog":"\"She brought joy to everyone who met her\"","Long-biog":"Jessica Ramirez was three weeks short of her 13th birthday when she died in Grenfell Tower. She lived with her mother, who is from Colombia, and sister on the 20th floor of the building.\r\n\r\n\r\nShe was described by her mother as a “kind, happy, clever girl and so strong”. Her sister Melanie said she was bubbly, curious and loved clothes and fashion.\r\n\r\n\r\n“Jessica was such a bubbly girl, she was cheeky always telling jokes and making others laugh as well as caring thoroughly for them,” Melanie wrote in an email to the Guardian. “She was always open to a challenge, always wanting to try new things, new styles as one of her favourite things was fashion - in the family she was our little diva.”\r\n\r\n\r\nMelanie said her sister was becoming more independent, and enjoyed the full life of a busy teenager, keen to learn new things like swimming and cooking. “She  had even started going to the gym.\r\n\r\n\r\n“It is going to be hard to adjust to the idea that we have to continue the rest of our lives without her, as she was a bundle of joy.”\r\n\r\n\r\n\"She was a gift to myself, my mum and dad as she lit up our lives in the short time she stayed with us.\"\r\n\r\n\r\nIn a statement last year, the family said: “Our little girl was loving, kind-hearted and caring. She brought joy to everyone who met her and her laugh was contagious. Jessica will leave a lasting legacy in the hearts of her family and friends and the many, many people who didn't know her personally but have come to know her since that night of 14 June.\r\n\r\n\r\n“Her light will shine bright and will light our individual paths as we start to move forward into coming to terms with our loss and heartbreak.”","Credit":"Guardian staff"},{"Name":"Raymond Bernard","Floor":"23","Age":"63","Nationality":"","Pic-url":"https://media.guim.co.uk/702be0858c3f04f6d38dcbe479f292ae701374c2/237_21_364_364/140.jpg","Short-biog":"\"May you rest in eternal peace, with love always\"","Long-biog":"Friends describe the 63-year old, who lived on the top floor of Grenfell Tower with his king charles spaniel, Marley, as caring and loving.\r\n\r\n\r\nHis family declined a request to speak more about his life for this project.\r\n\r\n\r\n\"Gone but not forgotten, you are so dearly loved by us all and will sadly be missed by many. May you rest in eternal peace, with love always,” they said in a statement at the time his death was confirmed.","Credit":"Guardian staff"},{"Name":"Denis Murphy","Floor":"14","Age":"56","Nationality":"Irish","Pic-url":"https://media.guim.co.uk/ee05ef372ce28bbfe012cb47211ec7687ae2fa32/62_276_1470_1470/140.jpg","Short-biog":"\"He had three biggest loves: family, friends and Chelsea\"","Long-biog":"Denis Murphy was a longtime Grenfell Tower resident who grew up in London after his mother, Anne, moved to Britain from Limerick in Ireland.\r\nBorn in Hammersmith and the oldest of four siblings, he went to school in Surrey and Kent and quickly discovered a passion for sports – particularly football and cross country running – that would last a lifetime. \r\nHis sister, Anne Marie Murphy, told a story from his childhood at the Grenfell Tower inquiry that she said summed up her older brother: another sibling had lost his bus money, so a 10-year-old Denis handed over his own and proceeded to run the five miles home instead. \r\n“Denis was big brother but also like a dad to us,” Anne Marie Murphy said. “He had a strong set of principles and values which he adhered to and instilled in us.”\r\nMurphy was a painter and decorator by trade, but also a talented footballer who had trials with Charlton Athletic and Crystal Palace. He met his wife, Tracy, when he was 22 and they moved into Grenfell Tower two years later. They subsequently moved to south London, but Denis would move back to the tower in 1997 to be closer to his mother after he and his wife divorced. He and Tracy remained good friends until his death.\r\n“He had three biggest loves in his life: family, friends and Chelsea Football Club, and not always in that order,” Anne Marie Murphy said.\r\nMurphy was remembered in a 56th-minute ovation at Chelsea’s Stamford Bridge stadium last September, days before his funeral.","Credit":"Guardian staff"},{"Name":"Hesham Rahman","Floor":"23","Age":"57","Nationality":"Egyptian","Pic-url":"https://media.guim.co.uk/b58819404682e72176c323c7e7fc2972e3f00f3e/183_0_352_352/140.jpg","Short-biog":"\"He was so proud of that flat\"","Long-biog":"Hesham Rahman had lived in Grenfell Tower for almost five years. “He was so proud of that flat,” says his nephew Karim Mussilhy. “I remember when he first got it – all the furniture he bought, and how much effort he put into decorating.” \r\n\r\n\r\nRahman’s extended family has longstanding links to the area around the tower and he was thrilled to get an apartment on the top floor. \r\n\r\n\r\nBorn in Cairo, Rahman emigrated to the UK aged 18 with his aunt and her husband, who cared for him after he became estranged from his father’s family. “My nan saw him as her son, and he has been for the past 40 years,” says Mussilhy, who says Rahman was a father figure for him: “He gave me advice about my first job, and about girls.” \r\n\r\n\r\nRahman, 57, had diabetes, which caused him to have trouble walking, making it harder for him to leave his flat and carry on his mobile hairdressing business.\r\n\r\n\r\nHe is remembered by his family and the community as a tirelessly generous man, always stuffing the pockets of children in the family with sweets and pocket money. “At the mosque we went to in Shepherd’s Bush, he would arrive with his walking stick and grab chairs for the elderly and disabled,” says Mussilhy. “He’d grab so many that eventually he’d have to stand outside himself. He was that type of guy.” \r\n\r\n\r\nMussilhy laughs remembering his uncle as “the banter of the family”. He recalls how Rahman could see the Westway sports ground where Mussihly played football each Sunday from his flat. “I remember one time getting a text after my game,” he says. “I was expecting him to say well done. He said: ‘Were you the one wearing the green top? Yeah, you were rubbish!’” \r\n\r\n\r\nRahman was a joker, but, Mussilhy says, he did not talk usually about his feelings. However, on social media he found a new form of self-expression, often writing poems in Arabic. \r\n\r\n\r\nHe posted in February 2016: “My will, for who will remember me one day … to remember my presence before my departure. I hope to see a smile on everyone’s face when I’m gone, a prayer from the heart. I refuse to accept tears, crying or flowers on my grave, or even sadness.”","Credit":"Ruth Michaelson and Adham Youssef"},{"Name":"Fathia Ali Ahmed Alsanousi","Floor":"23","Age":"77","Nationality":"Sudanese","Pic-url":"https://media.guim.co.uk/79431b398d7d5aad1a9ce386fa782ca306778343/0_53_716_716/140.jpg","Short-biog":"\"Her flat was beautiful, always full of people\"","Long-biog":"It’s a long way from the deserts of western Sudan to the high rises of western London. Fathia Alsanousi was equally at home in both, a teacher and mother from the Sudanese hinterland who managed to make a second life for herself in exile once the first had become untenable.\r\n\r\n\r\nAlsanousi was something of a diaspora matriarch, and there were few London-based Sudanese who didn’t know of her. Working tirelessly to secure the future of her five children, she taught Arabic and art, upcycled handbags and shoes, designed Sudanese thubes – a garment like a sari – and threw open the doors of her 23rd-floor Grenfell Tower apartment on the slightest social pretext.\r\n\r\n\r\n“Her flat was beautiful, always full of people,” says Wafa Hussein Osman, who knew Alsanousi for almost 30 years. “Whenever we went there we found a new plant, a new vase, she loved antiques. She had this artistic side. She did loads of different things with her hands. She bought secondhand shoes and bags and redesigned them.”\r\n\r\n\r\nAlsanousi was born in Kordofan, south-west Sudan, in the early 1940s when it was still a British colony. Her upbringing was tough - her father had moved away to be with his second family, leaving her with a mother who didn’t work and a baby sister who needed caring for. \r\n\r\n\r\n“She was ten years older than me and she was like a mother to me,” said Hayat Alsanousi, her sister, at the Grenfell inquiry. “I feel that she had adopted me as her child.”\r\n\r\n\r\nShe taught in primary schools all over the country, latterly in Khartoum. She married an army officer and they had five children. After he died in 1984, life became a struggle for her, and she eventually claimed political asylum in Britain in the early 1990s.\r\n\r\n\r\nOsman moved to London at around the same time. “We found it very strange, cold and dark,” she says. Alsanousi quickly busied herself into her new life. She knew no English so started language lessons. She needed money and found work in a packaging factory. Still feeling she had much to give in the classroom, she also taught Sudanese children in Saturday school.\r\n\r\n\r\n“Fathia was a very resilient person, she was very practical,” Osman recalls. “She was a very happy woman, really happy. She was the pillar of the community in London, sort of like our godmother.”\r\n\r\n\r\nOnce she obtained a British passport, Alsanousi visited her homeland, principally to check up on her disabled sister Hayat. \r\n\r\n\r\nHer three older children studied in Europe, but the two younger ones, Abufras and Esra, were not yet teenagers when they arrived in the UK and went to British schools, growing up more British than Sudanese. Esra was still living with her mother as of June last year; Abufras was visiting on the night of the fire. Both perished with their mother.\r\n\r\n\r\n“She had this soul,” says Osman. “She had this huge laugh with everyone around her. It was infectious.”","Credit":"Mark Rice-Oxley"},{"Name":"Gloria Trevisan","Floor":"23","Age":"26","Nationality":"Italian","Pic-url":"https://media.guim.co.uk/5a7178cd63adb551186579ff572504ce0ef1167e/0_166_473_473/140.jpg","Short-biog":"“She tiptoed into our lives ... as we got to know her, she was a ray of light”","Long-biog":"A flair for drawing and a love of conservation meant Gloria Trevisan did not have to search for long to find work as an architect. But she was modest about her work, friends and relatives recall. \r\n\r\n\r\nA shy person, when she first met the parents of her boyfriend, Marco Gottardi, she hid behind their huge kitchen fridge, embarrassed because she had been brought back to the house overnight.\r\n\r\n\r\n“She tiptoed into our lives … but as we got to know her, she was a ray of light,” says Marco’s mother, Daniela. “She was very beautiful and caring. I knew exactly why my son wanted to be with her. They had a great love between them, she always had her arms wrapped around him.” \r\n\r\n\r\nThe 26-year-old from Camposampiero in northern Italy had moved to London with Gottardi in March 2017. The couple spent their first couple of weeks in the city doing an English-language course before setting out to find work. \r\n\r\n\r\nTrevisan was quickly snapped up by Peregrine Bryant Architecture. At the time of the Grenfell Tower fire, she had been with the studio in south-west London for less than two weeks, assigned to work on a refurbishment of the Grade I-listed Soane Stables buildings at the Royal Chelsea hospital.\r\n\r\n\r\nThe practice set up an annual scholarship in the couple’s honour. Called the Gloria e Marco Award, it will support a graduate from the university they attended, Università Iuav di Venezia, to come to the UK to learn more about conservation.","Credit":"Angela Giuffrida"},{"Name":"Marco Gottardi","Floor":"23","Age":"27","Nationality":"Italian","Pic-url":"https://media.guim.co.uk/5a7178cd63adb551186579ff572504ce0ef1167e/402_97_558_558/140.jpg","Short-biog":"\"That night he was serene; he tried to keep his parents and girlfriend calm\"","Long-biog":"As a schoolboy, Marco Gottardi was already such an altruist that he once deliberately underperformed in a set of exams so he did not outshine his friends. \r\n\r\n\r\n“He never wanted to be the centre of attention,” says his father, Gianni. People who knew Marco describe him invariably as a gentleman, selfless, and as a “man from a different era” who valued tradition. “He wished he’d lived during the 1970s,” says his mother, Daniela. “He used to say that those were better times.”\r\n\r\n\r\nGottardi grew up in San Stino di Livenza, a small town in northern Italy. He was passionate about roller-skating from an early age, winning several competitions before discovering football and becoming a loyal Juventus fan. He was an only child but was rarely alone, relishing the company of others. His parents often hosted parties, whether to celebrate his birthday, the end of the school year or his graduation.\r\n\r\n\r\nGottardi studied quantity surveying before settling on architecture. Along with his girlfriend of three years, Gloria Trevisan, the 27-year-old moved to London in March 2017 to move forward with his career and to learn English. The couple planned the move meticulously, and despite arriving without work, they were quickly hired. \r\n\r\n\r\nAfter a tiring search, they were also relieved to find an apartment they adored on the 23rd floor of Grenfell Tower, moving in less than two months before the fire. “They did everything all by themselves, and they succeeded,” says Gianni.\r\n\r\n\r\nAs the couple embarked on their new lives, they kept their families updated via a WhatsApp group, sending photos of themselves around the city, among new friends, eating fish and chips and drinking beer – a first for Gottardi. \r\n\r\n\r\nHe was seen as calm, collected and sensitive to the feelings of others, traits he maintained during a call home before he died. “He told us there was smoke but was certain the rescuers would arrive. He was serene; he tried to keep his parents and girlfriend calm,” says Gianni.\r\n\r\n\r\nThe couple had been due to travel home to celebrate Gottardi’s 28th birthday on 26 June. \r\n\r\n\r\nHis parents have established a foundation called Grenfellove Marco and Gloria, which they hope will help other young Italians get a good start in life. “They were two people who had the great strength to start a professional path abroad all by themselves,” says Gianni Gottardi. “By setting this up, we can help others and remember them always.”","Credit":"​​​​​​​​Angela Giuffrida"},{"Name":"Nadia Choucair","Floor":"22","Age":"33","Nationality":"Lebanese","Pic-url":"https://media.guim.co.uk/841e4b2844c35aa1ef6a1d742541d74bda8ffe4e/0_71_470_470/140.jpg","Short-biog":"“The kind of person people feel grateful to have known”","Long-biog":"A mother of three daughters and full-time nursery worker at Avondale Park primary school, Nadia Choucair, who was 33 when she died, was a cherished colleague and neighbour. \r\nAt Avondale, where she worked for a decade and sent her own children, she was a favourite with the pupils, and had recently bonded with a four-year-old Syrian girl who had arrived as a refugee following a traumatic boat journey. \r\nUsually dressed in jeans with a loose, flowing top, and remembered for her beautifully patterned headscarves, Nadia Choucair was a reliable, positive, gentle person who was encouraged by her older brother Nabil to train and qualify as a teacher.\r\nNadia Choucair’s family was originally from the Beqaa Valley, a fertile agricultural region in east Lebanon, though she was born in London. She and her family were buried in her hometown of Nahleh, where the deputy mayor was a relative. Katy Blackler, headteacher at Avondale, said Nadia Choucair was proud of her background and talked to the children very naturally about Islam, explaining clearly why she covered her head; she once brought her prayer mat into school and helped to set up a pretend mosque for the classroom.\r\nA regular dieter who ran an oversubscribed after-school cooking club, Nadia Choucair “had a lovely sense of fun and good humour that the children saw more than we did,” Blackler said. \r\n“After she died they talked a lot about the hiding games she played with them. She was very imaginative, and the kind of person that people feel grateful to have known.”","Credit":"Susanna Rustin"},{"Name":"Bassem Choukair","Floor":"22","Age":"40","Nationality":"Lebanese","Pic-url":"https://media.guim.co.uk/fb38b4791f96f20864ccff22698b3079345b14f4/43_162_377_377/140.jpg","Short-biog":"A proud, polite man who was full of love for his wife and three daughters","Long-biog":"Bassem Choukair was 40 when he died alongside his wife and three daughters. He was a dark-haired, open-faced and exceptionally polite man, who was proud of his job at M&S Simply Food in Earl’s Court, where he had worked for seven years, starting as a customer assistant and working his way up to section coordinator with some management responsibilities. \r\n\r\n\r\nStarting before 5am each day and working until 2pm, after which he would cycle off to collect his children from school, Choukair texted colleagues at 1.55am on the morning of the fire to warn them that he did not expect to make it to work, signing off “Sorry guys for letting you down”.\r\n\r\n\r\nM&S store manager Mizan Rahman, who became friends with Choukair in the months before he died, says he was an outgoing character who talked often about his wife and daughters and was well-liked and respected in the store. He helped new staff to settle down, and was well known to regular customers. Rahman said Choukair, who he called “Mr Earl’s Court”, was one of his best workers. “He took his job very seriously,” Rahman recalls. But he could also be funny, and was generous with the homemade food he brought in for his lunches – bread, dips, casseroles and salads such as tabbouleh.\r\n\r\n\r\nOriginally from Nahleh in the Bekaa Valley in Lebanon, where he had been in the military before moving to the UK, Choukair was actively involved in the life of his children’s school, where his wife worked, and a familiar figure in the playground, where he used to prop his bicycle against a wall. He sometimes acted as an Arabic translator for the school’s headteacher, Katy Blackler, who remembers him being asked one day whether he had come to collect his daughters and saying: “I’m waiting for my beautiful wife, I’m going to take her home.” Blackler says the couple were very much in love.\r\n\r\n\r\nChoukair’s body was returned to Lebanon for burial. A government delegation was at the airport when his body arrived, along with those of his family. A wall memorial at the M&S store where Choukair worked is due to replaced with a plaque.","Credit":"Susanna Rustin"},{"Name":"Fatima Choucair","Floor":"22","Age":"11","Nationality":"British","Pic-url":"https://media.guim.co.uk/dc2ddeae9a876ed39fed57d188a3402a0854247b/134_140_222_222/140.jpg","Short-biog":"A hardworking, popular girl who loved football and netball","Long-biog":"Taller and leaner than her big sister Mierna, and with a distinctive, mischievous expression and long hair, Fatima was in her final year at Avondale Park primary school, where her mother worked in the nursery. She was part of a tight group of four friends whose closeness was noticed and commented on by teachers.\r\n\r\n\r\nAthletic and competitive, Fatima enjoyed netball and football and typically played sports at break and lunchtime. Pupils and staff still remember the celebrations when she scored her first goal for the school football team.\r\n\r\n\r\nFatima was the middle of three sisters who lived in a two-bedroom flat on the 22nd floor of Grenfell Tower with their mother and father, who were immigrants from the Bekaa valley in east Lebanon.\r\n\r\n\r\nShe was less academic than her high-achieving elder sister, but a hard worker who took pride in her writing. The fact that her Sats results, showing she reached the expected level, came through after she died had added poignancy for her school. Described by teacher Patrick Hayes as extremely polite and a pleasure to know, Fatima was seen as unassuming and was encouraged to be more confident and assertive in putting across her point of view, both in and out of school. \r\n\r\n\r\nHeadteacher Katy Blackler said she remembered Fatima clustered with her gaggle of friends and looking a bit mischievous. “When you saw them, you might have thought: what are they up to?”","Credit":"Susanna Rustin"},{"Name":"Mierna Choucair","Floor":"22","Age":"13","Nationality":"British","Pic-url":"https://media.guim.co.uk/dc2ddeae9a876ed39fed57d188a3402a0854247b/277_4_260_260/140.jpg","Short-biog":"\"An exceptional role model who always gave 100%\"","Long-biog":"Mierna Choucair was nearing the end of her second year of secondary school when she died aged 13. She is remembered as a talented writer and driven student who teachers expected to thrive at university and beyond.\r\nMierna was deputy head girl at her primary school, Avondale Park – a position also held by neighbour Firdaws Hashim, who also died in the fire. Mierna was described by her year 6 teacher Emma Kibble as an “exceptional role model who always gave 100%”. \r\nThe costumes she designed and made for World Book Day – Maleficent, Dorothy from the Wizard of Oz, and the Kenyan village girl from Eileen Browne’s book Handa’s Surprise – were remembered fondly. She had thrown herself into the life of her secondary school, Kensington Aldridge academy, taking part in competitions and appearing on stage.\r\nWell-liked without being ostentatiously popular, Mierna was the eldest of three sisters who lived in a large 22-floor flat in Grenfell Tower with their mother and father, immigrants from the Bekaa valley in eastern Lebanon.\r\nShe was highly motivated but with a self-effacing streak. One teacher described her work in literacy classes as being among the strongest she had ever seen. \r\nOn the cusp of adolescence, Mierna had started to wear her dark hair untied, causing her mother to consult friends about how to manage a teenage girl.","Credit":"Susanna Rustin"},{"Name":"Zaynab Choucair","Floor":"22","Age":"Three","Nationality":"British","Pic-url":"https://media.guim.co.uk/dc2ddeae9a876ed39fed57d188a3402a0854247b/429_495_282_282/140.jpg","Short-biog":"Chatty three-year-old with a curiosity about the world","Long-biog":"The baby of her family of five, Zaynab is remembered as a happy, chatty three-year-old girl whose life was just getting under way.\r\n\r\n\r\nShe lived with her two sisters in a 22nd-floor flat in Grenfell Tower with their mother and father, who moved to the UK from the Bekaa valley in eastern Lebanon. Zaynab’s grandmother Sirria, lived in a smaller apartment on the same floor, and would look after the infant while her mother Nadia worked.\r\n\r\n\r\nLess than a month before the fire, Zaynab started attending the local nursery where her mother worked. She quickly imprinted her personality on staff, whose first task was to figure out how to keep mother and daughter apart during the day so that Zaynab could settle without distraction. \r\n\r\n\r\n“I loved having our chats,” recalls nursery teacher Raquel Barge Esteban. \"I am so grateful I had the opportunity to help her settle in. She had endless questions she wanted us to answer, and I wish I wish we could have helped her find the answers to many more.\"","Credit":"Susanna Rustin"},{"Name":"Eslah Elgwahry","Floor":"19","Age":"64","Nationality":"Egyptian","Pic-url":"https://media.guim.co.uk/6e7134ed710ff10679798fb426695e055135d982/448_0_1016_1016/140.jpg","Short-biog":"“A homemaker who took pride in raising her two children”","Long-biog":"Eslah Elgwahry, originally from Egypt, shared her 22nd-floor apartment with her daughter Mariem.\r\nAged 64 when she died, Elgwahry had moved to Britain in the early 80s, finding a home in Grenfell Tower. She was a homemaker and took pride in raising her two children.\r\nMariem Elgwahry also perished in the fire. The family told the Guardian they were reluctant to speak more as they were still grieving their loss.","Credit":"Ruth Michaelson"},{"Name":"Mariem Elgwahry","Floor":"19","Age":"27","Nationality":"British","Pic-url":"https://media.guim.co.uk/58ebd6b283e2960eb01b4b4c32e29830a68b8f30/252_0_498_498/140.jpg","Short-biog":"“A young Londoner making impressive strides in her marketing career”","Long-biog":"Mariem Elgwahry was a young Londoner making impressive strides in the early stages of her marketing career.\r\nBorn in London, she graduated from Roehampton University with a degree in business management. The 27-year-old worked as an estate agent and latterly as a marketing manager at the cashback and voucher codes website Quidco, where she was promoted twice in two years.\r\nShe lived with her mother, Eslah, on the 22nd-floor of Grenfell Tower. Both died in the fire last June. She was one of several residents who had raised questions about the state of the building with the council.\r\nHer family told the Guardian they were reluctant to speak more of her life as they were still grieving their loss.","Credit":"Ruth Michaelson"},{"Name":"Mohamednur “Mo” Tuccu","Floor":"Non-resident","Age":"44","Nationality":"Eritrean","Pic-url":"https://media.guim.co.uk/5f508ec3370865139aececd3692b085a7e768f98/317_0_2036_2036/140.jpg","Short-biog":"\"He had a way of making you feel like an old friend – welcome and at ease\"","Long-biog":"When Mohamednur Tuccu was growing up in Asmara, capital of Eritrea, in the 1970s, he loved to arrange football tournaments for his friends in the neighbourhood. Not just so he could play, but so that he could commentate, making everyone laugh with his cheeky sense of humour.\r\n\r\n\r\n“He was a very funny boy,” his younger brother Ibrahim Toukou Mohamednour, recalled. “He liked singing and performing, creating and developing his own songs and funny jokes.” At the football tournaments, he said, ‘Mo’ would make trophies by cutting plastic containers in half and sticking them together. “I used to admire him so much,” Ibrahim told the Grenfell inquiry.\r\n\r\n\r\nMohamednur was bright, particularly in sciences. In his teen years, he somehow became drawn into the resistance movement against Ethiopian rule (Eritrea did not secede from Ethiopia until 1993), and had to flee into exile in Sudan in 1989. Though they kept in touch ever since, the two brothers, the closest of siblings in a family of nine children, never saw each other again.\r\n\r\n\r\nMohamednur moved first to Nigeria, and then to the UK, where he took a BSc in genetics at Queen Mary’s university. “He liked the UK because he was very much looking to continue his education,” Ibrahim said. “He worked and sent money back to his family. He stayed in London for most of his life.”\r\n\r\n\r\n“He saw himself as a people person and was loved by many.” Mohamednur threw himself into volunteering and charitable work for the Eritrean Muslim Community Association. He married Amal Ahmedin in 2011 and they had a daughter three years later.\r\n\r\n\r\nHe was described by friends and colleagues as a popular, intelligent, gracious man with many talents.\r\n\r\n\r\nTuccu had worked as a security guard for the PR company Red Consultancy for 10 years, working from 5.30pm until 10pm each night. Mike Morgan, Red Consultancy’s chief executive, said Tuccu was “very much part of us” with “a very high profile in the company. He was chatty and friendly. He genuinely was this guy who never had a bad mood, never was grumpy, never dissatisfied. It was just his temperament.”\r\n\r\n\r\nRelatives travelled from Germany, Canada and Saudi Arabia for his funeral at East London mosque on 24 June, 10 days after the fire.\r\nTracey Lloyd, the head of St Peter’s nursery in Notting Hill, where three-year-old Amaya went, said Tuccu and his wife were “very gracious people” and wonderful parents. “They adored their child and just wanted her to have a good time at nursery,” said Lloyd. “Both of them worked together in harmony bringing up their daughter.”\r\nJason Wall, a former colleague who left Red Consultancy six months before the fire, recalls how Tuccu was liked by everyone he met. “Mo was loved very much and will be greatly missed,” said Wall. “I only knew Mo for two short years at Red but he had a way of making you feel like an old friend – welcome and at ease. \r\n“I always enjoyed talking to him about his young daughter, who he said was growing up fast and becoming a cheeky ‘chatterbox’ who he loved very much. I also enjoyed hearing about his various side projects on the go. Mo was a man of many talents, from serving up the finest Eritrean style coffee to being a crafty DIYer. Word has it he was the fastest house-painter in all of London!\r\n“Mo loved to laugh and his cheeky demeanour made many others laugh too. I’ll cherish all the times we spent talking hilarious nonsense together. It sounds like a cliche but he was popular with almost everyone who met him. He was one of those rare people who brought everyone together and made the world a better place. I’ll never forget his bright smile and his positive attitude towards others.”","Credit":"Kate Lyons"},{"Name":"Amal Ahmedin","Floor":"19","Age":"35","Nationality":"Eritrean","Pic-url":"https://media.guim.co.uk/8a1ae4bc47e7b82de602e7532082f4f199d532ea/0_0_500_500/140.jpg","Short-biog":"\"She was a very talented cook and absolutely generous\"","Long-biog":"Polyglot, stylish, funny, vivacious and a devoted mother to her three-year-old daughter Amaya, Amal Ahmedin was a lynchpin in her large Eritrean family, a mother figure to her younger sisters and a generous caring character to people she knew and those she didn’t.\r\nRelatives spoke of an infectious joy that she brought to a room, of a strong value set that she instilled in her siblings, and of how she blossomed after she and her husband Mohamednur Tuccu had their daughter in 2014. All three died in the fire.\r\n\r\n\r\n“She was vibrant, funny, cheeky, stylish, wholehearted and showed me how to live life to the fullest,” said Feruza Afwerki, her sister. “She lived life like it was her last day and was always the life of the party.”\r\n\r\n\r\nFeruza Afwerki said she spoke five languages and was “one of the most hardworking people I knew”. Another sister, Winta Afwerki, said: “I had nightmares as a kid she would hold me so tight and squeeze out the nightmares. Growing up, she taught me how precious life was and the importance of the kind of people you surround yourself with.\r\n\r\n\r\n“She loved her friends and family so much, especially her daughter, who was the  love of her life,” Winta Afwerki told the Grenfell inquiry. “Amal was an incredible mother. Motherhood brought out a layer of her personality that we were all in awe of.”\r\n\r\n\r\nAmal Ahmedin was actively involved in the nursery that Amaya attended. Tracey Lloyd, the head of St Peter’s nursery in Notting Hill, recalls how Ahmedin would often bring in homemade dishes to the shared lunches held at the school.\r\n\r\n\r\n“Amaya’s mum used to turn up with the most delicious food: special bread she made by hand, curries, stews – it was all vegetarian and it would always disappear very quickly,” says Lloyd. “She was a very talented cook and very modest about it, and absolutely generous.”\r\nLloyd said Ahmedin and her husband, Mohamednur Tuccu, were “very gracious” and easy to talk to. “They adored their child. They worked together in harmony bringing up their child.”\r\nLloyd said the whole family, including Amaya’s aunt Amna Mahmud Idris, who also died in the fire were closely involved in the little girl’s life and were known to the nursery.\r\nA funeral service for Ahmedin, Mahmud and Amaya took place in October at East London mosque.","Credit":"Kate Lyons"},{"Name":"Steven Power","Floor":"15","Age":"63","Nationality":"British","Pic-url":"https://media.guim.co.uk/e22d894fea6b7279bae50992f26962af67306b3d/237_10_492_492/140.jpg","Short-biog":"\"He had this twinkle in his eyes. He could just smile at me and I’d crumble\"","Long-biog":"Steven Power was a Grenfell veteran – a resident for almost 40 years who would bring food downstairs and share it with his neighbours, picnicking outside. \r\n\r\n\r\nHis former partner Claudia Davies says he was her first adult love, and though they split up 20 years ago, she remembers him fondly. \r\n\r\n\r\n“He had this twinkle in his eyes. He could just smile at me and I’d crumble,” she recalls. “He was clever, too. He was always a quick thinker, one step ahead of everyone else in the room – able to crack a joke to wind someone up and start everyone laughing. He never lost that charm.”\r\n\r\n\r\nShe adds: “He wasn’t perfect, of course. He could be stubborn.”\r\n\r\n\r\nPower and Davies had a son, Wayne, who is now in his 30s, and they remained in touch even after splitting up. For the past decade, Power spent Christmas with Davies and her new partner.\r\n\r\n\r\nWith five children in total, Power was a single parent to his two younger children, Rebecca and Bobby, now 21 and 27. “He was a good dad as the children got older,” says Davies. “Fatherhood made him stable and happy. He was very close to his kids.\"\r\n\r\n\r\nFor his holidays, Power sought the tranquility of the countryside. His favourite escape was to hire a boat and glide along the canals with his family, fishing and listening to music. Even more than fishing and his dogs, Power loved music. In the 1980s, he worked as a celebrity chauffeur, driving bands including the Wee Papa Girl Rappers around the country, and he owned thousands of vinyl records.\r\n\r\n\r\nA baby girl, Aniya-Louise, was born last August to Wayne and his partner, Amy. \"She's a beacon of light,” says Davies. “She's the spit of Stephen – she's got exactly his eyes.\"","Credit":"Amelia Hill"},{"Name":"Amaya Tuccu-Ahmedin","Floor":"19","Age":"Three","Nationality":"British","Pic-url":"https://media.guim.co.uk/36de044bbead221620b3eca1c01c1e310c0443e9/0_0_500_500/140.jpg","Short-biog":"\"A really sweet and confident little girl, she was going places\"","Long-biog":"Precocious, bubbly and full of fun, Amaya Tuccu-Ahmedin was a popular pupil of St Peter’s nursery in Notting Hill who loved playing with friends and dressing up as a princess. \r\nShe was the first of the next generation born into the large Eritrean exile clan of parents Mohamednur Tuccu and Amal Ahmedin. “Amaya was an angel and the sweetest little girl,” recalled her aunt, Winta Afwerki, who was present at her birth.\r\n\r\n\r\n“Amaya's laugh was infectious. Her whole body would shake and she would jump up and down. She would run  around and want to play with anybody, young or old. She was so smart and a bit cheeky and we all realised pretty early on that she was definitely her mother's daughter.”\r\n\r\n\r\nAnother aunt, Feruza Afwerki, said Amaya loved to sing songs from the film Frozen at the top of her voice. “She would always stop at someone busking on the street and break out into dance or just admire their talent. She was so precious.”\r\n\r\n\r\nShe was well-liked by other toddlers at the nursery, according to its head, Tracey Lloyd. Lloyd says that, on the last day she saw Amaya, “she bounded into nursery, eager to show me her new shoes: little pink and black trainers”.\r\n“All the children migrated to her, she was a very popular member of the room,” says Lloyd. “She knew her mind, she was very self-assured. She was going places, that one. She was a really sweet little girl and very confident. She was good fun to be around.”\r\nLloyd describes Amaya’s parents as “two of the most beautiful people you could meet”, who adored their daughter and were both involved in the nursery.\r\n“She came from a loving family and was the apple of everyone’s eye. She was very much loved,” says Lloyd.","Credit":"Kate Lyons"},{"Name":"Amna Mahmud Idris","Floor":"Non-resident","Age":"27","Nationality":"Eritrean","Pic-url":"https://media.guim.co.uk/6e7134ed710ff10679798fb426695e055135d982/448_0_1016_1016/140.jpg","Short-biog":"“She took an active role in the upbringing of her niece”","Long-biog":"Originally from Eritrea, Amna Mahmud Idris was the younger sister of Amal Ahmedin, who also died in the fire. \r\nShe was born in Eritrea in 1990 and moved to Sudan in 2010 where she met her husband, Ibrahim. He moved to the UK and she followed him in 2016. Ibrahim says she was an artist and designer by both temperament and trade. \r\n“She was happy to help other people,” he told the Grenfell inquiry. “I will never find someone like Amna.”","Credit":"Guardian staff"},{"Name":"Sirria Choucair","Floor":"22","Age":"60","Nationality":"Lebanese","Pic-url":"https://media.guim.co.uk/11001691f5b67ff7df01fd3d4b7c41a01826a902/0_0_500_500/140.jpg","Short-biog":"“She spent a lot of her time being friendly with people”","Long-biog":"Sirria Choucair was born in Lebanon into a farming family, the second of six children. She did not have the chance to go to school, and when she was bringing up her children in England, she would remind them how privileged they were.\r\n\r\n\r\nHer son, Nabil, recalls: “She used to say: ‘I wish I could have gone to school, I wish I learned English the way you learned it.’”\r\n\r\n\r\nChoucair left her parents when she was about 18 to marry a man from the same area who had travelled to London to work in a Lebanese restaurant. “It was a difficult decision for her to leave her family, to move to London, knowing she would have to spend her life here with no other relatives; she was very nervous not knowing anyone,” her son says.\r\n\r\n\r\nShe and her husband moved a few times in the 1970s and 80s, as their family grew to include four children – two sons and two daughters. After Choucair’s husband became ill, she took on three jobs to provide for the family, starting her days at 6am as a chambermaid in a west London hotel, before serving food to patients at the Royal Marsden hospital. She also worked as a domestic cleaner. Evenings were taken up washing clothes and preparing meals for her family, as well as stitching curtains, pillowcases and trousers. \r\n\r\n\r\nHer son says: “She was very busy. I don't remember her having time to relax; she had to come home, do the housework, make sure the clothes were washed. She wouldn't complain, she would just get on with it.”\r\n\r\n\r\nChoucair enjoyed her job at the Royal Marsden; by that time her English had improved (she spent years watching American soaps like Dallas and Dynasty, trying to become fluent) and she liked talking to patients and hospital staff. She saved so her children could attend a private Islamic school in west London. \r\n\r\n\r\n“Homework was very important to her; she wanted to make sure we had a good education. She wouldn’t have had time to come to parents’ evening because of her hours, but she would help us with our Arabic homework. She devoted so much of her time to her kids. It made her happy,” says Nabil.\r\n\r\n\r\nEvery other year, if things were relatively stable in Lebanon, they would travel back to visit family. For the first 10 years that she had lived in London, she had not been able to return. There were no phones in the village, so all communication was done by letter, but Sirria could not write much. Nabil remembers hearing his mother dictating letters to his father. “They did that quite often; she would tell him to write: ‘Send kisses to the family from me.’” \r\n\r\n\r\nHer husband died in 2002, and around a decade later, Sirria Choucair moved to Grenfell Tower to be near her daughter Nadia, so she could help her with her grandchildren. She did not like the flat to begin with, and complained to her son about problems with the television aerial, lifts, leaks and a faulty intercom. “There was a nice view, but she didn’t like the fact that she was very high up, because she knew that if the lift wasn’t working, she would have problems.”\r\n\r\n\r\nChoucair made many friends at Grenfell: Nabil has lost count of the number of times people came up to him to say how much they loved her. “She wasn’t shy. She was full of surprises. I never knew they knew her. She made friends very easily. She spent a lot of her time being friendly with people.”","Credit":"Amelia Gentleman"},{"Name":"Husna Begum","Floor":"17","Age":"22","Nationality":"British-Bangladeshi","Pic-url":"https://media.guim.co.uk/bd645488fe78e79e9b4b775ea28fc8a46bf8d8d9/544_677_140_140/140.jpg","Short-biog":"“She was looking forward to getting married to the person she loves”","Long-biog":"Husna Begum, the youngest of Komru Miah and Rabia Begum’s four adult children, was weeks away from her wedding when she died.\r\n\r\n\r\nRelatives said she had been shopping with her brothers and parents a few days before the fire, to prepare for the ceremony on 29 July and a party for 200 guests.\r\n\r\n\r\nAbdul Khan, 60, one of her cousins, said of Begum, who worked at Carphone Warehouse: “The last time I saw her, all she could talk about was the wedding. Everything was arranged, all the invitations were sent. She was looking forward to it, getting married to the person that she loves.”\r\n\r\n\r\nHer sole surviving brother, Mohammed Hakim, told the Grenfell inquiry that she was “the epitome of adventure and spirit.”\r\n\r\n\r\n“She marvelled at the universe and had a burning desire to travel and experience as much of the world as possible,” he said. “Husna was an intellectual and often indulged in creative writing and studying history. She was an amazingly good cook too; she could make any kind of dish or dessert and it would always come out delicious and right the first time. If you ever ate her cooking, you would always ask to eat more.”\r\n\r\n\r\nHer mother and father came from the poor north-eastern Sylhet region of Bangladesh. They would take Begum and her siblings on visits to Moulvibazar, where her half-brother and half-sisters lived with Miah’s first wife.\r\n\r\n\r\nLocal Bangladeshis said the family were devout Muslims who prayed five times a day. Abdur Rahman Shohel, the general secretary of the local press club, said: “I knew the family well. The parents and their children were religious people.”\r\n\r\n\r\n\r\n\r\nBegum was in the family’s 17th-floor apartment when the fire took hold. Relatives said she and her two brothers – Mohammed Hanif and Mohammed Hamid – stayed in the flat and prayed with their parents, refusing to leave them as the fire took hold.","Credit":"Sandra Laville, Saiful Islam and Adil Mahmood"},{"Name":"Rabia Begum","Floor":"17","Age":"65","Nationality":"Bangladeshi","Pic-url":"https://media.guim.co.uk/738b95d45d93705c6786365ca4f42ee2cbaab6ac/0_0_500_500/140.jpg","Short-biog":"“Rabia was a social person, she always asked about my family”","Long-biog":"Rabia Begum was born in Bangladesh in 1952 and brought to London in 1980 from Sylhet province by her husband Komru Miah. She was his second wife, and they shared a 17th-floor flat in Grenfell Tower with three of their four adult children.\r\n\r\n\r\n“She was the most beautiful, generous, caring and loving mother anyone could ever ask for,” said Mohammed Hakim, her one surviving adult son. “Most of all, she was my mum.”\r\n\r\n\r\nRabia was quick to laugh and easy to be around, he said - a great cook who knocked up a mean lamb curry. “We always felt safe with her. She was the person we would go to as an adult when 19 we were scared or worried,” he told the Grenfell inquiry.\r\n\r\n\r\nNanu Miah, Rabia’s brother, said: “He [Komru Miah] was very good to my sister. He even built a house in a nearby village so that they can visit frequently. Every couple of years, they visited here, bringing at least one of their children with them.\r\n\r\n\r\n“Whenever they [the children] came here to visit, the only things they wanted were a particular dish of locally bred chicken and cold beverages. The humidity in Bangladesh was a bit too much for them.”\r\n\r\n\r\nRaja Alam, a neighbour who knew the family well, said they were sorely missed. “I still can’t believe how a lovely and Allah-fearing family like that has gone in such a manner,” Alam said. “Rabiya Begum was a social person. She always asked about my family members whenever she visited.”\r\n\r\n\r\nLocal Bangladeshis said the family were devout Muslims who prayed five times a day. Abdur Rahman Shohel, the general secretary of the local press club, said: “I knew the family well. The parents and their children were religious people.”\r\n\r\n\r\nRelatives said the family were reciting passages from the Qur’an in their final moments, with Begum’s two sons and daughter remaining with their parents.","Credit":"Saiful Islam and Adil Mahmood"},{"Name":"Mohammed Hanif","Floor":"17","Age":"26","Nationality":"British-BangladeshI","Pic-url":"https://media.guim.co.uk/bd645488fe78e79e9b4b775ea28fc8a46bf8d8d9/394_649_157_157/140.jpg","Short-biog":"The third of Komru Miah and Rabia Begum’s four adult children","Long-biog":"Mohammed Hanif, the third of Komru Miah and Rabia Begum’s four adult children, lived with his parents, older brother and younger sister in a flat on the 17th floor of Grenfell Tower.\r\n\r\n\r\nTalented, devout, charitable and creative, he loved drawing, design and animation. Down time for him would involve sci-fi movies or PlayStation sessions with his brothers and sister.\r\n\r\n\r\n“Hanif was an extremely passionate person when it came to faith and God as well as helping others in need,” his brother, Mohammed Hakim told the Grenfell inquiry. “Hanif has always been extremely creative from a young age. He was brilliantly talented in drawing and design and adored animation. He would often create his own animations or create beautiful pictures for our whole family.”\r\n\r\n\r\nHis mother and father came from the poor north-eastern Sylhet region of Bangladesh. They would take Hanif and his siblings on visits to Moulvibazar, where his half-brother and half-sisters lived with Miah’s first wife.\r\n\r\n\r\nLocal Bangladeshis said the family were devout Muslims who prayed five times a day. Abdur Rahman Shohel, the general secretary of the local press club, said: “I knew the family well. The parents and their children were religious people.”\r\n\r\n\r\nRelatives said Hanif and his siblings – Mohammed Hamid and Husna Begum – stayed in the flat and prayed with their parents, refusing to leave them as the fire took hold.\r\n\r\n\r\nLittle more is known about Hanif’s life; his family did not wish to speak further about him.","Credit":"Sandra Laville, Saiful Islam and Adil Mahmood"},{"Name":"Mohammed Hamid","Floor":"17","Age":"27","Nationality":"British-Bangladeshi","Pic-url":"https://media.guim.co.uk/bd645488fe78e79e9b4b775ea28fc8a46bf8d8d9/501_449_145_145/140.jpg","Short-biog":"The second of Komru Miah and Rabia Begum’s four adult children","Long-biog":"Mohammed Hamid, the second of Komru Miah and Rabia Begum’s four adult children, lived with his parents and younger brother and sister in a flat on the 17th floor of Grenfell Tower.\r\n\r\n\r\nHis one surviving sibling, Mohammed Hakim, said he “was a bit of a joker, and would crack funny one-liners only he could come up with. He would make us laugh for hours on end.”\r\n\r\n\r\nAs a child, Hakim said Hamid would always be up to some ruse or other, building an ant fortress with moss and sticks or cruising around with his cousins when they’d learned to drive. \r\n\r\n\r\n“His fun-loving personality always shone through even when he wasn’t feeling his best… he loved living, he wanted to do so much not just for himself but for everyone around him.\r\n\r\n\r\n“He was a bit of a joker too and would crack funny one-liners only he could come up with, which were 15 pure genius,” Hakim told the Grenfell inquiry. “He would make us laugh for hours on end.”\r\n\r\n\r\n“He was very mature for his age and wise, how quickly he was taken away. The world has lost a magnificent soul.”\r\n\r\n\r\nHis mother and father came from the poor north-eastern Sylhet region of Bangladesh. They would take Hamid and his siblings on visits to Moulvibazar, where his half-brother and half-sisters lived with Miah’s first wife.\r\n\r\n\r\nLocal Bangladeshis said the family were devout Muslims who prayed five times a day. Abdur Rahman Shohel, the general secretary of the local press club, said: “I knew the family well. The parents and their children were religious people.”\r\n\r\n\r\nRelatives said Hamid and his siblings – Mohammed Hanif and Husna Begum – stayed in the flat and prayed with their parents, refusing to leave them as the fire took hold.","Credit":"Sandra Laville, Saiful Islam and Adil Mahmood"},{"Name":"Komru Miah","Floor":"17","Age":"82","Nationality":"Bangladeshi","Pic-url":"https://media.guim.co.uk/4e6531697fe91374a6517cbeed038577b73db524/383_35_496_495/140.jpg","Short-biog":"“He was a deeply religious person, I never saw him missing any prayer”","Long-biog":"In the 1960s, Bangladesh was a struggling region with dreams of independence and Komru Miah a struggling father of three from the poor north-eastern Sylhet region. Emigration was a route out of poverty. He moved to London, leaving his family behind.\r\n\r\n\r\nMiah worked in the burgeoning Bangladeshi curry house industry as a busboy and latterly a chef, according to relatives.\r\n\r\n\r\n“He used to visit us at least once, sometimes twice a year,” Sujon recalls at the modest Miah house in Moulvibazar that he shares with his mother. “During one of these trips, he married my stepmother without asking my mother’s consent. Then he started to visit less and less as he was having children with my stepmother.”\r\n\r\n\r\nKomru Miah went on to have four children with his second wife, Rabia Begum. All but one would die in the Grenfell tower fire.\r\n\r\n\r\nHis one surviving son from his second marriage, Mohammed Hakim, told the Grenfell inquiry that his father was a religious man who also had a penchant for action movies.\r\n\r\n\r\n“My father was an amazing father, a dedicated husband and a good Muslim who prayed five times daily and a family man,” he said. “He loved watching a lot of nature programmes as well as a lot of action movies as a pastime - anything with Arnold Schwarzenegger, Sylvester Stallone, Bruce Lee, Jean-Claude Van Damme, Steven Seagal, and Jet Li were among his favourites.”\r\n\r\n\r\n\r\n\r\n\r\n\r\nSujon said the two families enjoyed cordial relations and Miah continued to support the local community, never forgetting where he came from.\r\n\r\n\r\n“My father had done plenty for the local community. He donated hefty amounts to build mosques and orphanages in the area, supported many families within the clan in distress. He was a deeply religious person, I never saw him missing any prayer,” Sujon said. \r\n\r\n\r\n“My half-siblings used to tag along with my father and stepmother during these trips [in Bangladesh] when they were little. We visibly had no bad blood between us. I don’t know why they [the half-brothers and half-sister] stopped visiting us as soon as they grew up,” he continued.\r\n\r\n\r\n\r\n\r\n\r\n\r\nMiah’s first wife, Jolekha Khatun, said he had supported them financially and his death would leave them with little means of support. \r\n\r\n\r\n“He used to send us small amounts of money every now and then when he was alive. After his demise, we are in deep trouble,” she said.\r\nMiah is understood to have moved into Grenfell Tower in 2016 with his second wife and three of their children, now grownups. All of them died in the fire. Only a son, Mohammed Hakim, survived.","Credit":"Saiful Islam in Moulvibazar and Adil Mahmood in Dhaka"},{"Name":"Nura Jamal","Floor":"22","Age":"35","Nationality":"Ethiopian","Pic-url":"https://media.guim.co.uk/51ead72043549a835eced86f36c6bf9c8289d850/0_0_500_500/140.jpg","Short-biog":"\"She could befriend anyone, no matter who they were\"","Long-biog":"Nura Jamal was a ball of positive energy. Friends of the 35-year-old, who lived with her husband and three children on the 22nd floor of Grenfell Tower, say her joy was contagious and that simply being around her “could lighten up anyone’s day in a matter of seconds”. Mothers who got to know her through her younger children’s school saw her as kind and generous, while headteacher Katy Blackler says she was “an intelligent, positive lady”.\r\n\r\n\r\nJamal was devoted to her three children Firdaws, Yahya and Yaqub, and was often seen ferrying them to and from school as well as to various sports groups and clubs. Her sister-in-law Assema Kedir says: “She could befriend absolutely anyone, no matter who they were or what they believed in.”\r\n\r\n\r\nSean Mendez, who runs Solidarity Sports, a charity that runs a children’s activity group that Jamal’s children attended, agrees: “She used to drop the kids off and pick them up and she was lovely – always ready with a smile and asking how you were. She was always smiling.”\r\n\r\n\r\nDonato Nardizzi, who taught Jamal’s sons taekwondo, says she always wanted to know how they were getting on: “She didn’t just drop them off and say hi; she watched and wanted to know how they were doing, what they needed to work on. She was totally engaged in them as people and was a tremendous support and source of love for them.”\r\n\r\n\r\nBut for Kedir it was her sister-in-law’s faith that stood out above all else. “One thing that made you so special was your constant devotion to your religion and your trust in Allah,” she said in a statement after her death. “We were all taken aback by the way you used to think of Allah in every matter in this world. Islam was your passion and you wisely managed to communicate your wisdom to your children in a way that no other parent could.”","Credit":"Matthew Taylor"},{"Name":"Firdaws Hashim","Floor":"22","Age":"12","Nationality":"British","Pic-url":"https://media.guim.co.uk/6d099a461413e8fb225530b21fe541b4165d6cf4/0_0_500_500/140.jpg","Short-biog":"\"She was absolutely spellbinding. I thought: my God, that girl is going to go far\"","Long-biog":"Wise beyond her years and full of fun, with a sharp mind, beautiful singing voice and a seemingly limitless capacity to care for others: this is how friends of Firdaws Hashim remember the 12-year-old.\r\n\r\n\r\nA few months before the Grenfell Tower fire, the Channel 4 news anchor Jon Snow met Firdaws Hashim during a debating competition designed to empower young people from disadvantaged backgrounds.\r\n\r\n\r\n“I will never forget it,” says Snow, who was asked to judge the best floor speech, with Bill Gates giving out the prizes. “She stood out above anybody else. She was absolutely spellbinding and I thought: my God, that girl is going to go far. \r\n\r\n\r\n“But, desperately, she died high up in the building with the whole of her family and it absolutely breaks my heart every time I think about it.”\r\n\r\n\r\nFor those who knew Firdaws, the impact she had on Snow comes as no surprise. Friend after friend says she was exceptional; as one said, she was destined for a “good and meaningful life”.​\r\n\r\n\r\nSean Mendez, who runs Solidarity Sports, a charity that works with young people from disadvantaged backgrounds, knew Firdaws well. “She was someone who was just so easy to love,” he says. “You met her and you were just like, wow; whatever level you were she could inspire you.”\r\n\r\n\r\nFirdaws was the middle child of three. She died alongside her two brothers, Yahya, 13, and Yaqub, six, and her parents, Nura Jamal and Hashim Kedir, on the 22nd floor of Grenfell Tower.\r\n\r\n\r\nEmma Kibble, who taught her at Avondale Park primary school, described her in a report from the year before she died as an “incredible asset to our school”, with a “have-a-go attitude and a thirst for learning”. She singled out her talent for languages and wondered whether Firdaws would become a “scientist, doctor or professor” when she grew up. \r\n\r\n\r\nHer former headteacher Katy Blackler also held her in high regard, and praised her responsible and enthusiastic approach to her role as deputy head girl. “I’m sure you’ve heard she was brilliant at everything; but she was,” she says. “She was a great singer, and sportsperson, and speaker and all the children knew her. When I told them she had died there were big, big tears rolling down their faces.”\r\n\r\n\r\nMendez remembers Firdaws always being on hand to help if younger children were playing up. “She was so calm and kind and they looked up to her,” he says. “All children are special but Firdaws just had this thing that pulled you up and made you really think: here is someone who is destined for something important. She radiated this love and maturity which was so rare for someone so young.”","Credit":"Matthew Taylor"},{"Name":"Yahya Hashim","Floor":"22","Age":"13","Nationality":"British","Pic-url":"https://media.guim.co.uk/9682e333358da599d31643af5c806d8a22664c89/0_0_500_500/140.jpg","Short-biog":"\"He took looking after his little brother very seriously\"","Long-biog":"Like countless other 13-year-old boys, Yahya Hashim lived for football. He played whenever he could and was a devoted follower of his beloved Arsenal.\r\n\r\n\r\n“He was totally football crazy,” recalls Sean Mendez, who runs Solidarity Sports, a centre that works with young people from disadvantaged backgrounds. “On trips we had all sorts of things on offer – rock climbing, canoeing, abseiling – and all he would do was tap me on my shoulder and say: ‘Sir, sir can we play football, can we play football?’”\r\n\r\n\r\nTo Yahya’s aunt, Assema Kedir, he was “the most kind, polite, loving, generous, thankful and pure-hearted boy I ever knew”. \r\n\r\n\r\nOnce the two of them shared a cabin on a boat trip from Oslo, where she lives. “We started talking about the things that bother you most and we spent half the night talking,” she said in a statement after his death. “I know you appreciated that moment and I was/am humbled by that.”\r\n\r\n\r\nYahya also had a deep interest in his religion and had thought about becoming a teacher of Islam. “Everyone that met you used to fall in love with your politeness and pure-heartedness,” Kedir said in the statement. “You were a perfect example of how a Muslim should be; you would have been a pride to Islam and humanity.”\r\n\r\n\r\nA couple of months before the Grenfell Tower fire that killed him, his brother, Yaqub, his sister, Firdaws, and his parents, Nura Jamal and Hashim Kedir, Yahya phoned Mendez out of the blue. “He wouldn’t call me Sean he would always call me sir, and he said: ‘I want to ask you sir, I want to be a volunteer to help others at the centre.’\r\n\r\n\r\n“I said he was a bit young at the moment but that we could start giving him a few extra responsibilities. It was typical of him and we were going to start doing that but we never got the chance.”\r\n\r\n\r\nAt the taekwondo club he attended with his Yaqab, the instructor Donato Nardizzi remembers a very conscientious boy, saying: “He was very mature like an adult almost. He was speaking to one of my assistants saying he was getting concerned about his little brother, saying he needs help to focus more.\r\n\r\n\r\n“It was almost like a parent wanting their child to do well. He took looking after his little brother very seriously and there was no hint of disruption or ill feeling towards another person: I never saw even a hint of it.”","Credit":"Matthew Taylor"},{"Name":"Yaqub Hashim","Floor":"22","Age":"Six","Nationality":"British","Pic-url":"https://media.guim.co.uk/a3d2ec969a2a7caccac50d8922fd3a227aa28c7a/0_0_500_500/140.jpg","Short-biog":"Six-year-old said he wanted to be a fireman, “because I want to save the world”","Long-biog":"Aged six, Yaqub Hashim was the youngest of three siblings, a ball of energy who made adults smile and his peers laugh.\r\n\r\n\r\nHis teachers at Avondale Park primary, where he was about to finish year 1, paint a similar picture. \"Yaqub was a character: chatty, mischievous, lively, but charming, with lots to say,\" according to headteacher Katy Blackler. While the school's rule was that bikes and scooters should be pushed in the playground, most mornings Yaqub would have a go at scooting across before being told \"walk please, Yaqub\", Blackler recalls.\r\n\r\n\r\nRemembered as an entertainer who relished making others laugh, Yaqub came from a family of big personalities to whom he was strongly attached.\r\n\r\nHis aunt Assema Kedir said of Yaqub in a statement after his death: “The energy you had, oh my! A minute in your presence wouldn’t pass without laughing; just following your movement was enough …Thinking about it now, it feels like you were trying to use all the energy you had and didn’t want to waste a second of your unfairly short life.”\r\n\r\n\r\nAt school Yaqub is remembered for his dancing, his model-building and his love of sport, especially football. He sometimes struggled to contain his emotions when his team lost a game. His teacher Laura Kettle noted his musicality and praised his writing as well as his cheerful, positive attitude to learning. In a school book he wrote that he wanted to be a fireman when he grew up, \"because I want to save the world\".\r\n\r\n\r\nInstead he died aged six alongside his sisters Yahya, 13, Firdaws, 12, and his parents, Nura Jamal and Hashim Kedir, on the 22nd floor of the tower.\r\n\r\n\r\n“The loss of this family is a loss to the world,” says taekwondo instructor Donato Nardizzi. “I actually think that those kids would have been grown up to be more than just an influence in their local community … We are all the ones that have really lost something special because the world, in some small way, would have been changed, would have been made more peaceful by their presence.”","Credit":"Matthew Taylor"},{"Name":"Hashim Kedir","Floor":"22","Age":"44","Nationality":"Ethiopian","Pic-url":"https://media.guim.co.uk/21e9384acaee641b147e25c4ee40e0411ad69c6d/0_0_500_500/140.jpg","Short-biog":"“He was the smartest boy in our school\"","Long-biog":"The things Hashim Kedir’s sister will remember most about him are the diversity of his friends, his smile, and his generosity. The 44-year-old taxi driver lived with his wife and three children on the 22nd floor of Grenfell Tower.\r\n\r\n\r\n“I used to be known as ‘Hashim’s sister’ – the sister of the smartest boy in our school,” says Assema Kedir. “It started in year 1 and followed me to university; Hashim’s sister ... I was proud but it was not always fun since most of the teachers expected the same from me!”\r\n\r\n\r\nIn a statement released after his death, Assema said Kedir was the person in the family people turned to if they were struggling and needed help: “You were the one I used to call when I had a problem that I couldn’t solve. You were the one I used to call when I had something good to tell. I don’t know what I am going to do without you.”\r\n\r\n\r\nNeighbours and friends described the taxi driver as a quiet but popular figure on the streets around the west London tower block, who made friends easily with people from all kinds of backgrounds and religions.\r\n\r\n\r\nAssema says: “One can tell the kind of person you were from the diversity of people that are crying over your death.”\r\n\r\n\r\nHashim, whose family originates from Ethiopia, used to play five-a-side football every Friday evening. Sean Mendez, who runs a local group for children from deprived backgrounds and knew the family well, was one of those who played in the Friday night matches.\r\n\r\n\r\n“He was really respectful always, thanking me for looking after the kids. He was really hard working, he was driven to make sure he was looking after people: the family, his friends, his neighbours. He was a lovely guy.”","Credit":"Matthew Taylor"},{"Name":"Hamid Kani","Floor":"18","Age":"61","Nationality":"Iranian","Pic-url":"https://media.guim.co.uk/6fa9c877cd1a826c4b611b5c9380c233e35bfa05/223_31_1018_1018/140.jpg","Short-biog":"\"He had lived there for more than 20 years, his flat gave him peace\"","Long-biog":"Hamid Kani loved to cook. And as the Persian saying goes, when he cooked, you’d lick your fingers. “He was witty and had a great sense of humour,” his cousin, Masoud Shahabedin, recalls. “He wanted to laugh and would tell you things to make you laugh as well.”\r\n\r\n\r\nThe 61-year-old’s flat at Grenfell Tower was adorned with traditional Iranian decorations, says Shahabedin. “He had a hubble-bubble [hookah] and a Persian samovar and he loved cooking because he worked as a chef in a Persian restaurant for several years.”\r\n\r\n\r\nShahabedin remembers Kani missing his cat when it died: “He got very upset. He was sad for a long time. We ask him to buy another cat but he said no other cat could replace it.”\r\n\r\n\r\nThe cousins had moved to the UK in 1979 when Iran was in the throes of revolution. But that was not their motivation: they were young men seeking adventure and education. He went to college in Southampton to study A-levels but soon realised going to university was not his thing. “He wasn’t interested in studying. He was into arts, especially plays,” says Shahabedin. “He didn’t continue his education. After two years, he went to London and I came to Manchester.”\r\n\r\n\r\nKani, who never married, first found work as a waiter, but wanted to be an actor. “He even did a couple of Iranian plays, but had very junior roles,” his cousin says. \r\n\r\n\r\nKani had no other relative in the UK, but had a brother and two sisters in Iran. He came from Rey in southern Tehran. His father had his own shop selling bags and luggage and his brother worked for a telecommunications company.\r\n\r\n\r\nKani travelled to Iran at least twice a year and had a ticket booked for the week after the fire at Grenfell Tower, where he lived on the 18th floor. He was planning to move back permanently when he retired. His cousin says he had many friends: “He worshipped his friends; some Iranians were at his place all the time. But when his father died and his financial support [for Kani] finished, he lost a lot of friends.”\r\n\r\n\r\nKani would call Shahabedin at least once a week. “Every time we’d talk for 50 minutes, we would talk about Iran, our childhood, politics and the things he would read online. He spent a great deal of time on the internet, which was his biggest support,” he says.\r\n\r\n\r\n“He was happy with Grenfell. He had lived there for more than 20 years; his flat gave him peace. He didn’t complain much in his life, he was an easygoing person. He’d live for today. He would give us a sense of peace, he’d give us his smile and I miss him a lot.”","Credit":"Saeed Kamali Dehghan"},{"Name":"Mohamed Amied Neda","Floor":"23","Age":"57","Nationality":"Afghan","Pic-url":"https://media.guim.co.uk/b15f7ef447a22150b6fea2cc8c0efc364646896d/128_59_368_368/140.jpg","Short-biog":"\"He was the sort of person who would do anything for his family\"","Long-biog":"In the early 1990s, Mohamed Neda faced an agonising choice. Afghanistan was in the grip of civil war, Kabul was becoming less and less secure, and his wife was pregnant. \r\n\r\n\r\nNeda, a senior officer in the army, was alerted to specific threats to himself and his family. He chose to flee, as did many other members of his family, and eventually ended up in the UK with his young family in 1998. They were given a flat on the 23rd floor of Grenfell Tower, No 205.\r\n\r\n\r\nBeing so far from home and having left behind a successful career, Neda could have been racked with regret and disappointment. But his son, Farhad Neda, says he threw himself into his work, setting about securing a future for his family. He became a minicab driver and latterly ran his own chauffeuring business. \r\n\r\n\r\n“He was the sort of person who would do anything for his family, to make sure his family had a comfortable life,” says Farhad. “I don’t remember him taking a day off work. He never said ‘I’m sick’.”\r\n\r\n\r\nThe Neda family adored their flat, with its spectacular views, light, airy aspect and spacious rooms. Farhad’s mother, Flora, is disabled and the council had suggested moving them. They refused. “We loved our home,” says Farhad.\r\n\r\n\r\nHis father doted on his only son, serving as driver, coach and cheerleader in chief for Farhad’s burgeoning taekwondo ambitions. \r\n\r\n\r\n“He used to drive me all over the country,” recalls Farhad. “I made it to the England team. He even went with me to international competitions in Poland, Belgium, Sweden. He was disappointed when I stopped. Until the day he died he was encouraging me to go back into it.”\r\n\r\n\r\nPerhaps the support that father gave son was life-saving. On the night of the fire, with flames already encroaching, Farhad Neda picked up his mother, put her over his shoulders and somehow brought her down 23 storeys via a stairwell. \r\n\r\n\r\nMohamed Neda stayed behind, possibly to help others trapped on the upper floors.","Credit":"Mark Rice-Oxley"},{"Name":"Mohammed al-Haj Ali","Floor":"14","Age":"23","Nationality":"Syrian","Pic-url":"https://media.guim.co.uk/d2801d7063a906b3f682c7069a94ce9d6f7c4d64/123_55_378_378/140.jpg","Short-biog":"“He was always meeting people, telling us about the culture and how we needed to integrate”","Long-biog":"Mohammed al-Haj Ali was always kind, even as a little boy, says his father, Nedal. He remembers giving him five small coins in their hometown of Daraa in Syria: with them he bought four sweets and handed them out to his siblings, keeping none for himself. His mother, Heam al-Haj Ali, recalls him coming into the kitchen to help prepare meals, or acting as a host when guests came to visit. \r\n\r\n\r\nHe carried that selflessness and generosity into adulthood. When he and his older brother, Omar, escaped their war-torn country in 2014, he called his family every day. Not only his parents, but his many aunts and uncles who stayed behind. “He wanted to know how we were every day,” says his father. “He wanted to take our pain away from us.”\r\n\r\n\r\nOn the night of the Grenfell Tower fire, the 23-year-old was separated from Omar, whom he lived with, in the chaos and thick smoke. As Omar lay on the floor outside the building having made it downstairs, friends and family spoke to Mohammed on the phone. He was still trying to care for two of his neighbours; he told Omar’s friends to look after him. “He was thinking about me more than himself,” says his brother. \r\n\r\n\r\nMohammed al-Haj Ali’s future was bright. He was studying engineering, hoping to follow in the footsteps of his father. After a month working at Savers, he was made a supervisor. Before he his death he was working at the shoe store Ecco, and had taken on a second job at Harrods. \r\n\r\n\r\n“He was always the one meeting people, telling us about the culture and how we needed to integrate,” says his younger brother Hashem, who followed his brothers to the UK. “Because he could laugh and smile easily, he got to know people, he took the lead whatever he was doing.” \r\n\r\n\r\nHashem remembers that after he passed his first exams in English, Mohammed had organised for all of their friends to come to congratulate his brother. “They were all shouting and clapping, I was happy and proud,” he says. Mohammed had natural charisma, his father says, adding: “We would call him the chief of Arabs, just for fun.”\r\n\r\n\r\nMohammed al-Haj Ali had been house-hunting with Omar for a while when they found their two-bed flat close to both of their jobs and their studies. The brothers, who were looking to rent privately, did not have many options. They were students and the landlord was, fortunately as far as they were concerned, still willing to accept them as tenants. \"We liked it,\" says Omar now. \"We didn't know if it didn't have an alarm or a fire exit.\"\r\n\r\n\r\nAsked how they would like their loved one to be remembered, the family are quiet for a moment. His mother speaks, and her eldest son translates: “In his kindness he was an example for those who would leave their homes and start another life. He is an example to others.”","Credit":"Alexandra Topping"},{"Name":"Rania Ibrahim","Floor":"23","Age":"31","Nationality":"Egyptian","Pic-url":"https://media.guim.co.uk/64742d27c097da2c25a352861f3f7360e7a74487/596_263_360_360/140.jpg","Short-biog":"\"Rania did everything fast, as if she knew she was leaving life early\"","Long-biog":"When Rania Ibrahim was born in March 1986 into a large family from Aswan in southern Egypt, her mother felt momentarily disappointed: yet another girl, the fifth of five daughters. But the bonds of sisterhood proved strong over the years – strong enough to change lives.\r\n\r\n\r\nIbrahim turned into a tomboy, loving her time in the scouts, when she would get to ride her bike in the mountains with other children. She enjoyed school, particularly maths, English and IT. She discovered an unshakeable Islamic faith at an early age and wanted to be a lawyer. But life intervened.\r\n\r\n\r\nHer oldest sister, Sayeda, who was present at her birth and helped raise her, had moved to London. She had cancer, was without a husband and had four children aged under 10. In 2009, Rania moved to Britain to help her.\r\n\r\n\r\n“She came to live with me and made me feel so safe,” Sayeda told the Grenfell inquiry.\r\n\r\n\r\nIbrahim met her future husband in the UK and they had two daughters, Fethia and Hania.\r\n\r\n\r\nHer sister, Rasha, said: “Rania did everything so fast, it’s as though she knew she was leaving life early. She loved making food and sharing it with her neighbours. She loved life.”\r\n\r\n\r\nIbrahim was a respected member of the local Muslim community and committed to her faith. “She was the perfect example of a Muslim woman living in a non-Muslim country,” her sister said. “She was elegant, and cared for herself – and for other people.” \r\n\r\n\r\nShe is most remembered by her family for her boundless positivity and sense of humour. “We loved to eat together, but it was always combined with a laugh,” her sister recalled. “We used to do crazy things together. I remember she was making pizza when I was with her once, and I got some flour and threw it on her. She was angry at first, but then she threw it at me – and then we ended up throwing it on everybody, including her kids. Our mother screamed at us!”\r\n\r\n\r\nIbrahim enjoyed documenting her life in London on social media, livestreaming family outings and funny moments. “She loved taking videos – lots of them,” her sister said. In the final video she posted, Ibrahim captured the view from her apartment window as she prayed. \r\n\r\n\r\nHer sister watched the fire that caused her sibling’s death from Cairo. “She called me and she was calm. She insisted she was OK. But then I saw the livestream on TV, and I knew she wouldn’t make it,” her sister said.\r\n\r\n\r\nRasha Ibrahim said her sister had a dream about the tower a month before the fire: “She dreamt that her parents were on different levels of the building. She heard them asking her to go to a higher floor. She believed this meant she will be in a higher place in heaven. Then she laughed.”","Credit":"Ruth Michaelson and Adham Youssef"},{"Name":"Hania Hassan","Floor":"23","Age":"Three","Nationality":"British","Pic-url":"https://media.guim.co.uk/8a3311e21ab3682b92b66b8bbf566b5e24e42c96/0_0_500_500/140.jpg","Short-biog":"\"Our little duck, she liked to draw and play with colours\"","Long-biog":"Hania Hassan was one of the youngest victims of the Grenfell Tower fire. A chubby-faced smiling child in pictures, the three-year-old was frequently shown hugging her five-year-old sister, Fethia. The sisters and their mother, Rania Ibrahim, died on the 23rd floor. It took months for the girls’ remains to be identified. \r\n\r\n\r\n“Hania was like me and her mother – she liked food,” says Rasha Ibrahim, her aunt, who likened Hania to a ‘little duck’ – one who babbled, but spoke little. “She liked to draw, and to play with colours.”\r\n\r\n\r\nRasha Ibrahim says her niece enjoyed meals of pizzas and burgers as much as traditional Egyptian food such as fesikh, a fermented fish dish. “The October before she died, they threw Hania a big birthday party,” she says. “Everyone was so happy. They made tons of food.” \r\n\r\n\r\nThe family is originally from Aswan in southern Egypt. Rania Ibrahim relocated first to Cairo then to London in 2009. Hania’s father, Hassan Hassan, was in Cairo owing to his brother’s ill health when he watched footage his wife posted online showing that the tower had caught fire. \r\n\r\n\r\nHania’s mother had disliked the family home on the 23rd floor of the Grenfell tower from the start, according to her sister. “She didn’t like staying there,” she says. “Before the family lived there, they had a temporary residence in a flat at the mosque. Rania went every couple of days to put some furniture in their Grenfell flat, but it took her ages to finish it.” \r\n\r\n\r\nRasha Ibrahim believes her sister was reticent to finish decorating the flat because she felt something bad would happen there, “as if she sensed the danger”. \r\n\r\n\r\nAs the building burned on 14 June, the two girls panicked while their mother welcomed anxious neighbours into their apartment, and Hania’s family in Cairo watched the fire that led to her death via a live-stream. \r\n\r\n\r\n\"What’s painful for me is that we talked on the day of the fire,” says Hania’s aunt. \"We laughed, and joked. Who would have known that it was the last time?”","Credit":"Ruth Michaelson and Adham Youssef"},{"Name":"Fethia Hassan","Floor":"23","Age":"Five","Nationality":"British","Pic-url":"https://media.guim.co.uk/78edd911d46d528ba211b1b60e9807e00038aca1/0_0_500_500/140.jpg","Short-biog":"\"In kindergarten, Fethia was like a mother to her classmates\"","Long-biog":"Fethia Hassan lost her life in the Grenfell Tower fire, aged just five. She was the daughter of Rania Ibrahim, whose footage of the burning tower, posted online, alerted many to the deadly blaze. \r\n\r\n\r\nFethia was born in 2012 to Ibrahim and Hassan Hassan, a Sudanese-British national who was in Cairo because of his brother’s ill health at the time of the fire. “She had been sad in the last six months as her father was away,” says Fethia’s aunt Rasha Ibrahim. She said that her niece told her repeatedly that there were lots of things she wanted to tell her father. \r\n\r\n\r\nFethia was a soft-spoken but sociable child, and had a close relationship with her younger sister, Hania, three, and her cousin Moaz. \r\n\r\n\r\n“In kindergarten, Fethia was like a mother to her classmates,” her aunt says. “She was a leading character. She would care for her classmates, making sure they ate and stayed calm while away from their families during the day. She liked other children.”\r\n\r\n\r\nPerhaps because of her warm relationships with the other children at Goldborne and Maxilla children’s centre in west London, Fethia wanted to be a teacher when she grew up. \r\n\r\n\r\n“She used to joke with me, and tell me: ‘Auntie, sharing is caring!’ I wouldn’t understand what she’d said, as it was in English,” says Rasha Ibrahim, speaking in Arabic. “I would look to Rania to translate, and then we’d all laugh.” \r\n\r\n\r\nFethia’s family had moved to Grenfell Tower just over a year before the fire, after ricocheting between different forms of social housing including a short stay in a flat at a mosque. She would later be memorialised at the al-Manaar mosque in west London where a funeral for her, her sister and her mother was held last September.","Credit":"Ruth Michaelson and Adham Youssef"},{"Name":"Khadija Khalloufi","Floor":"17","Age":"52","Nationality":"Moroccan","Pic-url":"https://media.guim.co.uk/ef3c585932763127a2dd613097b5251c4bb23707/17_33_389_389/140.jpg","Short-biog":"An upbeat soul, quick to laugh and easy to befriend","Long-biog":"Khadija Khalloufi was a Moroccan national who lived on the 17th floor of Grenfell Tower with her husband, Sabah Abdullah. They met nearly 30 years ago in west London when Khalloufi was a student in a business studies class taught by Abdullah, a lecturer.\r\n\r\n\r\nA clearly bereft Abdullah, who survived the fire but lost contact with his wife during a terrifying exit from the building, described Khalloufi as a friendly, upbeat soul, quick to laugh and easy to befriend. \r\n\r\n\r\nKhalloufi, who is also survived by a stepson, was returned to her native Morocco for burial. The family did not wish to say more about her life.","Credit":"Guardian staff"},{"Name":"Omar Belkadi","Floor":"20","Age":"32","Nationality":"British-Moroccan","Pic-url":"https://media.guim.co.uk/c92bf48daaea17525c941403d880d76801596564/0_0_500_500/140.jpg","Short-biog":"His final journey was back to Morocco, where he was buried","Long-biog":"Omar Belkadi died in the Grenfell Tower fire along with his wife, Farah Hamdan, and two of their daughters, Leena and Malak. One daughter, Tasnim, five at the time, survived.\r\n\r\n\r\nThe family lived on the 20th floor of the tower. A British-Moroccan citizen, Belkadi, who was 32 when he died, was buried in Morocco, in the town of Larache. Little more is known of him. His family did not wish to speak further about his life.","Credit":"Haroon Siddique"},{"Name":"Farah Hamdan","Floor":"20","Age":"31","Nationality":"British-Moroccan","Pic-url":"https://media.guim.co.uk/2473628a9d80b6165383db839b2a0f0287c77aa8/0_0_500_500/140.jpg","Short-biog":"Quiet, confident and happy to give and take a joke","Long-biog":"Farah Hamdan lived on the 20th floor of Grenfell Tower with her husband, Omar Belkadi, and three daughters, two of whom, Leena and Malak, died in the fire.\r\n\r\n\r\nHamdan, who was British, born and raised in north Kensington, and of Moroccan descent, had worked at a nursery in Queen’s Park, north-west London, where she was described as an easygoing colleague: quiet, confident and happy to give and take a joke.\r\n\r\n\r\nLittle more is known about her life. A family member said they were still too grief-stricken to speak about their loss. Her daughter Tasnim, who was five at the time of the fire, was the only family member to survive.","Credit":"Guardian staff"},{"Name":"Leena Belkadi","Floor":"20","Age":"Six months","Nationality":"British","Pic-url":"https://media.guim.co.uk/e586625935a93292830d8eade71b3bb680984190/0_0_500_500/140.jpg","Short-biog":"Aged six months, Leena was one of the youngest victims of the fire","Long-biog":"Leena Belkadi was one of the youngest victims of the Grenfell Tower fire, aged six months to the day when she died.\r\n\r\n\r\nShe had two older sisters, Malak, eight, who also died, and Tasnim, five at the time, who survived. Her parents, Farah Hamdan and Omar Belkadi, were killed in the blaze. \r\n\r\n\r\nThe family did not wish to say more about their loss.","Credit":"Guardian staff"},{"Name":"Malak Belkadi","Floor":"20","Age":"Eight","Nationality":"British","Pic-url":"https://media.guim.co.uk/bc66fa843cac7b5d593ab6be42536199c5d4b271/0_0_500_500/140.jpg","Short-biog":"The eldest of three daughters from a loving Moroccan family","Long-biog":"Malak Belkadi, eight, was the eldest of three daughters of Farah Hamdan and Omar Belkadi. She was taken to hospital on the night of the Grenfell Tower fire, but died of smoke inhalation two days later.\r\n\r\n\r\nThe family lived on the 20th floor. Malak’s baby sister, Leena, also died. Her sister Tasnim, five at the time, was the only family member to survive.\r\n\r\n\r\nLittle more is known about Malak’s life. A family member said they were still too grief-stricken to speak about their loss.","Credit":"Guardian staff"},{"Name":"Mary Mendy","Floor":"20","Age":"52","Nationality":"The Gambia","Pic-url":"https://media.guim.co.uk/9e88b3cda7b4c831748e3cddc24597de097a5570/357_165_168_168/140.jpg","Short-biog":"“A wonderful sister and the best mother any child could have wished for”","Long-biog":"Mary Mendy was born in the Gambia in the mid-1960s when it was newly independent, but her future lay 2,500 miles to the north.\r\nShe came to the UK as a young woman in the late 1970s, joining family who had already made the move, and completed her studies before taking up a number of different jobs, working in the care sector. \r\nShe moved away from London for a period after her marriage and the birth of her only child, Khadija Saye. But about 10 years ago she and her daughter moved into Grenfell Tower after securing an apartment on the 20th floor, where they both died last June.\r\n“Mary was a wonderful lady,” says her cousin Clarrie Mendy. “She had many jobs: she worked with underprivileged people, she was a person of the church, she was a carer.”\r\nHer niece, Marion Telfer, who was raised by Mendy and lived in the tower with her for a number of years, told the Grenfell Tower inquiry that her aunt had been an irreplaceable mother figure in her life.\r\n“My aunt was my hero, she has been in my life for every major event,” Telfer said.\r\nIn a separate statement her family said: “You were a wonderful sister, an incredible aunt, the best mother any child could have wished for.\r\n“You were an amazing friend to all those who knew you. Your heart was pure, your soul was one of a kind. You will be missed for a lifetime. You will remain forever in our hearts; you and your beautiful daughter, Khadija Saye.”\r\nTelfer made the following statement at the public inquiry:\r\n“For the first time in my life my aunt is not a phone call away. She’s not there to listen to my complaints or my gossip. My aunt made me a priority in life. She was the best aunt and sister we could have asked for. She was warm and kind. She welcomed everyone into her home.\r\n“Grenfell Tower was a place all her family and friends could find shelter if they ever needed it. Mary Mendy was a carer who worked within her community. She was a humanitarian who made it a passion to help those less fortunate than herself. She frequently travelled to Gambia and offered donations to hospitals and other organisations. On the night of 14 June 2017 our family lost two much-loved members. My aunt was the strong one, the fighter and the protector. The pain is unbearable. There are no words to describe the emptiness that it is in our hearts.\r\n“I hate night-times because night brings silence and silence brings tears of silence because that is when I start to remember the blaze of fire.\r\n“There will be two empty chairs on the table for every birthday, Christmas and New Year, but they will forever own a position in our hearts. We will carry their memories throughout our lives, our children’s and our children’s children’s. Although the pain feels like forever, it will soon be replaced by happiness. All of the tears will be replaced by memories of joy. Until we meet again.”","Credit":"Guardian staff"},{"Name":"Deborah Lamprell","Floor":"16","Age":"45","Nationality":"British","Pic-url":"https://media.guim.co.uk/a687d6c956a2dda7dc63454aa35fffd154d4ce80/0_0_500_500/140.jpg","Short-biog":"\"She knew everyone; all the singers knew her, all the orchestra knew her\"","Long-biog":"Deborah Lamprell nearly always arrived early for her job as part of the front-of-house team at Opera Holland Park. “I’d come past around 4.30pm or 4.45pm, and Debbie was always the first person I saw every day – even though her start time was 5.30pm,” said Michael Volpe, OHP’s general director.\r\n\r\n\r\n“She knew everyone; all the singers knew her, all the orchestra knew her. Everyone loved her because she was so chirpy, and she remembered things. She’d ask after someone’s mum, or their children.”\r\n\r\n\r\nLamprell, 45, was brought up in north-east London and took ballet and tap dancing lessons as a child. In a statement, her mother, Miriam, told the Grenfell inquiry that Lamprell was a big Tottenham Hotspur fan and loved watching the team with her father, Reg, who was a painter and decorator. “She was his treasure and she felt the same about him,” said Miriam. They also liked going blackberry picking together.\r\n\r\n\r\n“She really loved her work; she was really happy with her life,” her mother said. “You rarely saw my Debbie without a smile. People took to Debbie because she was a friendly, easy person.”\r\n\r\n\r\nLamprell lived alone on the 16th floor of Grenfell Tower. She had previously worked at various embassies and at Kensington police station.\r\n\r\n\r\nVolpe said: “Debbie knew nothing about opera when she joined us, but she grew to absolutely love it. She must have listened to hundreds of performances in her time here. She used to sit on a particular bench, from which you can see the stage and watch the show.\r\n\r\n\r\n“In her role she met a kaleidoscope of people, but she was exactly the same with everyone. She didn’t adapt herself to fit in with others. A lot of people who come and work for us are at drama college or training to be singers, but others are just local working-class people, and Debbie was one of those.”\r\n\r\n\r\nLamprell was very close to her mother, said Volpe. “She rang her every day, saw her lots and texted her after work. Her father died a few years ago, and Debbie was an only child, so she looked after her mum.”\r\n\r\n\r\nOn the night of the fire, Lamprell reportedly texted Miriam at about 11.30pm to say she had got home safely. She was identified by dental records after her remains were found on the 23rd floor. \r\n\r\n\r\nHer funeral was attended by former school friends, said Volpe. “Debbie was still close to people she grew up with; they’d stayed friends. She was just an incredibly nice person.”","Credit":"Harriet Sherwood"},{"Name":"Ali Yawar Jafari","Floor":"10","Age":"82","Nationality":"Afghan","Pic-url":"https://media.guim.co.uk/b8d5aff3ac0d9b845b02de95bf6356f88f149adc/0_471_2478_2477/140.jpg","Short-biog":"\"He always told us to enjoy life because it was short, to travel the world\"","Long-biog":"“He always told us to enjoy life because it was short,” recalled his son Hamid Ali Jafari. “He told us to travel the world and see everything.","Credit":"Amelia Hill"},{"Name":"Vincent Chiejina","Floor":"18","Age":"60","Nationality":"Unknown","Pic-url":"https://media.guim.co.uk/fd7cb8df5ec1b7fb81413cb3b3c929b13c57fdcf/423_0_1049_1049/140.jpg","Short-biog":"\"Vincent loved the church and its diverse community\"","Long-biog":"Vincent Chiejina was described as a gentlemen by those who knew him at the west London Catholic church where he was a regular worshipper. \r\n\r\n\r\nFrom a family thought to have been from Nigeria, the 60-year-old attended mass every week at St Francis of Assisi Roman Catholic church in Notting Hill, often taking the collection.\r\n\r\n\r\nHis family declined to say more about him, telling the Guardian: “Vincent loved this church and its diverse community and was an active member of the congregation for over 25 years. He is deeply missed.”","Credit":""},{"Name":"Gary Maunders","Floor":"Non-resident","Age":"57","Nationality":"British","Pic-url":"https://media.guim.co.uk/f19c5000ef28e9995e2caee70102a98425f5ed02/0_0_500_500/140.jpg","Short-biog":"\"You couldn’t be sad around him. If you were he’d make you laugh\"","Long-biog":"Gary Maunders, a painter-decorator from west London, was a father of four who relished the limelight. “He could talk,” Tammy Maunders recalls of her older brother. “He had so many stories to tell.”\r\n\r\n\r\nMaunders, 57, did not leave home until he was in his early 40s, playing a very active role in the early lives of his two nieces, Channel and Kenita Spence, who were brought up in the family home.\r\n\r\n\r\n“He was fun to be around – a real Peter Pan,” says Channel, recalling his fondness for Marvin Gaye and Manchester United. She remembers how he would take her out to the football pitch outside their house and pass on a few tips.\r\n\r\n\r\n“We grew up around him,” Channel says. “He had a heart of gold. He was the life and soul – when he entered a room he was the centre of attention.”\r\n\r\n\r\n“You couldn’t be sad around him. And if you were he’d make you laugh,” Kenita adds.\r\n\r\n\r\nMaunders was one of the few Grenfell victims who did not live in the tower; he was visiting a friend on the night of the fire, and died on the 23rd floor. But he was as rooted in the area as anyone and, apart from a few family holidays in Spain and Mexico, spent his entire life in and around the North Kensington area.\r\n\r\n\r\nIn his latter years, he liked to pass on words of wisdom to the younger generation. “He was old school,” says Channel. “He loved to pass on his knowledge.\r\n\r\n\r\n“He was a massive part of our lives. We feel his absence. He is so missed.” \r\n\r\n\r\nChannel Spence writes:\r\n\r\n\r\nGary Maunders was extremely family-oriented; he loved his kids and mother dearly and was very fond of his nieces and nephews. Not a day passed where he wouldn't talk to his mother or kids. Every evening he'd call to ask how their day had been and if they were okay.\r\n\r\n\r\nGary had a big heart. He would help anybody in need and was very giving. He was an old-school gentleman: caring, respectful, knowledgeable, charming and witty. He would always say \"good morning\" to the older generation and offer to help them with their shopping trolleys or bags.\r\n\r\n\r\nAs a young boy, Gary had the potential to become a professional footballer, after he got scouted by Arsenal. He wouldn’t fail to mention this nearly every time a match was on. But funnily enough, he later became a huge Manchester United supporter. He always said he never fulfilled his dream to be a footballer because of \"being young and chasing the women\", as he put it, and he became a painter and decorator instead.\r\n\r\n\r\nThis regret of his became a lesson for the children within the family, as he would forever try to encourage them not to go down the same path as he did. “Be good and stay in school,\" he always told them.","Credit":"Mark Rice-Oxley"},{"Name":"Abdeslam Sebbar","Floor":"11","Age":"77","Nationality":"Moroccan","Pic-url":"https://media.guim.co.uk/fd7cb8df5ec1b7fb81413cb3b3c929b13c57fdcf/423_0_1049_1049/140.jpg","Short-biog":"Part of west London’s sizeable Moroccan community","Long-biog":"Abdeslam Sebbar was among the oldest victims of the fire and one of 11 people with Moroccan connections who died in Grenfell Tower.\r\n\r\n\r\nSebbar lived in a flat on the 11th floor, but little more is known about his life and attempts to contact people who knew him were unsuccessful.","Credit":"Guardian staff"},{"Name":"Anthony Disson","Floor":"22","Age":"65","Nationality":"British","Pic-url":"https://media.guim.co.uk/761a5cfe2f98f361396bf6e8eab4949653159a4a/0_0_399_399/140.jpg","Short-biog":"Dapper sports fan and great-grandfather who was always the life of the party","Long-biog":"When Lee Disson remembers his father, he recalls a smartly dressed man stepping into a Jaguar, or perhaps a Triumph Stag, invariably on his way to a football match, boxing contest or perhaps a party.\r\n\r\n\r\nFootball, boxing, family, children: Tony Disson was west London through and through. Sociable, well-known and with a touch of the lovable rogue about him, Disson was born in Kensington and raised two families in west London. For the final 10 years of his life, he lived in a small apartment at the top of Grenfell Tower.\r\n\r\n\r\nA great-grandfather by the time he died at 65, Disson had worked as a refuse collector for the council, and latterly in car-breaking and scrap metal. But it is clear from speaking to those who knew him that he worked to live; and life was his beloved Fulham football club, the horses that he stabled under the Westway flyover, his four sons, and his social life.\r\n\r\n\r\n“He was a party man, definitely a party man,” Lee recalls. But he was also a good father, he adds. “I had a very happy childhood.”\r\n\r\n\r\nDisson would ferry his lads from one sporting event to another. He ran junior football teams and was a driving force behind a local boxing club that was set up in the basement of Grenfell Tower. \r\n\r\n\r\n“He took us all boxing,” recalls Lee, Tony’s eldest son, who admits he had little ability. Lee’s half-brothers, born to Disson’s second wife, Cordelia, were much more enthusiastic, and their father would take them all over the country to fight.\r\n\r\n\r\n“He was a funny person to be around,” said Charlie Disson. “Every morning before training, he would make me a fry-up. We'd have a joke and a laugh. The gym was at the bottom of the block. He'd start cleaning the gym while I'd train.\r\n\r\n\r\n“He wasn't the richest man in the world, but he was rich with love.”\r\n\r\n\r\nThere were joyous family holidays to the Isle of Sheppey, but also the sadness that comes with family breakdown. Tony left his first wife, Lee’s mother, when Lee was about 10. He remarried on new year’s eve in 1987, but he and his second wife separated about 10 years ago, although they stayed in touch.\r\n\r\n\r\n“He was a good dad, he loved his kids,” said Cordelia Disson. “He was a big part of our lives and always will be.” \r\n\r\n\r\nTony moved into a council flat on the 22nd floor of Grenfell Tower. By then, he had osteochondromas, a bone condition that also affects Lee.\r\n\r\n\r\n“We were more like friends through my teenage years,” says Lee. “When he moved into Grenfell, I bought him his first double bed.”\r\n\r\n\r\nAccording to Lee, his father was up late on the night of the fire, returning to the building after midnight. If he had stayed away for another half an hour, he might have survived.\r\n\r\n\r\nIn a statement, the family said: \"Tony was the most generous person you could ever meet. He didn't have much but would always be there to help people. He had a great sense of humour, especially in the face of the practical jokes the boys would play on him.”\r\n\r\n\r\nHe is survived by Cordelia, four sons, six grandchildren and three great-grandchildren.","Credit":"Mark Rice-Oxley"},{"Name":"Victoria King","Floor":"20","Age":"71","Nationality":"British","Pic-url":"https://media.guim.co.uk/bb319d460492df4331e9475daaf70e26f9e6891f/0_0_500_500/140.png","Short-biog":"\"She and Alexandra were devoted to one another\"","Long-biog":"Victoria King was one of the last victims of the fire to be identified, a long-term Grenfell Tower resident who lived on the 20th floor with her daughter, Alexandra Atala. \r\n\r\n\r\nLittle more is known about her life. At the Grenfell inquiry, her sister said only that the family had for years lost touch with ‘Vicky’ and only got back in contact her again relatively recently. “No one knew they were still living there,” her elder sister said in a statement to the inquiry.\r\n\r\n\r\nThe family issued the following statement after the 71-year-old’s remains were identified in November: \"Some comfort can come from the knowledge that she and Alexandra were devoted to one another and spent so many mutually supportive years together. They died at each other's side and now they can rest together in peace.\r\n\r\n\r\n\"We will remember them always.\"","Credit":"Guardian staff"},{"Name":"Alexandra Atala","Floor":"20","Age":"40","Nationality":"British","Pic-url":"https://media.guim.co.uk/b649ce288f0a9bbeab945b2c8ce54515d5db8133/0_0_500_500/140.jpg","Short-biog":"\"She and her mum died at each other's side. Now they can rest together in peace\"","Long-biog":"Alexandra Atala was one of the last victims to be identified, a long-term Grenfell Tower resident who lived on the 20th floor with her mother, Victoria King. \r\n\r\n\r\nLittle more is known about her life. Her family could not be contacted for more information. They issued the following statement after the 40-year-old’s remains were identified in November: \r\n\r\n\r\n\"Some comfort can come from the knowledge that (mother and daughter) were devoted to one another and spent so many mutually-supportive years together. They died at each other's side and now they can rest together in peace.\r\n\r\n\r\n\"We will remember them always.\"","Credit":"Guardian staff"},{"Name":"Maria del Pilar Burton","Floor":"19","Age":"74","Nationality":"Spanish","Pic-url":"https://media.guim.co.uk/25bb97a29207f24070bfedb567417145217d0e81/0_0_396_396/140.jpg","Short-biog":"“She was a real character – flamboyant, colourful, passionate and friendly”","Long-biog":"Maria del Pilar Burton, known as Pily, shared a 19th-floor apartment with her husband, Nick, to whom she had been married for 34 years. They were rescued on the night of the fire, but Pily, who suffered from previous health complications, remained in hospital for months and died on 29 January.\r\n\r\n\r\nShe was finally recognised as the 72nd victim of the fire on the eve of the public inquiry. \r\n\r\nHer husband asked for his privacy to be respected, but wrote in a statement: “Pily was well known in our community, she was what people call a real character. A character in the best sense of the word – she was flamboyant, colourful, passionate and friendly.  \r\n\r\n\r\n“Everyone on Portobello Road knew her and when we went to the market on the weekend she would stop and chat all the way along. She had such a big heart. We were together for 34 years. She was the love of my life.”","Credit":"Guardian staff"}]