[{"Name":"Ali Yawar Jafari","Floor":"10","Age":"82","Nationality":"Afghanistan","Pic-url":"https://media.guim.co.uk/b8d5aff3ac0d9b845b02de95bf6356f88f149adc/0_471_2478_2477/140.jpg","Short-biog":"\"He always told us to enjoy life because it was short, to travel the world\"","Long-biog":"Ali Yawar Jafari used to say that life was short. \r\n\r\n\r\n“He always told us to enjoy life because it was short,” recalls his son, Hamid Ali Jafari. “He told us to travel the world and see everything.\r\n\r\n\r\n“He was a loving man. He used to love all the people around him: it didn’t matter if they weren’t family. He always told us to respect everyone. To do the right thing.”\r\n\r\n\r\nJafari began his working life as a jeweller in Afghanistan. He worked with precious stones and made rings and necklaces. “It was the family tradition,” says Hamid.\r\n\r\n\r\nWhen Jafari came to the UK in 1999 he was 61 and he struggled to learn English. He would spend his days instead in his friend's Afghan shop in Portobello market, talking about the old days and charming customers with his offers of tea in gentle, broken English. After lunch, his friend would take him home.\r\n \r\nHis eight grandchildren were the other focus of his life. “He spent hours playing cars with my three-year-old son,” says Hamid. “He would make all the noises of the different vehicles, all the emergency ones, and trains. He’d do it for as long as my son wanted – and that could be hours.”\r\n \r\nAn early riser, Jafari happily looked after his grandson if he woke before the boy’s parents.  “He would give him breakfast and talk to him until we woke up,” his son says.\r\n\r\n\r\n“My son is still asking after his grandfather. At the beginning, we told him his grandfather was away but now we’ve told him the truth. Now when he sees photos of his grandfather, he says: ‘Fire, fire. Bad fire.’ It breaks my heart.”","Credit":"Amelia Hill"},{"Name":"Marjorie Vital","Floor":"16","Age":"68","Nationality":"Dominica","Pic-url":"https://media.guim.co.uk/2d45f4c48fb4093c36539d0b52060cc109fa6d6b/583_130_873_873/140.jpg","Short-biog":"","Long-biog":"","Credit":""},{"Name":"Rania Ibrahim","Floor":"23","Age":"30","Nationality":"Egypt","Pic-url":"https://media.guim.co.uk/64742d27c097da2c25a352861f3f7360e7a74487/596_263_360_360/140.jpg","Short-biog":"\"Rania did everything fast, as if she knew she was leaving life early\"","Long-biog":"Originally from Aswan in southern Egypt, Rania Ibrahim was the youngest of five girls. She settled in the UK in 2009 after meeting her husband, Hassan, and they had two daughters.\r\n\r\n\r\n“Rania did everything so fast, it’s as though she knew she was leaving life early,” says her sister Rasha Ibrahim. “She loved making food and sharing it with her neighbours. She loved life.”\r\n\r\n\r\nA former law student with a fondness for swimming and horse riding, the 30-year-old was a respected member of the local Muslim community who was committed to her faith. “She was the perfect example of a Muslim woman living in a non-Muslim country,” her sister says. “She was elegant, and cared for herself – and for other people.” \r\n\r\n\r\nIbrahim is most remembered by her family for her boundless positivity and sense of humour. “We loved to eat together, but it was always combined with a laugh,” her sister recalls. “We used to do crazy things together. I remember she was making pizza when I was with her once, and I got some flour and threw it on her. She was angry at first, but then she threw it at me – and then we ended up throwing it on everybody, including her kids. Our mother screamed at us!”\r\n\r\n\r\nIbrahim enjoyed documenting her life in London on social media, livestreaming family outings and funny moments. “She loved taking videos – lots of them,” her sister says. In the final video she posted, Ibrahim captured the view from her apartment window as she prayed. \r\n\r\n\r\nHer sister watched the fire that caused her sibling’s death via a live stream in Cairo. “She called me, and she was calm. She insisted she was OK,” she says. “But then I saw the live stream on TV, and I knew she wouldn’t make it.”\r\n\r\n\r\nRasha Ibrahim says her sister had a dream about the tower a month before the fire: “She dreamt that her parents were on different levels of the building. She heard them asking her to go to a higher floor. She believed this meant she will be in a higher place in heaven. Then she laughed.”","Credit":"Ruth Michaelson and Adham Youssef"},{"NB":"Times says “Amaya lived with her mother, Amal Ahmedin, 35, and father, Mo Tuccu, 44, on the 19th floor.” - not clear this is correct","JW":"“Mo was loved very much and will be greatly missed. I only knew Mo for two short years at Red but he had a way of making you feel like an old friend - welcome and at ease. I always enjoyed talking to him about his young daughter, who he said was growing up fast and becoming a cheeky “chatterbox” who he loved very much. I also enjoyed hearing about his various side projects on the go. Mo was a man of many talents, from serving up the finest Eritrean style coffee to being a crafty DIY-er. Word has it he was the fastest house-painter in all of London!","https":"//twitter.com/redprnews/status/878520132674441216"},{"Name":"Amna Mahmud Idris","Floor":"19","Age":"27","Nationality":"Eritrea","Pic-url":"","Short-biog":"","Long-biog":"","Credit":"Guardian staff"},{"Name":"Berkti Haftom","Floor":"18","Age":"29","Nationality":"Eritrea","Pic-url":"https://media.guim.co.uk/609a87d61b19d1ea62cd7c1d1a0437c842037668/1239_6_1094_1094/140.jpg","Short-biog":"\"She was the life and soul, she used to crack us up\"","Long-biog":"Berkti Haftom is remembered by those who knew her for her vivid, upbeat approach to life and dedicated parenting of her 12-year-old son, Biruk. Born and brought up in Eritrea, she lived in Italy before settling in London, but over the past decade had put down deep roots in North Kensington.\r\nStill a teenager when she became a mother, as a single parent she took a strong interest in her son’s education and was well regarded by his teachers. Paul Enright, who taught Biruk in primary school, says she closely tracked his academic progress and arranged after-school tutoring. Colleagues at the cafe in Holland Park where she worked part-time, serving food, drinks and ice-creams, remember her talking about her son all the time.\r\nAdegboyega Phillips, her manager there until she left for another job in 2016, says his concerns about gaps in her English when he interviewed her evaporated when she worked a trial shift. “She made it work for herself basically,” he says, her warmth and liveliness more than making up for any lapses in grammar. “She was the life and soul, she used to crack us up a lot.”  \r\nAs well as a sister in London, she had a group of close female friends, and Biruk’s father was still in touch. She belonged to an Eritrean Orthodox Christian church. She had a vulnerable side, and Phillips says she used to cry easily when colleagues were especially kind to her.\r\nParticular about her appearance, she worked out at the gym, and was fond of wearing bright colours, high heels and painted nails. In photographs with Biruk, their closeness is clear. They were lovely people, says Enright, combining good humour with a palpable sense of purpose.","Credit":"Susanna Rustin"},{"Name":"Hashim Kedir","Floor":"22","Age":"44","Nationality":"","Pic-url":"https://media.guim.co.uk/fd7cb8df5ec1b7fb81413cb3b3c929b13c57fdcf/423_0_1049_1049/140.jpg","Short-biog":"\"I was known as the sister of the smartest boy in our school\"","Long-biog":"The things Hashim Kedir’s sister will remember most about him are the diversity of his friends, his smile, and his generosity. The 44-year-old taxi driver lived with his wife and three children on the 22nd floor of Grenfell Tower.\r\n\r\n\r\n“I used to be known as ‘Hashim’s sister’ – the sister of the smartest boy in our school,” says Assema Kedir. “It started in year 1 and followed me to university; Hashim’s sister ... I was proud but it was not always fun since most of the teachers expected the same from me!”\r\n\r\n\r\nIn a statement released after his death, Assema said Kedir was the person in the family people turned to if they were struggling and needed help: “You were the one I used to call when I had a problem that I couldn’t solve. You were the one I used to call when I had something good to tell. I don’t know what I am going to do without you.”\r\n\r\n\r\nNeighbours and friends described the taxi driver as a quiet but popular figure on the streets around the west London tower block, who made friends easily with people from all kinds of backgrounds and religions.\r\n\r\n\r\nAssema says: “One can tell the kind of person you were from the diversity of people that are crying over your death.”\r\n\r\n\r\nHashim, whose family originates from Ethiopia, used to play five-a-side football every Friday evening. Sean Mendez, who runs a local group for children from deprived backgrounds and knew the family well, was one of those who played in the Friday night matches.\r\n\r\n\r\n“He was really respectful always, thanking me for looking after the kids. He was really hard working, he was driven to make sure he was looking after people: the family, his friends, his neighbours. He was a lovely guy.”","Credit":"Matthew Taylor"},{"Name":"Nura Jamal","Floor":"22","Age":"35","Nationality":"Ethiopia","Pic-url":"https://media.guim.co.uk/6e7134ed710ff10679798fb426695e055135d982/448_0_1016_1016/140.jpg","Short-biog":"\"She could befriend anyone, no matter who they were\"","Long-biog":"Nura Jamal was a ball of positive energy. Friends of the 35-year-old, who lived with her husband and three children on the 22nd floor of Grenfell Tower, say her joy was contagious and that simply being around her “could lighten up anyone’s day in a matter of seconds”.\r\n\r\n\r\nJamal was devoted to her three children, Firdaws, Yahya and Yaqub, and was often seen ferrying them to and from school as well as to various sports groups and clubs. Her sister-in-law Assema Kedir says: “She could befriend absolutely anyone, no matter who they were or what they believed in.”\r\n\r\n\r\nSean Mendez, who runs Solidarity Sports, a charity that runs a children’s activity group that Jamal’s children attended, agrees: “She used to drop the kids off and pick them up and she was lovely – always ready with a smile and asking how you were. She was always smiling.”\r\n\r\n\r\nDonato Nardizzi, who taught Jamal’s sons taekwondo, says she always wanted to know how they were getting on: “She didn’t just drop them off and say hi; she watched and wanted to know how they were doing, what they needed to work on. She was totally engaged in them as people and was a tremendous support and source of love for them.”\r\n\r\n\r\nBut for Kedir it was her sister-in-law’s faith that stood out above all else. “One thing that made you so special was your constant devotion to your religion and your trust in Allah,” she said in a statement after her death. “We were all taken aback by the way you used to think of Allah in every matter in this world. Islam was your passion and you wisely managed to communicate your wisdom to your children in a way that no other parent could.”","Credit":"Matthew Taylor"},{"Name":"Mary Mendy","Floor":"20","Age":"54","Nationality":"Gambia","Pic-url":"https://media.guim.co.uk/9e88b3cda7b4c831748e3cddc24597de097a5570/357_165_168_168/140.jpg","Short-biog":"","Long-biog":"","Credit":""}]