{"Name":"Sakineh Afrasiabi","Floor":"18","Age":"65","Nationality":"Iranian","Pic-url":"https://media.guim.co.uk/ff0a52ae969f10c298db359b3760ff8bcc7e74e7/33_55_764_763/140.jpg","Short-biog":"\"She helped a lot of refugees, she would shelter them in her flat\"","Long-biog":"Three months after Sakineh Afrasiabi moved to Grenfell Tower in 2016, she told her daughter that she wished she had a pair of binoculars. In a matter of days, Nazanin Aklani fulfilled her mother’s wish.\r\n\r\n\r\n“She had got used to her flat at the 18th floor,” Aklani says. “She used to say: ‘It’s as if I’m on a plane, I can see the whole of London from up here.’”\r\n\r\n\r\nThe 65-year-old lived high up in the tower despite being disabled, walking with the aid of a frame. She was rehoused in Grenfell last year; her requests for an accessible flat did not yield any results.\r\n\r\n\r\nAfrasiabi, who died along with her sister, Fatemeh, on the 23rd floor, apparently while seeking an escape route, had moved to the UK in 1997. She lived on the second floor of a property in Ladbroke Grove for 18 years before being rehoused in Grenfell. \r\n\r\n\r\n“She had a lovely heart,” Aklani says. “Anyone who had any problems would go to her. She helped a lot of refugees, she would shelter them in her flat, she would do things that people don’t do in this day and age. Everyone relied on her.”\r\n\r\n\r\nAfrasiabi came from Abadan in western Iran, close to Iraq. When the Iran-Iraq war broke out in early 1980s, the family fled to Shiraz in the south. She moved to the UK after separating from her husband, raising her five children – two sons and three daughters – alone.\r\n\r\n\r\nShe had requested to be rehoused in 2000 because her flat did not have a lift, but she never succeeded in securing more suitable accommodation. She had an earlier bid for a flat on the ground floor declined because “it was not step free”.\r\n\r\n\r\nAfrasiabi worked briefly for Punch and Judy nursery in Earl’s Court but could not continue because of her deteriorating health. \r\n\r\n\r\nAklani adds: “She spoke English, she had a lot of Iranian friends but also a lot of British and African friends, she had a lot of foreign friends. You’d go to her house and you’d see five to six people there all the time. She had grown to love Grenfell Tower. We had bought her new furniture and even installed a new kitchen. In her latter months, she was happy living there.”","Credit":"Saeed Kamali Dehghan"},{"Name":"Ali Yawar Jafari","Floor":"10","Age":"82","Nationality":"Afghan","Pic-url":"https://media.guim.co.uk/b8d5aff3ac0d9b845b02de95bf6356f88f149adc/0_471_2478_2477/140.jpg","Short-biog":"\"He always told us to enjoy life because it was short, to travel the world\"","Long-biog":"“He always told us to enjoy life because it was short,” recalls his son, Hamid Ali Jafari. “He told us to travel the world and see everything.\r\n\r\n\r\n“He was a loving man. He used to love all the people around him: it didn’t matter if they weren’t family. He always told us to respect everyone. To do the right thing.”\r\n\r\n\r\nAli Yawar Jafari began his working life as a jeweller in Afghanistan. He worked with precious stones and made rings and necklaces. “It was the family tradition,” says Hamid.\r\n\r\n\r\nWhen Jafari came to the UK in 1999 he was 61 and he struggled to learn English. He would spend his days instead in his friend's Afghan shop in Portobello market, talking about the old days and charming customers with his offers of tea in gentle, broken English. After lunch, his friend would take him home.\r\n \r\nHis eight grandchildren were the other focus of his life. “He spent hours playing cars with my three-year-old son,” says Hamid. “He would make all the noises of the different vehicles, all the emergency ones, and trains. He’d do it for as long as my son wanted – and that could be hours.”\r\n \r\nAn early riser, Jafari happily looked after his grandson if he woke before the boy’s parents.  “He would give him breakfast and talk to him until we woke up,” his son says.\r\n\r\n\r\n“My son is still asking after his grandfather. At the beginning, we told him his grandfather was away but now we’ve told him the truth. Now when he sees photos of his grandfather, he says: ‘Fire, fire. Bad fire.’ It breaks my heart.”","Credit":"Amelia Hill"},{"Name":"Faouzia El Wahabi","Floor":"21","Age":"42","Nationality":"Moroccan","Pic-url":"https://media.guim.co.uk/64c2b88bbc732d4f0ddb66b80dcaaef9beb20d1f/5_76_365_365/140.jpg","Short-biog":"\"You would always see her laughing and joking with her children\"","Long-biog":"A lively, friendly woman who sometimes appeared more like a sibling than a parent to her two older children is how relatives remember Faouzia El Wahabi. \r\n\r\n\r\nAn enthusiastic baker who was always trying out new cake recipes and cooking Moroccan food in her Grenfell Tower flat for relatives and friends, Faouzia, 42, was also a keen knitter. When she died, she was getting ready to teach a knitting and crochet class at the Westway Trust community centre, where she sold her handmade scarves and baby clothes, with the profits going back to the trust. \r\n\r\n\r\nUntil she married and moved to London aged 20 in 1995, Faouzia had lived in Larache, a coastal town in northern Morocco, with her parents and grandmother. She had known her future husband, Abdulaziz El Wahabi, and his family all her life. When the pair were reintroduced by older relatives after Abdulaziz told them of his wish to settle down, they fell in love.\r\n\r\n\r\nIn London, they moved in with her mother-in-law until they were offered a two-bedroom flat in Grenfell Tower when her first child, Yasin, was one. Yasin, his aunt remembers, was a difficult baby who childminders struggled with, and Faouzia’s early attempts at working outside the home in a school kitchen were given up in favour of full-time parenting.  \r\n\r\n\r\nYasin was followed by a daughter, Nur Huda, with whom Faouzia enjoyed following Moroccan dramas and soap operas on TV. Then there was a seven-year gap before Mehdi, the baby of the family, arrived.\r\n\r\n\r\n“You would always see her laughing and joking with her children, whenever you saw her out they would be with her,” says her sister-in-law and former neighbour, Hanan Wahabi. “That’s how she was with them, and every single one of them was a parent to Mehdi – it was a unique situation they had.” \r\n\r\n\r\n“There was a real sweetness to her, but beneath that there was a real desire to ensure her children got on,” says David Sellens, the headteacher at Thomas Jones school where two of the El Wahabis’ children were pupils.","Credit":"Susanna Rustin"},{"Name":"Yasin El Wahabi","Floor":"21","Age":"20","Nationality":"British","Pic-url":"https://media.guim.co.uk/e95f42ba0ee8b0feca49147d63639788240b8429/234_93_277_277/140.jpg","Short-biog":"The first in his family to go to university, he hoped one day to own a business","Long-biog":"A part-time accountancy student at Greenwich University who did delivery work to earn some extra money, Yasin El Wahabi hoped one day to run his own business, possibly a milkshake bar. \r\n\r\n\r\nBorn at St Mary’s hospital in Paddington and brought up in North Kensington, Yasin, who was 20 when he died in the Grenfell Tower fire, went to Thomas Jones primary, Holland Park secondary and then Richmond College before securing the grades he needed to study for a degree. Academic work was a struggle at times, making his relatives all the prouder of his success in becoming the first member of the family to go to university.\r\n\r\n\r\nDavid Sellens, his primary headteacher, says Yasin was a “very handsome fellow – fit, strong and sporty”. The school was in the process of being turned around when he was a pupil there and Yasin, says Sellens, was part of the cohort that helped make that transformation happen.\r\n\r\n\r\nA supportive figure in the lives of his younger cousins, Yasin was a sociable and popular character who would help neighbours with bags and open doors. He had trained as a football referee and officiated at adult and children’s games. He is remembered for his kindness as well as his humour and youthful grin.\r\n\r\n\r\nIn a statement, when he was formally identified, his family said: “Yasin was a loveable, bubbly and caring young man. He would lend his hand to anyone who asked for help. He was loved by so many and his contagious smile will always be etched on our minds and hearts.”\r\n\r\n\r\nHe lived with his parents, sharing a bedroom with his younger brother, on the 21st floor of Grenfell Tower. Some friends say that on the night of the fire, with residents scrambling to get out of the building, Yasin ran the other way - to get back up the stairs and help rescue his family.","Credit":"Susanna Rustin"},{"Name":"Mehdi El Wahabi","Floor":"21","Age":"Eight","Nationality":"British","Pic-url":"https://media.guim.co.uk/64c2b88bbc732d4f0ddb66b80dcaaef9beb20d1f/413_5_333_333/140.jpg","Short-biog":"\"Had he lived to adulthood he would have liked to be a comedian\"","Long-biog":"Just eight when he died and about to finish year three at Oxford Gardens primary school, within sight of his home in Grenfell Tower, the headteacher, Sarah Cooper, remembers Mehdi El Wahabi coming in dressed up as a caveman. “He had a wonderful sense of humour but was also very, very gentle. He would involve and reassure everybody,” she says.\r\n\r\n\r\nMehdi was the doted-on youngest child of his parents, Abdulaziz and Faouzia El Wahabi, and in the words of his aunt Hanan Wahabi, “definitely the baby of the family”. \r\n\r\n\r\nShe added: “Because he was the youngest he was cared for a lot, bless him. He wasn’t spoiled in the sense that he would get anything he wanted but they all mothered him.” In photographs he invariably wears a broad smile.\r\n\r\n\r\nThe landing outside his family’s 21st-floor flat was used as a play area by Mehdi, his nine-year-old cousin Sara Chebiouni, who lived several floors down, and the daughter of a neighbour. Inside the flat Mehdi enjoyed playing Minecraft and with Lego. He had small toys including Minions, Furbies and fidget spinners “arranged all over his desk so there was no more space, he was like a collector”, remembers Sara.\r\n\r\n\r\nHe liked ice-cream and curry, and kept a squishy red, white and blue rocket toy on his bed. Had he lived to adulthood, Sara says, he would have liked to be a comedian – though she says he had some work to do on his jokes.","Credit":"Susanna Rustin"},{"Name":"Nur Huda El Wahabi","Floor":"21","Age":"15","Nationality":"British","Pic-url":"https://media.guim.co.uk/72be02f5d52ed718df07a54db1537f03cb2c4cb6/264_41_244_244/140.jpg","Short-biog":"\"I can imagine her wanting a family of her own – she was very good with children\"","Long-biog":"In the middle of doing her GCSEs when she died, Nur Huda El Wahabi would have turned 16 two weeks later. At Holland Park school she had worked her way up to a higher stream and was full of ideas and initiative when it came to planning her future. \r\n\r\n\r\nHaving looked into teaching, her ambition was to be an occupational therapist, though she had yet to decide where to go for sixth form.\r\n\r\n\r\nLindsay Johnson, her nursery teacher, remembers a toothy smile, strong body and confident character. Her primary headteacher, David Sellens, says her “lovely, deep voice” made her a popular choice for poetry readings and he recalls her reciting Dover Beach by Matthew Arnold. Like the rest of her family, she had a sunny disposition. She was proud of what Sellens calls “exquisite handwriting”, and liked caring for plants.\r\n\r\n\r\nShe had a habit of rolling up her shirt sleeves and generally wore trousers, teachers say, and could be cheeky but was also charming so was not often in trouble. Outside school she had many friends, used the gym and played an active role in the lives of her younger brother, Mehdi, and her nine-year-old cousin Sara Chebiouni, taking them to the park and the swimming pool.\r\n\r\n\r\n“She would have made a success of whatever she did,” says Johnson. “There was a robustness to her, and I think her family would have continued to be an important part of her life. I can also imagine her wanting a family of her own – she used to help in the nursery and was very good with younger children. You wouldn’t want to mess with Nur Huda but she was also this lovely, gentle, nurturing child.”\r\n\r\n\r\nNur Huda will be immortalised by having a character named after her in Philip Pullman’s next novel, thanks to a successful bid by one of her teachers in a fundraising auction.","Credit":"Susanna Rustin"},{"Name":"Marjorie Vital","Floor":"16","Age":"68","Nationality":"Dominican","Pic-url":"https://media.guim.co.uk/2d45f4c48fb4093c36539d0b52060cc109fa6d6b/583_130_873_873/140.jpg","Short-biog":"“A joyful, kind, sensitive woman who dedicated her life to her children”","Long-biog":"Marjorie Vital, a textile worker and longtime Grenfell resident, was devoted to her two children, grandchildren, and adopted home.\r\n\r\n\r\nOriginally from Dominica, Vital came to Britain as a girl. She lived for more than 20 years in Grenfell Tower in her 16th-floor flat. Her son Ernie, who was staying with her on the night of the fire, also died.\r\n\r\n\r\nA family friend said her family was not willing to speak further about her life. In a statement, relatives said: \"Marjorie was 68 years old and she had worked in the textile industry for many years. She was a beautiful, joyful, independent, intelligent, kind hearted, sensitive individual who dedicated her life to her children. She carried herself with dignity and extended her warmth to family and friends.\r\n\r\n\r\n\"Through her creativity and joy of life she was an inspiration to many of us. She has been prematurely and dramatically taken from this world and will be sadly missed by family and friends, both here in the UK and abroad.\"\r\n\r\n\r\nAfter her death, her ashes were returned to her native Dominica.","Credit":"Staff"},{"Name":"Alexandra Atala","Floor":"20","Age":"40","Nationality":"British","Pic-url":"https://media.guim.co.uk/b649ce288f0a9bbeab945b2c8ce54515d5db8133/0_0_500_500/140.jpg","Short-biog":"\"She and her mum died at each other's side. Now they can rest together in peace\"","Long-biog":"Alexandra Atala was one of the last victims to be identified, a long-term Grenfell Tower resident who lived on the 20th floor with her mother, Victoria King. \r\n\r\n\r\nLittle more is known about her life. Her family could not be contacted for more information. They issued the following statement after the 40-year-old’s remains were identified in November: \r\n\r\n\r\n\"Some comfort can come from the knowledge that (mother and daughter) were devoted to one another and spent so many mutually-supportive years together. They died at each other's side and now they can rest together in peace.\r\n\r\n\r\n\"We will remember them always.\"","Credit":"Guardian staff"},{"Name":"Ali Yawar Jafari","Floor":"10","Age":"82","Nationality":"Afghan","Pic-url":"https://media.guim.co.uk/b8d5aff3ac0d9b845b02de95bf6356f88f149adc/0_471_2478_2477/140.jpg","Short-biog":"\"He always told us to enjoy life because it was short, to travel the world\"","Long-biog":"“He always told us to enjoy life because it was short,” recalls his son, Hamid Ali Jafari. “He told us to travel the world and see everything.\r\n\r\n\r\n“He was a loving man. He used to love all the people around him: it didn’t matter if they weren’t family. He always told us to respect everyone. To do the right thing.”\r\n\r\n\r\nAli Yawar Jafari began his working life as a jeweller in Afghanistan. He worked with precious stones and made rings and necklaces. “It was the family tradition,” says Hamid.\r\n\r\n\r\nWhen Jafari came to the UK in 1999 he was 61 and he struggled to learn English. He would spend his days instead in his friend's Afghan shop in Portobello market, talking about the old days and charming customers with his offers of tea in gentle, broken English. After lunch, his friend would take him home.\r\n \r\nHis eight grandchildren were the other focus of his life. “He spent hours playing cars with my three-year-old son,” says Hamid. “He would make all the noises of the different vehicles, all the emergency ones, and trains. He’d do it for as long as my son wanted – and that could be hours.”\r\n \r\nAn early riser, Jafari happily looked after his grandson if he woke before the boy’s parents.  “He would give him breakfast and talk to him until we woke up,” his son says.\r\n\r\n\r\n“My son is still asking after his grandfather. At the beginning, we told him his grandfather was away but now we’ve told him the truth. Now when he sees photos of his grandfather, he says: ‘Fire, fire. Bad fire.’ It breaks my heart.”","Credit":"Amelia Hill"}